{
  "post": {
    "title": "Samsung's premium Laser TV becomes world's first certified 8K projector",
    "author": "chrisdh79",
    "id": "1hfjl1c",
    "score": 1862,
    "created_utc": 1734357261.0,
    "selftext": "",
    "num_comments": 199,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hfjl1c/samsungs_premium_laser_tv_becomes_worlds_first/"
  },
  "comments": [
    {
      "id": "m2c01nb",
      "author": "TheW83",
      "body": "I don't understand why they put the \"8.2.2 Dolby Atmos\" system in there. If this were a cheap product then I can understand it, but most people able to afford this would be spending a lot more on a proper sound system.",
      "score": 415,
      "created_utc": 1734359538.0,
      "replies": [
        {
          "id": "m2cccx3",
          "author": "None",
          "body": "I don't even understand Atmos on a phone.",
          "score": 122,
          "created_utc": 1734363869.0,
          "replies": [
            {
              "id": "m2cfae8",
              "author": "MYNAMEISNOTSTEVE",
              "body": "i dont have time for an atmos rant but basically dolby has completely borked the ATMOS meaning. it means one or some of the following: ATMOS codec support, dolbys ATMOS \"processing\" features, multichannel playback beyond stereo in some loose compliance with the ATMOS multichannel spec.",
              "score": 127,
              "created_utc": 1734364831.0,
              "replies": [
                {
                  "id": "m2cgph0",
                  "author": "cat_prophecy",
                  "body": "I could not even tell you what Atmos does. It seems like Dolby has like 400 versions of the same thing that they call *slightly* different names.",
                  "score": 85,
                  "created_utc": 1734365293.0,
                  "replies": [
                    {
                      "id": "m2cqqk1",
                      "author": "LongBeakedSnipe",
                      "body": "I mean, the actual thing is just ceiling speakers right, or speakers that are pointed to bounce off the ceiling? Anything else is presumably just using the brand name to sell shit.",
                      "score": 29,
                      "created_utc": 1734368494.0,
                      "replies": [
                        {
                          "id": "m2dpcgr",
                          "author": "nope_nic_tesla",
                          "body": "It's location-based sound objects defined in 3D space rather than defined by specific channels (including height information which does not exist in older standards), paired with a high quality codec. I have a surround sound setup with proper Atmos support, and Atmos mixes sound noticeably superior to traditional 5.1 or 7.1 mixes. The fact that sound is all defined by location instead of channels also allows for different setups with an arbitrary number of speakers. You aren't limited by 5.1 or 7.1 or whatever.",
                          "score": 61,
                          "created_utc": 1734379256.0,
                          "replies": [
                            {
                              "id": "m2fkm0p",
                              "author": "teenwoof69",
                              "body": "Ahh this made sense to me - ty 🙏",
                              "score": 7,
                              "created_utc": 1734402194.0,
                              "replies": []
                            },
                            {
                              "id": "m2g8n27",
                              "author": "btmalon",
                              "body": "Which in the real world, equates to ceiling speakers for helicopters scenes.",
                              "score": 11,
                              "created_utc": 1734411936.0,
                              "replies": [
                                {
                                  "id": "m2gnv94",
                                  "author": "nope_nic_tesla",
                                  "body": "I think that's an inaccurate oversimplification based on my actual experience with it",
                                  "score": 3,
                                  "created_utc": 1734420367.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m2frv69",
                              "author": "Dr_Dust",
                              "body": "This is a quality explanation.",
                              "score": 1,
                              "created_utc": 1734404894.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m2ctvk6",
                          "author": "Stingray88",
                          "body": "Even up firing Atmos speakers are mostly snake oil. In ideal conditions they can sorta work, but usually not really.",
                          "score": 22,
                          "created_utc": 1734369497.0,
                          "replies": [
                            {
                              "id": "m2cu9cg",
                              "author": "LongBeakedSnipe",
                              "body": "Yup I presumed as much.",
                              "score": 11,
                              "created_utc": 1734369618.0,
                              "replies": []
                            },
                            {
                              "id": "m2dnhk2",
                              "author": "IIIIlllIIIIIlllII",
                              "body": "On par for most audio shenanigans.\n\nAudiophiles are the modern day alchemists",
                              "score": 4,
                              "created_utc": 1734378679.0,
                              "replies": []
                            },
                            {
                              "id": "m2d66uf",
                              "author": "TheElkoEra",
                              "body": "idk, I can usually tell the difference with my setup and room. Could be placebo or some other factor but no buyer's remorse from me.",
                              "score": 3,
                              "created_utc": 1734373349.0,
                              "replies": [
                                {
                                  "id": "m2diord",
                                  "author": "Stingray88",
                                  "body": "It's not that up firing speakers aren't doing anything... they just don't really achieve the goal of Atmos, or surround sound for that matter. \n\nYou'll certainly notice a difference with extra channels. Compare a stereo vs surround sound capable soundbar for instance, there's absolutely a difference. Speaker systems with more channels/drivers will sound \"fuller\", which a lot of people may appreciate (personally, I find it to be a bit of a mess).\n\nBut these systems are no replacement for a proper surround sound or Atmos system with speakers placed in their proper locations around your room. That's the only way you can actually get the directional atmospheric sound as these mixes are intended to be delivering. There's no way around this... it's just physics.",
                                  "score": 5,
                                  "created_utc": 1734377204.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m2d3ihk",
                              "author": "mydadabortedme",
                              "body": "I have a Bose 600 soundbar and in my tiny living room it works well. I can’t imagine it working well for a bigger place or a place with weird dimensions.",
                              "score": 4,
                              "created_utc": 1734372509.0,
                              "replies": [
                                {
                                  "id": "m2dizzv",
                                  "author": "Stingray88",
                                  "body": "To be clear, it's not that up firing speakers aren't doing anything... they just don't really achieve the goal of Atmos, or surround sound for that matter. \n\nYou'll certainly notice a difference with extra channels. Compare a stereo vs surround sound capable soundbar for instance, there's absolutely a difference. Speaker systems with more channels/drivers will sound \"fuller\", which a lot of people may appreciate (personally, I find it to be a bit of a mess).\n\nBut these systems are no replacement for a proper surround sound or Atmos system with speakers placed in their proper locations around your room. That's the only way you can actually get the directional atmospheric sound as these mixes are intended to be delivering. There's no way around this... it's just physics.",
                                  "score": 14,
                                  "created_utc": 1734377300.0,
                                  "replies": [
                                    {
                                      "id": "m2dkg0s",
                                      "author": "balllsssssszzszz",
                                      "body": "Physics once again proving that it will always win in the end",
                                      "score": 8,
                                      "created_utc": 1734377746.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m2e1lsm",
                                      "author": "mydadabortedme",
                                      "body": "Yo thanks for the super informative reply!",
                                      "score": 3,
                                      "created_utc": 1734383098.0,
                                      "replies": [
                                        {
                                          "id": "m2e2iwf",
                                          "author": "Stingray88",
                                          "body": "No problem! I work in post production so anything A/V is my jam :)",
                                          "score": 3,
                                          "created_utc": 1734383387.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m2eubry",
                              "author": "Call_Me_ZG",
                              "body": "Depends on whay youre comparing with tbh.  Keeping price consistent the upward firing definitely create better surround sound. They cant compete with dedicated ceiling mounted speakers of course but for an average user its much easier to come close to ideal conditions for upward firing sound bar than to setup a sound system that will perform better. Esp at a similar price point.\n\n\nIve noticed the bigger problem is content.\nA series would have like 1 episode with 10 seconds where sound is properly mixed to take advantage of it but would be advertised as dolby atmos\n\n\nEdit: im my example im considering a soundbar like samsung 990. So dedicated rear speakers placed in the correct position. I think part of your argument was that speakers need to be in the correct place so we might be in agreement",
                              "score": 1,
                              "created_utc": 1734392664.0,
                              "replies": []
                            },
                            {
                              "id": "m2ez00x",
                              "author": "MexicanTechila",
                              "body": "They work great for me, compared to my in ceiling setup",
                              "score": 0,
                              "created_utc": 1734394345.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m2dipnt",
                      "author": "MYNAMEISNOTSTEVE",
                      "body": "as i said it can be one or some of those three things, so the ATMOS file codec is \"ATMOS\" , the dolby atmos processing that is done to normal stereo files can be called \"ATMOS\" and finally the multichannel speaker setup with an emphasis on height channels can be called ATMOS. all of which should be called something different but i digress.",
                      "score": 2,
                      "created_utc": 1734377212.0,
                      "replies": []
                    },
                    {
                      "id": "m4pf36o",
                      "author": "livevicarious",
                      "body": "ATMOS is just different version of already implemented surround sound. The only real difference is the added height channel. So it's 5.1 with an added channel of height. Thats really it. The mixes are also a bit different, you have location based sound instead of standard \"channels\" so when sound team creates audio they can \"play\" with the audio a bit more and give it locations instead of \"this sound plays from this channel speaker\". Think of a halo around you. Traditional 5.1 has the center, left, right and rear left right (5) and a bass if you have one (.1). \n\nWhen sound mixing for this you would say these sounds go to this speaker at this level of volume. Imagine these FIXED to a certain position on the halo around you. They can put sounds here or there only and at certain levels. Atmos allows them to pick \"locations\" on the halo around you to give more precise sound. With the added bonus of a height channel (vertical halo) above you. This helps the precision a bit more because if for example something flies overhead and to the left, right or behind you tricks your brain better in the perceived surround sound depth. \n\nIt really does make a huge difference, when I finally splurged and got my Bose 900 with surround speakers I had family over and we watched a few movies with great Atmos support and there were times people kept pausing the movie thinking something fell or dropped in the kitchen behind us. There was one movie I loved to put on for people because it had a knock on door scene that the direction was where my front door is and it gets them EVERY time. It literally sounds like someone is at my door. \n\nLast scene was I believe in The Sandman show, there is a rain scene that gives you the effect of rain actually falling down on you. You can hear the rain move from ceiling to floor. It's VERY good when done right. Problem is not all movies/shows have it and those that do only a few really take the time to utilize it properly.",
                      "score": 1,
                      "created_utc": 1735660003.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2d7c8v",
                  "author": "MrOaiki",
                  "body": "Atmos is a way or placing sound in a three dimensional space without specifying which speaker is to play it. When we mix say Dolby 5.1 for a feature film, we need to say which speaker is to play what sound. But with Atmos we say ”it should play from over here” in a 3D space. And then that is converted into physical speakers on the other end. If you have a hundred speakers, that position in space will be perfect and exact. If you only have four speakers, not so much. And if you only have two, like AirPods, it won’t be precise at all but it will try to simulate 3D space.",
                  "score": 13,
                  "created_utc": 1734373705.0,
                  "replies": [
                    {
                      "id": "m2djlgm",
                      "author": "MYNAMEISNOTSTEVE",
                      "body": "the object based codec is one part of ATMOS, yes. \nbut it is hardly the first object based codec. and dolbys marketing of it has only added extreme confusion as a set of speakers by themselves should not be considered \"ATMOS\" yet the marketing has really pushed all kinds of things to have the name slapped on it.",
                      "score": 2,
                      "created_utc": 1734377483.0,
                      "replies": [
                        {
                          "id": "m2dq3sj",
                          "author": "MrOaiki",
                          "body": "What codecs? Any wide spread ones? And what things? If they natively support the codec they are per definition Atmos products.",
                          "score": 2,
                          "created_utc": 1734379494.0,
                          "replies": [
                            {
                              "id": "m2dtgv9",
                              "author": "MYNAMEISNOTSTEVE",
                              "body": "DTS:X & MPEG-H 3D are two. \n\na passive speaker doesnt natively support any codec. its an analogue device. but \"ATMOS\" is being used to refer to all 3 points that i mentioned not just codec support.",
                              "score": 1,
                              "created_utc": 1734380555.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m2lcjr2",
                      "author": "gomurifle",
                      "body": "So basically the name means \"atmospheric sound\" then? ",
                      "score": 1,
                      "created_utc": 1734486688.0,
                      "replies": [
                        {
                          "id": "m2scq6v",
                          "author": "MrOaiki",
                          "body": "Maybe the name derives from that, but it’s rather a wide-spread standard from mixing to pressing play. I say I want the sound to play right above the audiences head, and it will play right above the audiences head as long as it’s Atmos all the way.",
                          "score": 1,
                          "created_utc": 1734590121.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m2d0szs",
                  "author": "Fredasa",
                  "body": "It's basically the same philosophy behind Samsung calling their hopelessly hamstrung LCD standard \"QLED\".  It carries the potential of tricking some consumers into making a bad assumption and purchasing a product based on said assumption.",
                  "score": 5,
                  "created_utc": 1734371671.0,
                  "replies": [
                    {
                      "id": "m2db3a8",
                      "author": "throwawaybottlecaps",
                      "body": "I think QLED is Samsungs name for LCD televisions with a Quantum dot coating.  The coating more or less allows the blue led backlight to project a strong white light.  I’m sure Samsung is leaned into making it sound like OLED to increase marketability, but it’s still a legit improvement and new technology over older LCD TVs which can’t produce a pure white backlight.",
                      "score": 6,
                      "created_utc": 1734374867.0,
                      "replies": [
                        {
                          "id": "m2e3vub",
                          "author": "Fredasa",
                          "body": "You have to know what you're buying into when you get a Samsung.  They saddle the user with a bevy of non-defeatable quirks, many of which are exclusive to the brand.\n\nQuick example: Every QLED uses dithering, which effectively lowers the resolution and per-pixel color reproduction below the panel's 4K.  The only way to disable it is to label your input as \"PC\".  But it still comes right back if you stray from 29.97, 30, 59.94 or 60 Hz... such as when watching a movie at its native framerate.  There isn't a service menu option to wrestle with this.",
                          "score": 4,
                          "created_utc": 1734383815.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m2dj20z",
                      "author": "MYNAMEISNOTSTEVE",
                      "body": "both ATMOS and QLED have markedly new technologies in them. QLED specifically is a way for significantly better performance LCD panels with a much smaller price hike than OLED.",
                      "score": 1,
                      "created_utc": 1734377317.0,
                      "replies": [
                        {
                          "id": "m2eia4g",
                          "author": "jjayzx",
                          "body": "QLED is LCD panels, not LED. They are backlit by LEDs like any modern LCD TV.",
                          "score": 2,
                          "created_utc": 1734388453.0,
                          "replies": [
                            {
                              "id": "m2fv5kq",
                              "author": "MYNAMEISNOTSTEVE",
                              "body": "good catch, will correct",
                              "score": 1,
                              "created_utc": 1734406171.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m2f0yme",
                  "author": "Advanced-Blackberry",
                  "body": "Atmos LogicIIs coming soon ",
                  "score": 1,
                  "created_utc": 1734395051.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2cnj0a",
              "author": "JeffCrossSF",
              "body": "Its amazing.\n\nApple Music uses a binaural renderer to recreate the illusion of a 7.1.4 speaker system using just headphones. On my MacBook Pro, Atmos comes out of just two speakers using a similar method and is shockingly 3D.",
              "score": 8,
              "created_utc": 1734367485.0,
              "replies": [
                {
                  "id": "m2d27bd",
                  "author": "Hypnotized78",
                  "body": "Well placed stereo speakers sound 3d with good content.",
                  "score": 3,
                  "created_utc": 1734372101.0,
                  "replies": [
                    {
                      "id": "m2iujn5",
                      "author": "JeffCrossSF",
                      "body": "Not the same at all. And yes, I agree with you to a limited extent. I’ve even had CTC stereo speakers which extreme separation between speakers. Atmos is not a wide stereo gimmick - it is a completely new way to mix and place sounds in 3D space. \n\nBinaural sound has been around for a long time but the tools available now are far more sophisticated.",
                      "score": 2,
                      "created_utc": 1734456630.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m2c9svr",
          "author": "None",
          "body": "I bet there are a lot of rich. They do not give a shit about audio. \n\nI mean, the entire movie industry doesn’t. Why would some random rich person buying $1 trillion TV?",
          "score": 124,
          "created_utc": 1734363009.0,
          "replies": [
            {
              "id": "m2eb640",
              "author": "sicurri",
              "body": "I'll take anything better than a sound bar, but I'm honestly still happy with a decent sound bar. I'm pretty sure like 75% of people are like this. However, I am an image quality and internet speed snob, lol.",
              "score": 20,
              "created_utc": 1734386118.0,
              "replies": [
                {
                  "id": "m2es8jk",
                  "author": "TooStrangeForWeird",
                  "body": "I use a fairly nice guitar amp as a speaker. It has quite the range. Especially the bass!",
                  "score": 8,
                  "created_utc": 1734391904.0,
                  "replies": [
                    {
                      "id": "m2eykab",
                      "author": "asianflipboy",
                      "body": "Please share the model!",
                      "score": 1,
                      "created_utc": 1734394187.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2hm6ks",
                  "author": "None",
                  "body": "Dude, same snob. I’m running 50 up right now. I’ve never seen it hit 50 before. \n\nIt’s the worst feeling. I can’t stand it.",
                  "score": 1,
                  "created_utc": 1734441141.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2ky9t5",
              "author": "654456",
              "body": "They still spend money like they do. So many surrounds in the ceiling",
              "score": 1,
              "created_utc": 1734481440.0,
              "replies": [
                {
                  "id": "m2lcwbh",
                  "author": "None",
                  "body": "It might be installed but do they know how to use the remote tho lol",
                  "score": 1,
                  "created_utc": 1734486816.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2eftih",
              "author": "Xylamyla",
              "body": "$1 trillion? This thing probably costs ~$8K, $12K tops.",
              "score": 0,
              "created_utc": 1734387636.0,
              "replies": [
                {
                  "id": "m2eya9z",
                  "author": "poshy",
                  "body": "More like 50-100k",
                  "score": 0,
                  "created_utc": 1734394086.0,
                  "replies": [
                    {
                      "id": "m2f1704",
                      "author": "Advanced-Blackberry",
                      "body": "There’s nothing to suggest that. Samsung isn’t playing at the Christie level.  They have a consumer grade projector here. I’d be very surprised if it was even $7500. They aren’t even playing against JVC. ",
                      "score": 3,
                      "created_utc": 1734395134.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2foh4d",
              "author": "CAPS_LOCK_OR_DIE",
              "body": "The entire film industry DOES give at least some of a shit about audio. Otherwise myself and a lot of other people would be out of work. \n\nI think you’d be extremely surprised at the amount of money spent on sound for any given set.",
              "score": -2,
              "created_utc": 1734403626.0,
              "replies": [
                {
                  "id": "m2hmpc8",
                  "author": "None",
                  "body": "Half joking.  \n\nAnd I’m sure they do for the theater but y’all suck ass at stereo tv mixing. Ask literally anyone.\n\n\nMight as well let AI do it. I can’t think of a single movie that didn’t have over the top loud audio at some point and vocals that are buried. \n\nWhy do you think subtitles have become more popular.",
                  "score": 3,
                  "created_utc": 1734441367.0,
                  "replies": [
                    {
                      "id": "m2l9tjw",
                      "author": "LowOnPaint",
                      "body": "Maybe that’s because it’s not mixed for stereo, it’s mixed for a full system and all you have access to is L/R channels.",
                      "score": 2,
                      "created_utc": 1734485686.0,
                      "replies": [
                        {
                          "id": "m2ld2p5",
                          "author": "None",
                          "body": "You’re making my point. If most people’s TVs are stereo then that’s the format they should be mixing it for once the movie comes out to the public. \n\nBut they won’t do that because it’s more money and will cut into their profits.",
                          "score": 3,
                          "created_utc": 1734486881.0,
                          "replies": [
                            {
                              "id": "m2lhwqz",
                              "author": "LowOnPaint",
                              "body": "So according to you, it should be mastered specifically for the people who give so little thought or care to audio that they can’t even bother to invest in a basic 3.1 audio system through something as cheap as a soundbar. Yes, let’s screw over all the people who actually enjoy cinema enough to do the bare minimum to have a somewhat decent audio experience so that you can hear stuff better through the shit speakers in the back of your TV. I forgot the world revolves around you, my apologies.",
                              "score": 1,
                              "created_utc": 1734488700.0,
                              "replies": [
                                {
                                  "id": "m2ln1wd",
                                  "author": "None",
                                  "body": "Ah a poor tax. You only get to experience the movie how it was meant to sound if you can buy the right sound equipment. Forget the tv you just dropped good money on those speakers are useless ! \n\nAlso pretty sure you can have multiple audio setting for media so it wouldn’t cause people who have actual sound systems any problems.  It’s more of a quality of life feature, but 🦆 the working class am I right!\n\nMaybe you should consider thinking before you talk or write anymore. Because your argument does not hold up in the slightest.",
                                  "score": 2,
                                  "created_utc": 1734490665.0,
                                  "replies": [
                                    {
                                      "id": "m2ln5na",
                                      "author": "LowOnPaint",
                                      "body": "Life isn’t fair. Deal with it.",
                                      "score": 1,
                                      "created_utc": 1734490705.0,
                                      "replies": [
                                        {
                                          "id": "m2lnc9i",
                                          "author": "None",
                                          "body": "Yeah I know I have to talk with this kind of stupidity all the time",
                                          "score": 2,
                                          "created_utc": 1734490777.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m2lluu7",
                  "author": "dan-theman",
                  "body": "I might believe this if they stopped screwing with the dynamic range. Not everyone can have theater sound in their home and without house shaking explosions the talking is too quiet.",
                  "score": 1,
                  "created_utc": 1734490209.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2canlb",
          "author": "DarkElation",
          "body": "Sadly, most people don’t know what a proper sound system actually is and if they do they definitely wouldn’t be using a projector as their sound system.",
          "score": 9,
          "created_utc": 1734363298.0,
          "replies": []
        },
        {
          "id": "m2csqk8",
          "author": "notjustforperiods",
          "body": "I dunno, just anecdotally I've seen a lot of people with expensive TVs and no sound system\n\na lot of those people also just stick with the default video settings\n\nnot judging or making fun, just people with money that buy expensive shit aren't necessarily audiophiles or whatever too",
          "score": 6,
          "created_utc": 1734369134.0,
          "replies": []
        },
        {
          "id": "m2cxw3i",
          "author": "ObviouslyTriggered",
          "body": "A proper sound system requires a lot of space, if space is not an issue a short throw projector isn’t something you’ll be looking at. \n\nAlso expensive is relative this will be considerably cheaper than proper projectors and in-line with high end large screen OLEDs like the G series from LG. \n\nYou’ll be looking at circa $4-5000 for this, the JVC-NZ900 which is an 8K cinema projector on the other hand costs about $30,000.",
          "score": 4,
          "created_utc": 1734370763.0,
          "replies": []
        },
        {
          "id": "m2drjv6",
          "author": "0ddLeadership",
          "body": "90 percent of people dont care about the audio that much.",
          "score": 2,
          "created_utc": 1734379951.0,
          "replies": [
            {
              "id": "m2dsn5i",
              "author": "TheW83",
              "body": "It's actually about 38.75% according to my also made up numbers.",
              "score": 5,
              "created_utc": 1734380294.0,
              "replies": [
                {
                  "id": "m2e18vf",
                  "author": "0ddLeadership",
                  "body": "i just looked it up and it says 41 percent uses surround sound ur actually not far off lmao. it also says use has declined since covid which i find kinda odd",
                  "score": 2,
                  "created_utc": 1734382986.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2cs35c",
          "author": "Vegetable-Debate-263",
          "body": "I’d assume most people using this will have separate high-end speakers to attach it to and therefore, the in-unit sound will be fine but not amazing.",
          "score": 1,
          "created_utc": 1734368926.0,
          "replies": []
        },
        {
          "id": "m2d8a58",
          "author": "Catymandoo",
          "body": "“It has more numbers - it must be better” brigade of consumer.",
          "score": 1,
          "created_utc": 1734373996.0,
          "replies": []
        },
        {
          "id": "m2dby94",
          "author": "badger_flakes",
          "body": "Don’t need a sound system in my nursery when I put this TV in there for playing Bluey and Puppy Dog Pals.",
          "score": 1,
          "created_utc": 1734375134.0,
          "replies": []
        },
        {
          "id": "m2f54na",
          "author": "theslootmary",
          "body": "And that’s exactly what they’ll do… so why not put something in so it works out the box before you integrate it with the proper sound system?\n\nYou know how all high end TVs have speakers (crap ones) even though they’ll be used with at least soundbar?",
          "score": 1,
          "created_utc": 1734396548.0,
          "replies": []
        },
        {
          "id": "m2gm2in",
          "author": "aykay55",
          "body": "That doesn’t even make sense cuz afaik Dolby is not channels based it uses software objects",
          "score": 1,
          "created_utc": 1734419248.0,
          "replies": []
        },
        {
          "id": "m2o7v57",
          "author": "soonerfreak",
          "body": "One of my best friends spent 4k on a 80inch Sony 4k TV and doesn't even have a sound bar.",
          "score": 1,
          "created_utc": 1734536811.0,
          "replies": []
        },
        {
          "id": "m2c2y5l",
          "author": "anethma",
          "body": "Ya I’ve always found that a weird decision. \n\nI’m also curious about the native resolution of the projector. It certainly won’t be 8k. MAYBE 4k with pixel shift but it would be Samsungs first actual 4k projector. Maybe smaller res and even more pixel shift ?",
          "score": 1,
          "created_utc": 1734360607.0,
          "replies": [
            {
              "id": "m2c3o9x",
              "author": "TheW83",
              "body": "I think the \"8k Certification\" requires a native 8k resolution, but I'm seeing some sources say native and some just say 8k.",
              "score": 13,
              "created_utc": 1734360868.0,
              "replies": [
                {
                  "id": "m2cx73b",
                  "author": "anethma",
                  "body": "Ok dug quite a bit deeper. It is listed as a DLP projector and I checked TIs parts catalog and the largest DLP they list is a new 0.8” 4k DMD part. \n\nSo this 8k projector will be native 4k pixel shifted up to 8k guaranteed. \n\nWhich is still pretty exciting. Native 4k projectors used to be in the realm of very expensive JVC and Sony projectors.  There are no normal consumer 4k native projectors before this.",
                  "score": 3,
                  "created_utc": 1734370542.0,
                  "replies": []
                },
                {
                  "id": "m2cutcc",
                  "author": "anethma",
                  "body": "Considering Samsung has never even made a native 4k projector I’d be kind of surprised if they just came out with a native 8k one but maybe they did. Be interesting to see deeper but not able to find much technical info yet.",
                  "score": 1,
                  "created_utc": 1734369794.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2c8o4x",
              "author": "thehighshibe",
              "body": "article says it projects at 7,680 x 4,320 , so 8K natively",
              "score": 5,
              "created_utc": 1734362623.0,
              "replies": [
                {
                  "id": "m2cue6u",
                  "author": "anethma",
                  "body": "I understand that but that doesn’t mean it’s a native 8k projector. It will most likely use pixel shift. For example Samsung has a bunch of 4k projectors out there, not a single one being native 4k.",
                  "score": 3,
                  "created_utc": 1734369660.0,
                  "replies": [
                    {
                      "id": "m2q70kd",
                      "author": "thehighshibe",
                      "body": "did some research and you're right they haven't said if its pixel shift or not, but I feel like them saying that actual pixel count x pixel count points towards it being true 8K on a single chipset, like how pixel shift 4K projectors are '4K' , marketed as 4K and by all accounts 4K clarity, but they're not actually throwing 3840/4096x2160 pixels. Them going out of their way to say it'll be 7680x4320, I would think its an 8K chipset",
                      "score": 1,
                      "created_utc": 1734559096.0,
                      "replies": [
                        {
                          "id": "m2rspb6",
                          "author": "anethma",
                          "body": "I looked into it some more, and its a 4k chip with pixel shift.\n\nI dug into TIs DLP parts and they only now have a new 4k DLP 0.8\" chip. No 8k chip. \n\nSo ya, 4k with 2 way pixel shift would give us 8K apparent.\n\nOn the plus side this will also mean this year coming up we should see some actual 4k native ultra short throw projector hit the market which is actually kind of exciting.",
                          "score": 1,
                          "created_utc": 1734580259.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2c4txh",
      "author": "DublaneCooper",
      "body": "I can’t wait to buy this so I can enjoy all of the 8k content!",
      "score": 161,
      "created_utc": 1734361279.0,
      "replies": [
        {
          "id": "m2c93rl",
          "author": "Bhraal",
          "body": "I can't wait to see the LTT video in a month with this as a center piece of a new entertainment setup and then forget about it forever.",
          "score": 68,
          "created_utc": 1734362771.0,
          "replies": [
            {
              "id": "m2dxhut",
              "author": "internetlad",
              "body": "As Linus drops it on the floor and makes the \"oopsie whoopsie\" face into the camera. What a silly guy.",
              "score": 23,
              "created_utc": 1734381823.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2ce34d",
          "author": "AndarianDequer",
          "body": "And soon there won't be any companies making Blu-ray players anymore! \n\nWho is this product fucking marketed to? Certainly not streaming...",
          "score": 4,
          "created_utc": 1734364440.0,
          "replies": []
        },
        {
          "id": "m2cq040",
          "author": "None",
          "body": "[deleted]",
          "score": 23,
          "created_utc": 1734368261.0,
          "replies": [
            {
              "id": "m2cvtkb",
              "author": "43AgonyBooths",
              "body": "\"I want to be able to count every one of Uncle Ted's nostril hairs!\"",
              "score": 38,
              "created_utc": 1734370109.0,
              "replies": [
                {
                  "id": "m2gc5fh",
                  "author": "None",
                  "body": "“SEE!! I told you he didn’t trim!!”",
                  "score": 4,
                  "created_utc": 1734413691.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2dflud",
              "author": "itsaride",
              "body": "It's the law of diminishing returns again. Most people still find 720p and certainly 1080p completely adequate and you need impractically large displays to really merit 8K.",
              "score": 15,
              "created_utc": 1734376257.0,
              "replies": [
                {
                  "id": "m2emupx",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 14,
                  "created_utc": 1734389998.0,
                  "replies": [
                    {
                      "id": "m2fj28t",
                      "author": "alidan",
                      "body": "thats the back end not the consumer faceing product, at that point its always made sense to film on a higher standard than you are going to use, but in practicality, I think at the distance we watch tv in our liveing room, and my own experiences with 480/720/1080/4k in my room, at 7 feet away from a 55 inch tv, 720p is more than enough out side of edge cases where you have extreme contrast on a pixel by pixel level and we really only see that in games. \n\nfor 4k or even 8k, what they offer is stars in the sky, minor details that can pop, and you will see those even at distance, but for the most part, even 1080p would be overkill if you take the whole picture into consideration.",
                      "score": 4,
                      "created_utc": 1734401614.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2ejuh6",
                  "author": "jjayzx",
                  "body": "Most people don't have a screen size to distance of screen ratio for getting the full quality of 4K. 8K is a waste for typical home usage. Heck it's probably too much for common home theatre setups.",
                  "score": 4,
                  "created_utc": 1734388974.0,
                  "replies": [
                    {
                      "id": "m2fjh2i",
                      "author": "alidan",
                      "body": "I have a 55 inch 4k tv as my monitor, im about 2-4 feet from it at any given moment and even that is hard for me to justify higher ppi, I mean I can use it, but is it worth it, at 7-10 feet (watching on my bed) the image could be 720 and I wouldn't notice the difference, hell, even 480p can be hard to tell depending on the source material at that distance, outside of points of light that are sharp, which is not common in non gaming scenarios.",
                      "score": 1,
                      "created_utc": 1734401769.0,
                      "replies": [
                        {
                          "id": "m2fz8lm",
                          "author": "HeftyArgument",
                          "body": "why lie, 480p is horrible.\n\nthe difference between 1080p 2k and 4k pretty hard to\ndiscern unless you have larger screens though",
                          "score": 4,
                          "created_utc": 1734407795.0,
                          "replies": [
                            {
                              "id": "m2gmxk3",
                              "author": "alidan",
                              "body": "at distance, it barely matters, what matters more is most stuff shot for 480p used dogshit cameras and optics, things on film (most of the time) mastered to a 480p format, you may notice it at distance, but probably not, and don't go to youtube and press 480p and say it looks like shit, of course it looks like shit, youtube compresses even 1080p video to sub vhs bitrates.",
                              "score": 0,
                              "created_utc": 1734419784.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m2hd9vk",
                  "author": "Curse3242",
                  "body": "I think 1080p is the sweet spot if you have a great laptop screen. For a monitor it's 1440p.\n\nOn TVs 4k is really good. So I assume if in future we're all going to have 100inch TVs, that's when we'll need 8K\n\nBut again a lot of content isn't 4k already. Even the ones there is pretty expensive",
                  "score": 1,
                  "created_utc": 1734436874.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2eoz6n",
              "author": "audigex",
              "body": "I can understand people wanting the best possible quality for a once in a lifetime event like a wedding\n\nBut that doesn’t mean it’s coming to consumer media content anytime soon.\n\nEventually, sure - there will be a point where the disk space and bandwidth get cheap enough that it’s basically free for streaming services to offer it… but we’re still a long way from that, considering they’re still barely even committing to 4K and compromise on bitrate for 4k and 1080p content",
              "score": 2,
              "created_utc": 1734390747.0,
              "replies": []
            },
            {
              "id": "m2gzxov",
              "author": "ArdiMaster",
              "body": "Doubtful. The EU has tightened energy efficiency requirements for displays to the point that 8K displays are effectively banned, so that’s a sizable market that will likely never be able to view any.",
              "score": 2,
              "created_utc": 1734428492.0,
              "replies": []
            },
            {
              "id": "m2e0me5",
              "author": "naynaythewonderhorse",
              "body": "That’s not indicative of reality at all.\n\nA privately made video? Okay. Sure. Find a device that will allow playback of the file at full resolution. The customers want something that they probably can’t even playback at the resolution they want. They’d be better off having it filmed at 70mm or some shit.\n\nIn the large scale commercial scale, 8K is simply not happening. There are next to no films being mastered in 8K, and 4K is surprisingly “new” in terms of being mastered as 2K was the standard throughout all of the 90’s - late 2010’s. Even older films shot on film aren’t being remastered in 8K. Some are scanned at 8K (very few) but the actual remaster is being done on a 4K intermediate.\n\nOh, and a rerender of 2K to 4K is an insane ask, and I don’t think has ever been done on a big budget film because the difference is so negligible. 4K to 8K rerenders are even less of an ask. Why the hell would studios even care if 2K films upscale to 4K are already thought to be true 4K by general audiences.\n\n8K is a scam for fool who don’t know any better. It’s just so TV manufacturers can sell you a more expensive TV when the reality is that TV tech has stagnated completely and there’s not much else for it to go.",
              "score": 1,
              "created_utc": 1734382791.0,
              "replies": [
                {
                  "id": "m2e4591",
                  "author": "Goolsby",
                  "body": "That's a really long comment just to say \"I've never seen 8k with my own eyes and have no clue what I'm talking about\"",
                  "score": 4,
                  "created_utc": 1734383897.0,
                  "replies": [
                    {
                      "id": "m2eohdj",
                      "author": "naynaythewonderhorse",
                      "body": "I’ve seen 8K content, mostly sourced content designed to show of “these are the capabilities of 8K” rather entertainment created for the resolution.\n\nHell, I’ve seen film on 70mm, which is higher than 8K. Like, objectively. It’s all about resolution, and 8K is mostly irrelevant in the conversation.\n\n8K is a scam, through and through.\n\nPlease enlighten me as to which specific aspects of my comment were incorrect. Instead of just saying “No, you’re wrong.” after incorrectly summarizing my statement.\n\nFurther, please enlighten me as to where this mythical 8K content that is easily accessible to the public exists.\n\n(Sorry if I come off as confrontational. I see your reply as very rude and making statements without explaining anything.)",
                      "score": 1,
                      "created_utc": 1734390570.0,
                      "replies": [
                        {
                          "id": "m2evx9y",
                          "author": "MEGADOR",
                          "body": "Pixel density matters. 1080p looks objectively better on a 4k screen than it does on a 1080p screen because of the pixel density on a 4k screen. One doesn't need 8k content to enjoy an 8k screen.",
                          "score": -1,
                          "created_utc": 1734393238.0,
                          "replies": [
                            {
                              "id": "m2f4wks",
                              "author": "naynaythewonderhorse",
                              "body": "Did you read my parent comment at all? Sorry if I got a bit off track, but I was questioning the viability or realistic nature of 8K being a thing.\n\nHigher resolutions, especially in a VFX heavy film industry, means higher rendering time, and more expensive render farms, and that means spending more money. Studios obviously don’t want to do that. The fact that most people don’t realize how much 4K content is actually 2K content speaks to that.\n\nAnd for what? Denser pixels, you say? The benefits of going from 4K to 8K simply aren’t the same as 1080p to 4K. Content is not really being future proofed for 8K because audiences can barely tell the difference between a 2K upscale and a true 4K master. The files are being put on disc without compression. Played as if they are straight from the digital masters. There’s no “improving” that content.\n\nAnd ALLLLLL of that has a big old asterisk on it, which is the assumption that a restoration is done well and isn’t DNR’d to hell. Which sucks when big names like James Cameron and Peter Jackson are releasing “remastered 4K” versions of their mastered on a 2K-intermediate films that look like they’ve been smothered in petroleum jelly.",
                              "score": 1,
                              "created_utc": 1734396467.0,
                              "replies": []
                            },
                            {
                              "id": "m2fl6ao",
                              "author": "alidan",
                              "body": "depends, most tv's have some level of processing that happens that you cant turn off outside of pc mode or gaming, at that point its entirely up to the processor in the display to not fuck up the 1080p to 4k conversion, our tv in the living room has horrific upscaling outside of if you enable smooth motion as well, so its either deal with a I believe 12 year old 55 inch that has its side lit backlighting de laminating, and have worlds better 1080p/720p, or have good 4k but with smoothing.\n\nits annoying but it is what it is.",
                              "score": 1,
                              "created_utc": 1734402403.0,
                              "replies": []
                            },
                            {
                              "id": "m2fzk0u",
                              "author": "HeftyArgument",
                              "body": "I disagree with this one, i had a 4k monitor\nand 1080p looked like absolute trash compared to my other monitor that was 1080p native",
                              "score": 0,
                              "created_utc": 1734407921.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2ok00l",
              "author": "GrayDaysGoAway",
              "body": "Sure, but for 99.9% of content that eventuality is years from now, long after these projectors have been rendered obsolete by much better, cheaper successors.",
              "score": 1,
              "created_utc": 1734540706.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2ccibv",
          "author": "None",
          "body": "Blu-ray going obsolete. 8K tv is coming. What kind of video are we going to watch?",
          "score": 7,
          "created_utc": 1734363919.0,
          "replies": [
            {
              "id": "m2ch0jo",
              "author": "cat_prophecy",
              "body": "Nothing, because the streaming video will be compressed to shit anyway. It's just the same old shit every time a \"new\" resolution standard comes out. People will watch the same things they were watching before, just scaled up to \"8K\" and they will rave about how good it looks even though it's just stretched 4K.",
              "score": 32,
              "created_utc": 1734365391.0,
              "replies": [
                {
                  "id": "m2fb7dp",
                  "author": "Rdubya44",
                  "body": "Wouldn't you have greater pixel density so the upscaled 4k would look better?",
                  "score": 3,
                  "created_utc": 1734398749.0,
                  "replies": [
                    {
                      "id": "m2g60u5",
                      "author": "cat_prophecy",
                      "body": "Take a 1920x1089 image and stretch it to fit a 4K screen. Regardless of the pixel density, it's going to look terrible.",
                      "score": 2,
                      "created_utc": 1734410703.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2cddmw",
              "author": "zezoza",
              "body": "Netflix ad tier, probably.",
              "score": 7,
              "created_utc": 1734364206.0,
              "replies": []
            },
            {
              "id": "m2d991z",
              "author": "Acme_Co",
              "body": "No one will be telling the difference between 4k and 8k without a massive screen.",
              "score": 1,
              "created_utc": 1734374296.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2e3uvu",
          "author": "Goolsby",
          "body": "You've been missing out for 3 years, Ive been watching new weekly 8k content on YouTube for a while now.",
          "score": 2,
          "created_utc": 1734383807.0,
          "replies": []
        },
        {
          "id": "m2d1jiz",
          "author": "iwellyess",
          "body": "Go outside and get it for free",
          "score": 1,
          "created_utc": 1734371896.0,
          "replies": []
        },
        {
          "id": "m2d4osb",
          "author": "shyhornybitch",
          "body": "*while downloading dvdrips on emule :)",
          "score": 1,
          "created_utc": 1734372875.0,
          "replies": []
        },
        {
          "id": "m2ffl6m",
          "author": "hybroid",
          "body": "8K content upscaling from 4K is part of the specification. So there's tons of content, almost everything around us.",
          "score": 1,
          "created_utc": 1734400337.0,
          "replies": []
        },
        {
          "id": "m2fodqq",
          "author": "Flash_Discard",
          "body": "Those 3 YouTube videos in 8k going to be lit.",
          "score": 1,
          "created_utc": 1734403591.0,
          "replies": []
        },
        {
          "id": "m2cyq3e",
          "author": "MadOrange64",
          "body": "Are the “8k content” in the room with us?",
          "score": 1,
          "created_utc": 1734371019.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2c754e",
      "author": "Komikaze06",
      "body": "They didn't list the price, i can only assume it's like $15k or something",
      "score": 48,
      "created_utc": 1734362094.0,
      "replies": [
        {
          "id": "m2fn4su",
          "author": "JustOneMorePuff",
          "body": "That might be a bargain. High end projectors can easily cost $30k. But it is the ultimate screen",
          "score": 16,
          "created_utc": 1734403130.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2c4r5f",
      "author": "edu5150",
      "body": "I am at the point where my current television is just fine.",
      "score": 61,
      "created_utc": 1734361251.0,
      "replies": [
        {
          "id": "m2chf3g",
          "author": "cat_prophecy",
          "body": "I bought my TV at the end of 2019; a higher-end, Samsung QLED. I honestly can't see why anyone would need \"more\" out of a TV.  Maybe I am a luddite. But to me it look good, the viewing angles are good, and the only real weakness it had (sound) was fixed by buying a quality soundbar.\n\nMaybe OLED TVs are \"better\" but some metric, but I don't really think they're worth the extra money.",
          "score": 39,
          "created_utc": 1734365521.0,
          "replies": [
            {
              "id": "m2egb6m",
              "author": "Xylamyla",
              "body": "I bought an LG B2 65” for $1500 about 2 years ago and could never go back. As someone who enjoys a good display, OLED is definitely superior to any backlit display, especially when viewing in a dark room. And since I’m busy during the day, nighttime is when I get most of my TV-use.",
              "score": 13,
              "created_utc": 1734387798.0,
              "replies": [
                {
                  "id": "m2ejvt4",
                  "author": "cat_prophecy",
                  "body": "When I bought my TV, the OLED models were twice as expensive as anything else.",
                  "score": 5,
                  "created_utc": 1734388986.0,
                  "replies": [
                    {
                      "id": "m2hr0u5",
                      "author": "twitty80",
                      "body": "They still are",
                      "score": 3,
                      "created_utc": 1734443154.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2clqqv",
              "author": "bagkingz",
              "body": "We getting old and keeping up isn’t fun anymore.",
              "score": 11,
              "created_utc": 1734366916.0,
              "replies": [
                {
                  "id": "m2di2of",
                  "author": "dilroopgill",
                  "body": "Your average tv is way better than your old average tv tho, like even with cheaper ones I never have an issue with viewing angles or lighting like I used to.   That used to be the main reason to upgrade, marginal improvements.  Once we hit 4k from the distance most ppl watch theres no reason to go up.",
                  "score": 13,
                  "created_utc": 1734377017.0,
                  "replies": []
                },
                {
                  "id": "m2g1syl",
                  "author": "csgothrowaway",
                  "body": "I mean, the changes actually are incremental, right? Or maybe I am just getting old.\n\nBut to me, the jump to 1080p was massive. 4K is cool but definitely not as big of a jump. And 8K...I really don't think even the average tech enthusiast can stand 10 feet away from a 70\" TV and tell you if an image is 4K or 8K, without having the two side by side to compare. \n\nAnd then if you're into video games, you're losing out on frame rate just to broadcast in 8K when you probably cant tell the difference. Give me back half my frames and I'll play in 4K. Shit, if I'm honest, I choose to play games in 1080p when I can play in 4k, just because I want the frame rate.",
                  "score": 3,
                  "created_utc": 1734408851.0,
                  "replies": [
                    {
                      "id": "m2sibaj",
                      "author": "CosmicCreeperz",
                      "body": "8K is actually 4x the pixels of 4K since it’s the number of horizontal pixels… and double the W & H means quadruple the area :)\n\nWhich just further reinforces your point… 8K is a huge waste of resources to render for games that no one will notice.  There’s still a lot more that can be done with 4K with full ray tracing, higher poly count and texture detail, better FSAA, etc.",
                      "score": 1,
                      "created_utc": 1734593556.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2d1yda",
              "author": "iwellyess",
              "body": "They’ve reached peak form, like the iPhone as of several generations back, from now on we’ll just see minor tweaks and upgrades. Which is… fine. What else you gonna do lol.",
              "score": 7,
              "created_utc": 1734372023.0,
              "replies": [
                {
                  "id": "m2g2980",
                  "author": "csgothrowaway",
                  "body": "I hope people get bored and want a flashy new thing, which might drive us towards accessible VR.\n\nI'm still shocked and stunned by how much the Valve Index knocked me on my ass, especially Half-Life: Alyx. But software wise, nothing has come since and I imagine its because Valve is the only company interested in investing a ton of money into a AAA VR games. But there is still [progress being made](https://youtu.be/tIIWYh601tg?t=39) in the VR space. I just hope it reaches a point of being affordable so that there's enough people to justify developers building more games and content for it.",
                  "score": 1,
                  "created_utc": 1734409043.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2lab6v",
              "author": "KypAstar",
              "body": "OLED is the last \"worth it\" move. ",
              "score": 1,
              "created_utc": 1734485865.0,
              "replies": []
            },
            {
              "id": "m2cz0re",
              "author": "quarterto",
              "body": "i mean shit my current TV is a fifteen year old 1080p 32\" LCD and i don't feel the need to upgrade",
              "score": 0,
              "created_utc": 1734371111.0,
              "replies": [
                {
                  "id": "m2dzslf",
                  "author": "TieDyedFury",
                  "body": "I mean you do you, but a 32” screen makes me feel like I’m in a shitty hotel room. Big TVs are so cheap now.",
                  "score": 6,
                  "created_utc": 1734382538.0,
                  "replies": []
                },
                {
                  "id": "m2dthk5",
                  "author": "bamboob",
                  "body": "I'm with ya",
                  "score": 1,
                  "created_utc": 1734380562.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2cj679",
              "author": "2g4r_tofu",
              "body": "IMO most content doesn't look better at 4k than it does at 1080p. Heck sometimes I watch 480p content and it's not great but it's good enough for some things.",
              "score": -3,
              "created_utc": 1734366092.0,
              "replies": [
                {
                  "id": "m2cqxaw",
                  "author": "Lv_InSaNe_vL",
                  "body": "I'm guessing you're streaming, and if so, it's because 4k content will literally look worse than 1080p. Things like YouTube stream 4k at such a low bit rate you can sometimes get higher data rates compared to the 1080p stream. YouTube is the only one that gives you actual numbers so I can't compare it 1:1 to other streaming services, but they all look like they do the same thing to me. \n\nGet you some high quality 4k Blu-ray disks and there's a world of difference.",
                  "score": 8,
                  "created_utc": 1734368553.0,
                  "replies": [
                    {
                      "id": "m2d4hb0",
                      "author": "TheBigLeMattSki",
                      "body": "A lot of regular Blu Rays look better than 4K streams in my experience.\n\nThere's just so much more depth to the color from a Blu Ray compared to streaming, even if the picture itself is sharp on the stream.",
                      "score": 7,
                      "created_utc": 1734372810.0,
                      "replies": [
                        {
                          "id": "m2d5v5j",
                          "author": "Lv_InSaNe_vL",
                          "body": "Just for some numbers. \n\n* 1080p Blu-ray tops out at 40Mbps\n* 4k Blu-ray tops out at 144Mbps\n* Doing a little bit of testing on my computer (speed test shows me getting speeds in the 500Mbps range up/down on wired Ethernet) YouTube seems to be getting close to 10Mbps, usually in the 6000-8500kbps range though. \n* On the same setup, a 1080p video was streaming video in the 5000-6500kbps\n\n*Thats* why a bluray will [realistically] always look better than streaming. It's also why I don't really think 8k footage is going to take off, there's just not enough bandwidth built into our infrastructure for any real usage. Plus, at even the largest sizes you can really buy, you can't actually discern the difference between 8k and 4k.",
                          "score": 10,
                          "created_utc": 1734373246.0,
                          "replies": [
                            {
                              "id": "m2higow",
                              "author": "diacewrb",
                              "body": "> It's also why I don't really think 8k footage is going to take off, there's just not enough bandwidth built into our infrastructure for any real usage. \n\nPlus disc sales have been falling for years.\n\nBest Buy and Target stopped selling discs.\n\nLG recently got out of the 4k blu-ray player market.\n\nSony and Microsoft would probably love nothing more than to make their next consoles disc-less to kill off the used games market for good.",
                              "score": 2,
                              "created_utc": 1734439477.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m2otn7q",
                      "author": "BoJackPoliceman",
                      "body": "This is why I stream blu-ray rips on the high seas. Such a game changer.",
                      "score": 1,
                      "created_utc": 1734543750.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2cwrjq",
                  "author": "jack3moto",
                  "body": "You haven’t tried a UHD blu ray on a quality OLED tv. It is night and day difference from 1080p.",
                  "score": 6,
                  "created_utc": 1734370405.0,
                  "replies": []
                },
                {
                  "id": "m2d8484",
                  "author": "OvSec2901",
                  "body": "Depends on the TV size and viewing distance. But the more noticeable difference is HDR and Dolby Vision. Anyone would 100% notice that, those look much better than whatever 1080p has.",
                  "score": 2,
                  "created_utc": 1734373945.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2dc9q8",
          "author": "BluePeriod_",
          "body": "I think we all hit that point at some point in our lives. I feel like resolution wise, I’m really good with 4K. I’m more interested in getting perfect colors. Perfect contrast. A perfect picture.\n\nMy mother, God rest her, would still watch DVDs or sometimes a local broadcast in standard definition. I remember asking her a “how can you possibly watch this? It’s so low resolution“ and she was like “growing up, I never even had a color TV. When TV went to color that was a huge deal. Then   DVD came out and it looked nicer than cassette, hat was a big deal. But outside of that, it’s pretty hard to impress me when you go from black-and-white to color“.",
          "score": 8,
          "created_utc": 1734375230.0,
          "replies": [
            {
              "id": "m2hcf4g",
              "author": "bell37",
              "body": "Just give me good content (shows and movies with compelling characters and well written stories)",
              "score": 2,
              "created_utc": 1734436410.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2gjlj4",
          "author": "Fabulous-Stretch-605",
          "body": "Some of the old games I still play only support 720 and they still look amazing on a 50” screen. Can’t even tell the difference between that and 4K unless I’m standing 6 inches from the screen . Which I never am.",
          "score": 2,
          "created_utc": 1734417781.0,
          "replies": []
        },
        {
          "id": "m2mbxrf",
          "author": "imakesawdust",
          "body": "I mean, my seating position is 13 feet from my 75\" TV.  At that size/distance, I'm not convinced I can really tell the difference between 4K and 1080p.  I'm sure I won't be able to tell 8k from 4k at that distance.",
          "score": 2,
          "created_utc": 1734501760.0,
          "replies": []
        },
        {
          "id": "m2ccpw0",
          "author": "None",
          "body": "OLED with acoustic transparency will be the end game for me.",
          "score": 2,
          "created_utc": 1734363988.0,
          "replies": []
        },
        {
          "id": "m2dvw4p",
          "author": "youpeoplesucc",
          "body": "That's great, but new technologies aren't marketed for people who want to settle for just fine.",
          "score": 1,
          "created_utc": 1734381317.0,
          "replies": [
            {
              "id": "m2dwfw6",
              "author": "edu5150",
              "body": "![gif](giphy|CggoHW4h87Ktq|downsized)\n\n🤠",
              "score": 5,
              "created_utc": 1734381492.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2egyp3",
          "author": "pingle1",
          "body": "Plus this is a Samsung. Will never buy any Samsung product again.",
          "score": 1,
          "created_utc": 1734388016.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2cy59c",
      "author": "My_Boy_Clive",
      "body": "And it cost $120k plus you sign a contract to let Samsung harvest and sell your organs when you die  plus you sign a consent  for the devil to take your soul.",
      "score": 15,
      "created_utc": 1734370842.0,
      "replies": [
        {
          "id": "m2hl959",
          "author": "MsAzizaGoatinsky",
          "body": "Jokes on them, Apple got dibs on my soul",
          "score": 2,
          "created_utc": 1734440733.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2j1ymd",
      "author": "Unabashed_American",
      "body": "So your telling me this one I [bought on Amazon](https://www.amazon.com/Projector-Bluetooth-25000lux-Portable-Compatible/dp/B0DDTG5D7K?crid=2R03XJQJLJ1IB&dib=eyJ2IjoiMSJ9.iDe0UpsmtZRGMGAg7XUN4apUmLllZdnWGfwuhC-IS2Cmf16bt7OQpM58iQrzRrRUnBQbCSpHtdmAPsXfnc5ODJ58_GKtHRaAOuMCzN2w7MZpx_I6igbGIcdH4fO7W0UkVVcrfknXPnSdS8ojXnV3KCzE7gN-5fK_Ewff43NdC0ffzZVAVVmE2Vj9Bkss5i8VGfGaYKATQxmVuPBDyLnoguaaIC9od7KIq7wuasmRCfA.vtbC-OXyjwQ2eUCMDQxLlU_MBwtEAUEWRLkagIQ3e40&dib_tag=se&keywords=8k%2Bprojector&qid=1734457802&sprefix=8k%2Bprojector%2Caps%2C201&sr=8-6&th=1&linkCode=ll1&tag=geartechtools-20&linkId=c50d3fbbf063295bfe5eb3293e8cbbe1&language=en_US&ref_=as_li_ss_tl) wasn't the first?\n\n  \n[https://www.amazon.com/Projector-Bluetooth-25000lux-Portable-Compatible/dp/B0DDTG5D7K?crid=2R03XJQJLJ1IB&dib=eyJ2IjoiMSJ9.iDe0UpsmtZRGMGAg7XUN4apUmLllZdnWGfwuhC-IS2Cmf16bt7OQpM58iQrzRrRUnBQbCSpHtdmAPsXfnc5ODJ58\\_GKtHRaAOuMCzN2w7MZpx\\_I6igbGIcdH4fO7W0UkVVcrfknXPnSdS8ojXnV3KCzE7gN-5fK\\_Ewff43NdC0ffzZVAVVmE2Vj9Bkss5i8VGfGaYKATQxmVuPBDyLnoguaaIC9od7KIq7wuasmRCfA.vtbC-OXyjwQ2eUCMDQxLlU\\_MBwtEAUEWRLkagIQ3e40&dib\\_tag=se&keywords=8k%2Bprojector&qid=1734457802&sprefix=8k%2Bprojector%2Caps%2C201&sr=8-6&th=1&linkCode=ll1&tag=geartechtools-20&linkId=c50d3fbbf063295bfe5eb3293e8cbbe1&language=en\\_US&ref\\_=as\\_li\\_ss\\_tl](https://www.amazon.com/Projector-Bluetooth-25000lux-Portable-Compatible/dp/B0DDTG5D7K?crid=2R03XJQJLJ1IB&dib=eyJ2IjoiMSJ9.iDe0UpsmtZRGMGAg7XUN4apUmLllZdnWGfwuhC-IS2Cmf16bt7OQpM58iQrzRrRUnBQbCSpHtdmAPsXfnc5ODJ58_GKtHRaAOuMCzN2w7MZpx_I6igbGIcdH4fO7W0UkVVcrfknXPnSdS8ojXnV3KCzE7gN-5fK_Ewff43NdC0ffzZVAVVmE2Vj9Bkss5i8VGfGaYKATQxmVuPBDyLnoguaaIC9od7KIq7wuasmRCfA.vtbC-OXyjwQ2eUCMDQxLlU_MBwtEAUEWRLkagIQ3e40&dib_tag=se&keywords=8k%2Bprojector&qid=1734457802&sprefix=8k%2Bprojector%2Caps%2C201&sr=8-6&th=1&linkCode=ll1&tag=geartechtools-20&linkId=c50d3fbbf063295bfe5eb3293e8cbbe1&language=en_US&ref_=as_li_ss_tl)",
      "score": 5,
      "created_utc": 1734458968.0,
      "replies": []
    },
    {
      "id": "m2c18l4",
      "author": "Shadow647",
      "body": "No Dolby Vision as usual from Samesung, right?",
      "score": 15,
      "created_utc": 1734359983.0,
      "replies": [
        {
          "id": "m2cf23w",
          "author": "CurvySexretLady",
          "body": "Yeah only LG and Sony seem to have it.",
          "score": 8,
          "created_utc": 1734364756.0,
          "replies": [
            {
              "id": "m2e45z0",
              "author": "SuperZapp",
              "body": "A lot more have it such as Hisense, TCL and Panasonic to name a few of the bigger ones. Was one of the reasons why I didn’t get a Samsung when I recently upgraded.",
              "score": 7,
              "created_utc": 1734383903.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2hjuah",
          "author": "AbhishMuk",
          "body": "Ootl, what does that help with?",
          "score": 1,
          "created_utc": 1734440102.0,
          "replies": [
            {
              "id": "m2hvasb",
              "author": "Shadow647",
              "body": "Better quality HDR, especially with Dolby Vision IQ support also present",
              "score": 1,
              "created_utc": 1734444826.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2dunlu",
      "author": "sioux612",
      "body": "The hardware might be fine, but samsung software on a tv/projector? No thanks\n\n\nMade that mistake once and won't repeat that",
      "score": 6,
      "created_utc": 1734380929.0,
      "replies": []
    },
    {
      "id": "m2d8yi7",
      "author": "THE_TamaDrummer",
      "body": "Can't wait to see what r/projectors thinks of this. Oh wait it's not BenQ so it doesn't matter as anything else is junk and you get downvoted for asking about other brands.",
      "score": 7,
      "created_utc": 1734374206.0,
      "replies": [
        {
          "id": "m2jxac3",
          "author": "Presently_Absent",
          "body": "Tell us you have a chip on your shoulder without telling us you have a chip on your shoulder...",
          "score": 4,
          "created_utc": 1734468868.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2exqa5",
      "author": "NahCuhFkThat",
      "body": "true 8K or pixel-shift 8K?",
      "score": 3,
      "created_utc": 1734393884.0,
      "replies": []
    },
    {
      "id": "m2g0z7x",
      "author": "PocketNicks",
      "body": "How does a TV become a projector?",
      "score": 2,
      "created_utc": 1734408505.0,
      "replies": [
        {
          "id": "m2gbrw2",
          "author": "MellowTones",
          "body": "Out-of-Body experience.",
          "score": 2,
          "created_utc": 1734413501.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2dgd4j",
      "author": "itsbeenalong20years",
      "body": "How is a TV a projector? Shouldn't it be one or the other? Which is it, a TV or a projector?",
      "score": 5,
      "created_utc": 1734376491.0,
      "replies": [
        {
          "id": "m2e0hst",
          "author": "Even_Reception8876",
          "body": "Because ‘LASERS’? Did you even read the title? /s",
          "score": 4,
          "created_utc": 1734382751.0,
          "replies": []
        },
        {
          "id": "m2e9d92",
          "author": "xCrossfirez",
          "body": "Laser TV means an ALS projector screen is included which means you can use the projector when the room isnt dark and you'll still be able to see it",
          "score": 3,
          "created_utc": 1734385549.0,
          "replies": [
            {
              "id": "m2fbr4z",
              "author": "Rdubya44",
              "body": "My buddy has one, looks great at night but not during the day",
              "score": 1,
              "created_utc": 1734398946.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2cbepa",
      "author": "mndsm79",
      "body": "Can I even SEE in 8k? at what point are we outrunning human capabilities?",
      "score": 3,
      "created_utc": 1734363552.0,
      "replies": [
        {
          "id": "m2cllop",
          "author": "Gimpknee",
          "body": "If you're asking if a person can tell the difference between 8k, 4k, or 1080, the answer is yes, but it depends on the size of the screen and the viewer's distance from it. Given a normal viewing distance for a television or projector size that would be normal or reasonable for an average room, a viewer is unlikely to notice a difference.",
          "score": 16,
          "created_utc": 1734366871.0,
          "replies": []
        },
        {
          "id": "m2d8iup",
          "author": "OvSec2901",
          "body": "Projectors make sense for 8k because they can shoot a massive screen of 100-200 inches. 8k on a 65 inch TV is pretty pointless at any reasonable viewing distance.",
          "score": 9,
          "created_utc": 1734374070.0,
          "replies": [
            {
              "id": "m2duasq",
              "author": "mndsm79",
              "body": "That makes a lot more sense.",
              "score": 4,
              "created_utc": 1734380817.0,
              "replies": []
            },
            {
              "id": "m2e1gpn",
              "author": "joelluber",
              "body": "Yeah, but you also sit farther away from a huge screen. The angular amount of your vision that a single pixel takes remains about the same",
              "score": 1,
              "created_utc": 1734383054.0,
              "replies": [
                {
                  "id": "m2e4961",
                  "author": "OvSec2901",
                  "body": "You'd think so, but I've been in several big home theaters and people do not have the big ass projector screen in the same relative view size as you'd normally have with a 65 or so inch TV. I guess they just like for the screen to feel massive.",
                  "score": 4,
                  "created_utc": 1734383931.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2cgqc7",
          "author": "Persellianare",
          "body": "The human eye can see up to 576 megapixels, 8k is roughtly 35megapixels and 16k is 133megapixels. The perceived difference from 4k-16k is almost negligible though.",
          "score": 7,
          "created_utc": 1734365301.0,
          "replies": [
            {
              "id": "m2gwz6u",
              "author": "Eurynom0s",
              "body": "Depends on screen size. 8k won't matter on a 40\" TV but it'll matter on an 80\" TV.",
              "score": 1,
              "created_utc": 1734426434.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2di4uh",
          "author": "daVinci0293",
          "body": "A really interesting cursory glance down that rabbit hole gives me the following:\n\nIf we equated the density of photoreceptors in our eyes to a modern digital camera sensor it would have a resolution of about 576 megapixels.\n\nHowever, our visual processing is way more complicated than a digital camera. Our eyes do not have a frame rate per se, they are constantly picking up huge quantities of dynamic information. Between our central vision (the area with the most acuity and detail) and the amount of processing our brain does to produce a cohesive experience, the estimate is closer to 7 - 15 megapixels.\n\n4k is 8 Mp and 8k is 33 Mp, and given that our eyes *effective* resolution is much higher than that, it's reasonable to say we haven't quite reached that limit yet.\n\nAnd as a previous poster mentioned, the ability to perceive the difference has many factors...\n\nI'd say between the nuance that is the human visual experience and the vagueness that is the \"4k and 8k\" standards (how big is a \"pixel\") it's reasonable to assume that we can tell the difference... And it will be a while before we fully stop being able to tell the difference (but will the cost of price and complexity continue to be worth it?)",
          "score": 2,
          "created_utc": 1734377035.0,
          "replies": []
        },
        {
          "id": "m2dnvi4",
          "author": "IIIIlllIIIIIlllII",
          "body": "Oldie but a goody\n\nhttps://www.avsforum.com/threads/viewing-distance-chart-720p-vs-1080p-vs-4k-vs-8k-and-beyond.1416475/",
          "score": 1,
          "created_utc": 1734378800.0,
          "replies": []
        },
        {
          "id": "m2dqr8d",
          "author": "Trawling_",
          "body": "Didn’t you get the memo in 2024? Humans are out, but computers and AI are bullish!\n\nWe gotta start producing the products that will appeal to our robot overlords who can see well above 8k! /s",
          "score": 1,
          "created_utc": 1734379699.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2d95kz",
      "author": "ElectronRotoscope",
      "body": "I gotta say, having never heard of \"the 8K Association\" I'm not brimming with confidence in their certification being meaningful if it includes \"Immersive Audio, that utilizes the latest multi-channel & Next Generation\", which like I'm sure that's great, but it's not normally something I consider essential to something being truly a specific resolution",
      "score": 1,
      "created_utc": 1734374266.0,
      "replies": []
    },
    {
      "id": "m2m8ub4",
      "author": "laserdicks",
      "body": "Dynamic range of 3 db",
      "score": 1,
      "created_utc": 1734500106.0,
      "replies": []
    },
    {
      "id": "m2c68is",
      "author": "JoshS1",
      "body": "That's cool, but annoyed it has to use wireless one connect vs just having a wired/fiber umbilical like previous one connect.",
      "score": 1,
      "created_utc": 1734361779.0,
      "replies": []
    },
    {
      "id": "m2d0ee2",
      "author": "Fredasa",
      "body": "Laser projection has all the downsides of single-chip DLP so I'll probably never be sold on the tech.  But I do get that 90% of folks never notice rainbow artifacts and most of the rest have to be told that the distracting effect is an unintended byproduct of an imperfect display tech.",
      "score": 1,
      "created_utc": 1734371545.0,
      "replies": [
        {
          "id": "m2d4qr1",
          "author": "cyberentomology",
          "body": "Only if the imaging engine is also a single-chip DLP, which is unlikely since laser projectors don’t require a color wheel.",
          "score": 1,
          "created_utc": 1734372892.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2dttf0",
      "author": "bamboob",
      "body": "The funniest thing to me is that people will complain about image quality not being as good on older television sets, yet they will leave the motion smoothing setting that the television comes with turned on, which completely makes the video look like absolute dog shit, and they don't even notice.",
      "score": 1,
      "created_utc": 1734380666.0,
      "replies": []
    },
    {
      "id": "m2g2wgh",
      "author": "Burpreallyloud",
      "body": "It’s already been proven that the human eyes I can’t see in 8K so something like this is pointless",
      "score": 0,
      "created_utc": 1734409320.0,
      "replies": [
        {
          "id": "m2gcb8p",
          "author": "MellowTones",
          "body": "People said the same thing going from FHD to 4k.  And it’s sometimes true - for moving low-contrast or fuzzy parts of a video.  Use it as a computer monitor, or watch the promo videos of starry skies or sandy beaches and it’s bloody obvious that 8k beats 4k even at 75” screens from around 1.5m away.  This projector does 4 times that diagonal - if you’re watching from 3-4 metres away I’d bet you’d see it.  And anyway - the question’s not entirely whether we can see 8k, it’s whether we can see more than 4k - that’d start conveying some benefit.",
          "score": 1,
          "created_utc": 1734413774.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2c2kzk",
      "author": "None",
      "body": "[deleted]",
      "score": -7,
      "created_utc": 1734360476.0,
      "replies": [
        {
          "id": "m2hlff6",
          "author": "DobleG42",
          "body": "You are correct idk why the downvotes",
          "score": 2,
          "created_utc": 1734440810.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2dx4th",
      "author": "internetlad",
      "body": "Price?",
      "score": 0,
      "created_utc": 1734381708.0,
      "replies": []
    }
  ]
}