{
  "post": {
    "title": "Apple will reportedly release as many as 7 headsets and glasses between now and 2028",
    "author": "DarthBuzzard",
    "id": "1lo6drf",
    "score": 0,
    "created_utc": 1751286909.0,
    "selftext": "",
    "num_comments": 22,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lo6drf/apple_will_reportedly_release_as_many_as_7/"
  },
  "comments": [
    {
      "id": "n0kg2db",
      "author": "ChaZcaTriX",
      "body": "That is a tiny production run, but it matches the market demand",
      "score": 40,
      "created_utc": 1751287149.0,
      "replies": []
    },
    {
      "id": "n0kfx9c",
      "author": "A_Balrog_Is_Come",
      "body": "So what you’re saying is I should hold off on buying any until the 7th is out.",
      "score": 8,
      "created_utc": 1751287094.0,
      "replies": [
        {
          "id": "n0l4y07",
          "author": "GoodGuyDrew",
          "body": "https://m.youtube.com/watch?v=WRHIz97L2iI",
          "score": 3,
          "created_utc": 1751295293.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0khqzy",
      "author": "Medical_Solid",
      "body": "Market: We just want an iPhone with better battery life. \n\n\nApple: Best we can do is 7 headsets and glasses between now and 2028. Oh, and here’s a thinner iPhone with less battery life.",
      "score": 3,
      "created_utc": 1751287783.0,
      "replies": [
        {
          "id": "n0krhaq",
          "author": "kinisonkhan",
          "body": "And when 5,000-6,000 mAh solid state batteries start showing up for smart phones, Apple will shrink the battery 3,500 to make the phone thinner.",
          "score": 3,
          "created_utc": 1751291168.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0kpcvu",
      "author": "PitchforkSquints",
      "body": "I really don't see the point. Glasses, maybe. The current crop of AR glasses still look like they came out of a halloween nerd costume, but they're kind of getting there.\n\nMore VR strap-on goggles though? People are done with these, and they barely ever started being into them. The videos of weirdos on the subway doing cringe minority report hand motions in their vision pros was the nail in the coffin. It was a cool gimmick 8 years ago, but the novelty of beat saber and stereoscopic porn only lasts so long. I'm sure VRchat still has a small but dedicated (and probably very.. crusty) community of NEETs, but it's all too cumbersome and finicky for average people. We still don't even have reliable inside-out body tracking.\n\nAt this point, I don't see anything short of a science-fiction \"full dive\" technology exciting people about VR again. AR smart glasses have much more promise, assuming miniaturization of the tech continues to where they don't look so goofy.",
      "score": 6,
      "created_utc": 1751290464.0,
      "replies": [
        {
          "id": "n0ky35t",
          "author": "DarthBuzzard",
          "body": "> At this point, I don't see anything short of a science-fiction \"full dive\" technology exciting people about VR again.\n\nI'd disagree. VR has many massive breakthrough advancements left. A high resolution slim visor or curved sunglasses device without side effects that offers photorealistic social telepresence will feel radically different to the VR of today, and it would be in a convenient package that people could wear for hours on end without discomfort.\n\n> It was a cool gimmick 8 years ago\n\n8 years is a small amount of time in the hardware industry. The novelty of hyperrealistic VR HMDs basically won't wear off because it will be too realistic for that to occur.",
          "score": 3,
          "created_utc": 1751293239.0,
          "replies": [
            {
              "id": "n0ldr2c",
              "author": "PitchforkSquints",
              "body": ">The novelty of hyperrealistic VR HMDs basically won't wear off because it will be too realistic for that to occur.\n\nWhat you're describing would be a long ways off based on our current tech and understanding of thermodynamics. Even then, more realistic visuals can't fix the inherent issues that come with having a screen strapped to your face: freedom of movement, proprioception, motion sickness, eye strain, etc. \n\nOn that kind of time scale, my money is on brain-computer interface development where we ditch external optics entirely. We already have paralyzed people controlling video games with a brain implant, so we're on the road.",
              "score": 3,
              "created_utc": 1751297864.0,
              "replies": [
                {
                  "id": "n0lf60g",
                  "author": "DarthBuzzard",
                  "body": "Having an all-day battery life in a near glasses form factor is the hard part that we don't really know how to deal with right now.\n\nHowever, simply getting a small form factor with photorealistic visuals is not only something we have line of sight to, but it's not even far off. Apple Vision Pro is almost there with photorealistic avatars, and the full-body versions seem very attainable over the next 10 years. Quest 3 has some cloud rendered gaussian splat environments. They are completely photorealistic. Just the other week, some major advances in [volumetric video](https://www.youtube.com/watch?v=RMKQbaorwWg) were made. Meta are planning to launch a Vision Pro-type device next year at a cheaper price with 1/5th the weight of a Quest 3, said to look like oversized glasses rather than a headset.\n\nEye strain is solvable in the somewhat near term with variable focus optics. Combined with latency improvements and dynamic distortion correction, nausea will completely disappear from VR usage other than when you have the movement disconnect. \n\nMovement isn't really possible to solve in a perfect way without a brain interface or at least without something like galvanic vestibular stimulation, I'll give you that, but it's not really needed for VR to be valuable.\n\n> On that kind of time scale, my money is on brain-computer interface development where we ditch external optics entirely. We already have paralyzed people controlling video games with a brain implant, so we're on the road.\n\nWriting to the brain is a totally different ball-game. In order for a brain interface to take over the role of VR HMDs, it needs to be capable of safely writing photorealistic multisensory data into the brain, generalized across the population. That's so far off, certainly multiple decades at least.",
                  "score": 1,
                  "created_utc": 1751298278.0,
                  "replies": [
                    {
                      "id": "n0lociu",
                      "author": "PitchforkSquints",
                      "body": "That video is really cool. \n\n>Combined with latency improvements and dynamic distortion correction, nausea will completely disappear from VR usage other than when you have the movement disconnect.\n\nIsn't the movement part pretty critical though? I'm sure very few people get motion sick in VR when their POV is static, but how much useful content is that way? Latency might help, but it's that sensory disconnect (moving visually yet standing still) that brings on the nausea. Most people I know get immediately dizzy when I let them try any game that uses smooth rotation instead of snap turn POV. Hell, I still get kinda dizzy! \n\nWhile I do agree with your points about a brain-computer interface being way far off, I still think AR is closer to mass adoption in a few years than VR ever will be, at least for individual consumers. While the HMD tech does appear to be improving, a bunch of those currently intractable factors need to align. A light, portable, unobtrusive yet immersive realistic display that has a battery life of more than an hour or two.. for a price that normal people are willing to pay. Hopefully I eat my words in a few years when we get a breakthrough in wireless energy transmission or solid state battery tech.",
                      "score": 2,
                      "created_utc": 1751300921.0,
                      "replies": [
                        {
                          "id": "n0lzndp",
                          "author": "DarthBuzzard",
                          "body": "> but how much useful content is that way? \n\nThe majority of VR's usecases and content won't really care much about moving realistically throughout a world. It would always be better if you could do it, but the lack of it doesn't mean it can't be a valuable medium for the masses.\n\nYou never want to move around if you're using VR as a computing or  stationary media consumption device. You don't need to move around much in a sports stadium, concert, or comedy club. All the social usecases of VR would show serious value even if teleportation is used, because you're still getting the feeling of being face to face with your friends.\n\nIt's mostly gaming that cares about moving fast throughout virtual worlds. Gaming will be a major part of VR, but I don't think it will be the main attraction.\n\n> I still think AR is closer to mass adoption in a few years than VR ever will be, at least for individual consumers.\n\nHow though? See-through AR glasses involve a substantially harder set of engineering problems. Take a look at Meta's $20K-30K (estimated production cost) Orion AR glasses prototype. A technical marvel no doubt, but let's compare them to a $300 VR headset:\n\n40% less field of view, somewhere around 720x540 per eye (versus roughly 2Kx2K per eye for a $300 VR headset), worse tracking quality, 10x less processing power, not bright enough to work outside, and virtual objects cannot be opaque.\n\nThe way I like to look at this is: VR will be the cheap, high quality, stationary device for the home - like a PC. AR will be the expensive, low quality, mobile device for the outdoors - like a high-end smartphone.\n\nThe hurdles for AR glasses are so high that it will take many years before the market can shift high tens of millions of units. Even if we ignore all the quality concerns, just getting the glasses into mass production and getting people to spend $1000-1500 on them will take quite a while.",
                          "score": 1,
                          "created_utc": 1751304094.0,
                          "replies": [
                            {
                              "id": "n0qw387",
                              "author": "PitchforkSquints",
                              "body": "You make a lot of good points as far as entertainment and media consumption go. For sure, AR has difficult problems to solve (as does VR), but I don't think it has to be even 50% as good on performance as VR to see huge proliferation. \n\nThe thing is, I think we've been talking about slightly different things. I'm not concerned about which tech is more promising for visual fidelity or performance, but which one consumers will actually be motivated to purchase. I don't think consumption of multimedia is even a factor in considering AR to be the winner here. \n\nYou say VR will be a cheap stationary device for the home (like a PC), but how many people even have a stationary home PC today? It would have to be seriously cheap and much more compelling than it is now to supplant the TV, which already sits on that throne. Smartphones though, everyone has. How you make the smartphone better is by making it invisible. That's why wearables like smartwatches have proliferated. \n\nSee my post to another commenter for my whole take on where I think AR is going [here](https://www.reddit.com/r/gadgets/comments/1lo6drf/comment/n0qt1vz/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) if you care. Even if the quality is crappy compared to VR, all they have to do is miniaturize. The bottleneck will absolutely be battery technology, but make them nigh indistinguishable from regular glasses and that's a wrap for civilization.",
                              "score": 3,
                              "created_utc": 1751372552.0,
                              "replies": [
                                {
                                  "id": "n0r6qdj",
                                  "author": "DarthBuzzard",
                                  "body": "While it's true that home computers have declined a lot since their heyday, they are still a mass market industry, serving hundreds of millions of users. I think VR can fit into that category and also that of tablets and laptops too, since you could take it to other stationary locations like a hotel or coffee shop.\n\nAR I expect will have multiple billions of users, so yeah it will be more popular, but that's also going to take a very long time to occur.  Remember that manufacturing general purpose AR glasses is going to be a tall order, and they will be very expensive for years. So I don't see how it's possible for AR to leapfrog the VR market and be the first to mass adoption.\n\nWhat I see happening is VR/MR gets there first, and settles into a hundreds of millions level market. Then AR gets to that point too, and eventually it goes well beyond that into multi billions.\n\n>  I really don't think VR headsets will become a household item in 20-30 years like the TV is now.\n\nI can imagine VR at that time going beyond a billion users, maybe not multi billions, but north of a billion, and I think it's because the allure will just be so great at that point. 20-30 years from now, we're talking about technology well beyond even Ready Player One. Every second in VR would feel utterly hyperrealistic, making it something real close to an experience machine.",
                                  "score": 0,
                                  "created_utc": 1751376336.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0mc229",
                  "author": "Sirisian",
                  "body": "> What you're describing would be a long ways off based on our current tech and understanding of thermodynamics. Even then, more realistic visuals can't fix the inherent issues that come with having a screen strapped to your face: freedom of movement, proprioception, motion sickness, eye strain, etc. \n\nCurrent timelines are 2040s. Apple was about to change that timeline by building their own MicroLED production, but they backed out a year ago. Dual 16K@240Hz with event camera eye tracking should have no motion sickness.\n\nI've mentioned before, but Apple and Meta are largely brand building for these future glasses. Creating dev-kits and building the OS and ecosystem to capture the transition. All the big companies are keeping pace at the moment until the hardware is ready. (There are other missing pieces including the computing, so it's not like any company can really get that far ahead right now).",
                  "score": 1,
                  "created_utc": 1751307519.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0mwbq2",
          "author": "Shapes_in_Clouds",
          "body": "AR glasses and VR headsets are ultimately almost identical technologies at their core - the biggest difference being the optical/display stack.  And this is such a massive obstacle and limiting factor for AR glasses.  The Orion demo Meta showed off as their aspirational 'in ten years' consumer product was not something I think the vast majority of people will spend $$$$ on.  It does things smartphones already do today but worse.  Why would anyone choose to watch a low res, transparent video with poor color saturation on their glasses, over the rich, high res images of OLEDs on their smartphone?\n\nThe VR headset form factor at least also offers compelling immersive experiences that aren't possible on any other device, and there is a reasonably attainable path to miniaturizing the hardware enough to make it comfortable and also achieve the high levels of display fidelity people are used to.\n\nTo me, the VR headset form factor we see in the Apple Vision/Meta Quest has the best chance of success.  Both passthrough AR and fully immersive VR capable.  Get it down to size comparable to Big Screen Beyond, under 200 grams, offload compute and battery, with optional 'black out' gaskets similar to what the Quest Pro had.  Not something people will wear all the time, but a reasonably useful device for home use and portability.\n\nThat all said, I do agree in general that this entire product category is fighting an uphill battle to capture market share in a world where people are approaching device/content fatigue.  It's arguable whether AR/VR is truly needed or desired.  The right feature mix, use cases, and price point will continue to be elusive.",
          "score": 1,
          "created_utc": 1751313440.0,
          "replies": [
            {
              "id": "n0qt1vz",
              "author": "PitchforkSquints",
              "body": ">Why would anyone choose to watch a low res, transparent video with poor color saturation on their glasses, over the rich, high res images of OLEDs on their smartphone?\n\nI think the actual potential of AR goes way beyond just consuming multimedia. If they're eventually able to shrink AR glasses frames to where they just look like (sun)glasses, I imagine they'd be at least as prolific as smartwatches are now. It would be a lifestyle product, a tool. \n\nIgnoring the black mirror surveillance state consequences, you'd have a high definition camera capable of recording photo/video attached to your natural POV. You don't have to think about pointing it at your subject, you just look. That alone would be huge to reduce the \"wall of phones\" effect you see at shows and public spectacles. \n\nYou could overlay google maps on your vision while navigating a new city which could highlight POI or a planned route like you have a video game nav marker.\n\nYou could use an AI assistant to catalog and remember people you've met, including names and pertinent information including social media profiles. Facial recognition and analysis to give you information on their potential mood, disposition towards you, detect lying/deception/contradictions, reading social cues for those who might need it. Record conversations and transcribe into notes. Nobody forgets anything anymore if they don't want to. \n\nHaving something like google lens constantly available to give you information on literally any object you're looking at. Plants, animals, instant price comparisons while shopping, calorie readouts for food, translating text or audio..\n\nImagine the applications for ballistics, and not just guns, but stuff like sports. You could get live shot tracing or predictions for ball flight, bounce trajectory, wind speed visualization.. You would have to ban them at billiards halls for sure. \n\nI can think of a million more. A lot of this is stuff is technology available today, but seamlessly integrating it into a package you could just have on your face \"seeing\" everything *without everyone knowing you're doing it* by having to point your phone at it would absolutely change the world.. and probably for the worse. Technology like this would be abused, be it by governments, corporations, or just regular people. Intentionally or unintentionally, it would probably make our social lives worse. People would absolutely come to rely on it like we do phones. If we think things are dystopian now, imagine when everyone has an always-on camera attached to their head walking around reading everyone's face and internet presence.  \n\nThat was a long way to say- I'm not concerned about which tech is more impressive, but more about which I believe the population at large has a higher chance of adopting. I really don't think VR headsets will become a household item in 20-30 years like the TV is now. The TV is still undefeated for nearly 100 years, and that's because you don't have to buy one for each person who wants to view it. No matter how light or thin an HMD gets, it's still a strange looking thing on your face, meaning it has little utility outside the home. Tons of people don't even have home computers anymore, why would they want TV goggles that only one person can watch and they wouldn't want to be seen wearing outside? \n\nI'm confident people would go crazy for something that looks more natural and discreet, even if it only does 75% of what the better tech does. That's why smartwatches aren't the size of pip-boys. You could definitely do a lot more with a giant wristband bracer thing, but nobody would buy that. It's doing too much. Instead you have smartwatches that.. more or less look like watches. They don't stick out, but they add (perceived) value. That's why I think AR is our eventual (awful) future if they can work out the form factor.",
              "score": 1,
              "created_utc": 1751371345.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0s6cz2",
          "author": "DonaldLucas",
          "body": "It'll be like the iPad: a cool gimmick at first, but only used by some people in the end.",
          "score": 1,
          "created_utc": 1751386776.0,
          "replies": []
        },
        {
          "id": "n0kw10s",
          "author": "OIlberger",
          "body": "I could see AR glasses being almost as big as smartphones; it’s just a smartphone UI superimposed over the real world, instead of tilting your head down to look at a device. And it’s hands-free. I think people will prefer that (not that I think it will make society any better).",
          "score": 1,
          "created_utc": 1751292598.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0q94m7",
      "author": "Alone_Job_9000",
      "body": "And I'll probably still be using my iPhone 7 in 2028.",
      "score": 1,
      "created_utc": 1751361334.0,
      "replies": []
    },
    {
      "id": "n0kg3jq",
      "author": "stahpstaring",
      "body": "Throw 7 pieces of shit at a wall and surely one will stick. Nice news.",
      "score": 1,
      "created_utc": 1751287161.0,
      "replies": []
    },
    {
      "id": "n0kgm9u",
      "author": "None",
      "body": "That explans the Liquid Ass design. They are making us getting used to transparent icons and controls in their VROS",
      "score": 1,
      "created_utc": 1751287357.0,
      "replies": []
    }
  ]
}