{
  "post": {
    "title": "Three-Way Split Screen Maybe Coming to Android 16",
    "author": "Sariel007",
    "id": "1i3gzxj",
    "score": 55,
    "created_utc": 1737122529.0,
    "selftext": "",
    "num_comments": 38,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i3gzxj/threeway_split_screen_maybe_coming_to_android_16/"
  },
  "comments": [
    {
      "id": "m7mn5ta",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1737122529.0,
      "replies": []
    },
    {
      "id": "m7mpgj2",
      "author": "w1n5t0nM1k3y",
      "body": "Am I just missing something or does the image only show a two app split screen?\n\nI wonder how this would be useful. Even with a folding device it would be hard to have 3 things on the screen at once. Maybe rotate the screen and you'd have a little more width per app, but it would still be very little space.\n\nWe already have support for \"windows\" for devices with even larger screens or when you hook up your device to a monitor, so I don't really see the use case for having a mode that's specifically 3 screens as opposed to just making a better window manager that makes it easier to organize any number of windows and have them snap to eachother or the edge of the screen.",
      "score": 29,
      "created_utc": 1737123326.0,
      "replies": [
        {
          "id": "m7n5z53",
          "author": "connor42",
          "body": "Huawei Mate XT is a tri-folding phone I can see the use case there\n\nDisplay panels are made by various different companies so those panels could be rolling out to other android phone manufacturers. There are very credible rumours Honor are coming out with a tri-fold (bit of a silly term when it actually only folds twice, z-fold makes more sense ime)",
          "score": 3,
          "created_utc": 1737128553.0,
          "replies": [
            {
              "id": "m7n7whr",
              "author": "w1n5t0nM1k3y",
              "body": "Such a small percentage of the market though. WOuldn't it just make more sense to spend time developing the \"windows\" feature, have apps with zero borders, snap together. The user can organize them how they want. Save different layouts so the user switch back and forth between their favourite layouts.  So many ways to make this more versatile rather than just working on a single fixed layout  that only works for a very small percentage of users.  The only place I've ever seen a folding phone was on YouTube in a tech review. I've never seen one in the wild. I'm sure some people have them, but they are extremely rare.",
              "score": 4,
              "created_utc": 1737129121.0,
              "replies": [
                {
                  "id": "m7nc42m",
                  "author": "connor42",
                  "body": "I think they could be and the manufacturers already do seem to see them as a growth market. Opens up an opportunity for an even higher priced flagship too. Only time will tell if that bares out. \n\nI’m pretty sure they sell better in Asian markets and they sell well to ‘business’ types / people who are willing to drop 2 grand on the latest not-totally proven tech, which are definitely the type of people phone manufacturers want as customers\n\nHardware drives software innovation as hardware is where the money is (in phones). Perhaps they feel 3 windows on a candy bar design is too visually crowded. Or that 3 apps would slow down all but the latest flagships. Or it’s just a more difficult task to make them truly dynamic with the way apps/OS are designed than it seems at first glance\n\nAnyway introduction of 3 apps is moving closer to your overall stated wish for a more dynamic system over what we have currently",
                  "score": 1,
                  "created_utc": 1737130346.0,
                  "replies": []
                },
                {
                  "id": "m7neqc6",
                  "author": "chloe-and-timmy",
                  "body": "I'd say a windows feature is inevitable. If Google is ditching Chrome OS and just going full on Android I suspect that will come with Android being more windows like for larger screens.",
                  "score": 1,
                  "created_utc": 1737131102.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7v4535",
          "author": "Practical-Custard-64",
          "body": "Samsung foldables already do this. The screen is split in 3 with one app on one side and two more sharing the other side by splitting the height of that half screen between them. You can actually have a fourth app in a floating window in front of the others in OneUI.",
          "score": 1,
          "created_utc": 1737233938.0,
          "replies": [
            {
              "id": "m7vnuco",
              "author": "w1n5t0nM1k3y",
              "body": "On Samsung you can just open whatever apps you want in floating mode. I just opened up 5 apps on my standard sized phone. I don't really think there's a limit. The problem is that it's hard to organized the \"windows\" in any meaningful way. This is why I said they should work on their window manager to allow you to more easily snap apps to the edges of the screen or up against eachother, rather than trying to create just a few pre-defined layouts that may or may not work for someone's specific use case.  Just give people the tools to organize and display the apps in a way that makes sense to them.",
              "score": 1,
              "created_utc": 1737240047.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7mt9x5",
      "author": "keno888",
      "body": "I think we may already have this in samsung devices.",
      "score": 6,
      "created_utc": 1737124611.0,
      "replies": [
        {
          "id": "m7mzlyz",
          "author": "banfern1111",
          "body": "Hope other android skins adopt this feature and the split screen shortcuts, too, so I can finally try other android devices.",
          "score": 1,
          "created_utc": 1737126625.0,
          "replies": []
        },
        {
          "id": "m7mzm68",
          "author": "ClaudiuT",
          "body": "We do in the Folds.",
          "score": 1,
          "created_utc": 1737126627.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7mr8yl",
      "author": "chloe-and-timmy",
      "body": "I have a fairly big screen on my (non folding) phone but I wonder what I could do with 3 way split screen. I do use it occasionally on my tablet but it's been niche (eg Youtube, Twitter and on-screen timer) and probably more niche on a phone. But as Im typing this I realise there has been a few times I've had a YouTube pop up window while also doing something between two other unrelated apps.",
      "score": 2,
      "created_utc": 1737123932.0,
      "replies": [
        {
          "id": "m7ptecw",
          "author": "Gaeus_",
          "body": "Bank on the left, amazon on the right, floating calculator?",
          "score": 2,
          "created_utc": 1737157014.0,
          "replies": [
            {
              "id": "m7pwpyh",
              "author": "chloe-and-timmy",
              "body": "That's very doable. A calculator is just a good \"third app\" in general I think. Im also hoping they can make the floating windows smaller, I'd have a tiny youtube app up while I'm just doing stuff on the phone, but the smallest size is still a hit too big for me to use it too often.",
              "score": 1,
              "created_utc": 1737158142.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7mvyue",
          "author": "CakeDayisaLie",
          "body": "You can scroll through Reddit on 3 accounts at once. ",
          "score": 1,
          "created_utc": 1737125485.0,
          "replies": [
            {
              "id": "m7myym8",
              "author": "SteeveJoobs",
              "body": "can you though? or does each instance share the same account?",
              "score": 2,
              "created_utc": 1737126422.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7n8fci",
      "author": "Atlonix",
      "body": "With the limited space I don't see any advantage, even the developers like to make their own apps with huge title bars, sidebars and more (reddit included). So, in my opinion, everyone should improve the UI instead.",
      "score": 2,
      "created_utc": 1737129273.0,
      "replies": []
    },
    {
      "id": "m7nihz2",
      "author": "W8kingNightmare",
      "body": "I just got the Pixel 9 Pro Fold over the holidays for $1200CDN ($350 upfront and $33/mth for 2yrs) and its annoying that I can only have 2 windows open side by side",
      "score": 2,
      "created_utc": 1737132174.0,
      "replies": []
    },
    {
      "id": "m7o9382",
      "author": "the_actual_word_fuck",
      "body": "If they set that android free, it will be the end of all of us!",
      "score": 2,
      "created_utc": 1737139799.0,
      "replies": []
    },
    {
      "id": "m7mu5y7",
      "author": "Danjou667",
      "body": "Crying in CSS as a fullstack developer.",
      "score": 3,
      "created_utc": 1737124902.0,
      "replies": []
    },
    {
      "id": "m7r5iof",
      "author": "dalekaup",
      "body": "In this case \"may be\" is two words.",
      "score": 2,
      "created_utc": 1737174995.0,
      "replies": []
    },
    {
      "id": "m7mxz48",
      "author": "Major_T_Pain",
      "body": "..... Whhhy?",
      "score": 1,
      "created_utc": 1737126116.0,
      "replies": []
    },
    {
      "id": "m7n53da",
      "author": "Right_Ostrich4015",
      "body": "Linux? Triple Split screen? I almost want a droid",
      "score": 1,
      "created_utc": 1737128289.0,
      "replies": [
        {
          "id": "m7o2gxd",
          "author": "_RADIANTSUN_",
          "body": "Android has about as much to do with Linux as MacOS does with FreeBSD. I.e. not much.",
          "score": 0,
          "created_utc": 1737137909.0,
          "replies": [
            {
              "id": "m7o5exe",
              "author": "Right_Ostrich4015",
              "body": "[Oh](https://www.reddit.com/r/linux/comments/1g3daye/android_16_will_include_a_terminal_and_full_linux/)",
              "score": 1,
              "created_utc": 1737138745.0,
              "replies": [
                {
                  "id": "m7o6gci",
                  "author": "_RADIANTSUN_",
                  "body": " Windows Subsystem For Linux (WSL) also exists.",
                  "score": 1,
                  "created_utc": 1737139044.0,
                  "replies": [
                    {
                      "id": "m7o6ruj",
                      "author": "Right_Ostrich4015",
                      "body": "While this is true, I’m disinterested in playing steam games on Linux on windows on my phone",
                      "score": 1,
                      "created_utc": 1737139134.0,
                      "replies": [
                        {
                          "id": "m7o8kbr",
                          "author": "_RADIANTSUN_",
                          "body": "What do you want a Linux terminal and VM on a phone for?",
                          "score": 1,
                          "created_utc": 1737139649.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7ng80s",
      "author": "Sevencross",
      "body": "Perfect for the 3 eyed dude on the bus",
      "score": 1,
      "created_utc": 1737131527.0,
      "replies": []
    },
    {
      "id": "m867pq8",
      "author": "AverageSizePeen800",
      "body": "In the mean time my piece of shit iPhone can’t even get two.",
      "score": 1,
      "created_utc": 1737386693.0,
      "replies": []
    },
    {
      "id": "m7mv68q",
      "author": "PetroMan43",
      "body": "I'm pretty sure my android phone can do 2 app split screens but I completely forgot how to do it.\n\nAndroid has so many cool-but-dumb features, like special actions when you long press an icon  on your home screen.  My guess is that so few of them are ever used",
      "score": 1,
      "created_utc": 1737125232.0,
      "replies": [
        {
          "id": "m7nnvbn",
          "author": "brosjd",
          "body": ">Android has so many cool-but-dumb features\n\nIt's like the accidental curly fry of consumer tech",
          "score": 2,
          "created_utc": 1737133716.0,
          "replies": []
        },
        {
          "id": "m7mypur",
          "author": "HarlequinSyndrom",
          "body": "For me its: app overview (don't know the English name, the screen that shows all open apps), long click on the app icon I want on top and then select the other one.\n\nCould be different for your device, tho",
          "score": 1,
          "created_utc": 1737126347.0,
          "replies": [
            {
              "id": "m7n1p3o",
              "author": "PetroMan43",
              "body": "Ah there it is!  Thanks.  I've now used that 3 times in my life",
              "score": 1,
              "created_utc": 1737127262.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7nxpmb",
      "author": "DropKnowledge69",
      "body": "Apple will \"invent\" this new folding screen in about 2-3 years.  People will rave about Apple's constant cutting edge innovation.  People will camp overnight at the Apple store to be the first to get the foldable iPhone.\n\nRinse.\n\nRepeat.\n\nSource:  foldable Android phone user for the last 3+ years",
      "score": -1,
      "created_utc": 1737136546.0,
      "replies": [
        {
          "id": "m7z4bpk",
          "author": "_sharpmars",
          "body": "I prefer Android to iOS as well, but what does this have to do with the topic of the post?",
          "score": 1,
          "created_utc": 1737292295.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7myxrg",
      "author": "CharlesDartagnan",
      "body": "Possibly unpopular opinion, but Android already has too many features. Hardly a day goes by when I don't accidentally  trigger one I didn't mean to use, don't need and can't disable.\nFuture developments should focus on increased usability, stability and security.",
      "score": -1,
      "created_utc": 1737126415.0,
      "replies": []
    },
    {
      "id": "m7n0yon",
      "author": "AldiQuarter",
      "body": "Tech features have become so lame lol",
      "score": 0,
      "created_utc": 1737127041.0,
      "replies": []
    }
  ]
}