{
  "post": {
    "title": "AMD promises mainstream 4K gaming on Radeon RX 9070 series in early March | Timed to compete directly with mid-range GeForce RTX 50 GPUs",
    "author": "chrisdh79",
    "id": "1iizw86",
    "score": 517,
    "created_utc": 1738839246.0,
    "selftext": "",
    "num_comments": 98,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1iizw86/amd_promises_mainstream_4k_gaming_on_radeon_rx/"
  },
  "comments": [
    {
      "id": "mba11nv",
      "author": "nerdthatlift",
      "body": "They would do really good if their launch won't be a paper launch and have cards available at said launch. I would switch to Team Red because I'm sick of Nvidia BS marketing and scarcity of products launch.",
      "score": 219,
      "created_utc": 1738843083.0,
      "replies": [
        {
          "id": "mbgd712",
          "author": "andrejlr",
          "body": "People constantly say that, but then somebody always byus this insane priced Nvidia GPUs and their price only knows one direction. Most used GPUs on steam are all below rtx 30xx . There is no need for this AI generated crap and also no need to give studios incentive to ship unomptimized games with shit ton of not needed shaders which increase GPU load and add nothing to graphics.\n\nSupply and Demand rule the market. Nerd gamers made PC platform unaffordable. I'll buy some last gen GPU on release of this gen and I fear this was my last build.\n\nIts not master race anymore, its FOMO race",
          "score": 20,
          "created_utc": 1738922179.0,
          "replies": [
            {
              "id": "mbmmihp",
              "author": "Accentu",
              "body": "I got my 6950 XT on sale, combined with a mobo/CPU/RAM combo. No regrets. It's not great at ray tracing, and certain applications (like those that require pytorch) don't work well with it, but overall, that's small potatoes for my use cases. I probably won't be upgrading anytime soon, given general world events, but I'm all for seeing more competition for Nvidia.",
              "score": 3,
              "created_utc": 1739002398.0,
              "replies": []
            },
            {
              "id": "mcffc45",
              "author": "dave55man",
              "body": "I mean, this recent NVIDIA debacle has already made me switch to Team Red.  The fact that nothing of the 50 series is available on top of the meager performance gains for the 5080 caused me to go and buy a 7900 XTX instead.\n\nI'm hopeful that AMD will continue to undercut NVIDIA and deliver great video cards to us, because now is their chance to start taking back market share.  They managed to come back with their CPU's, let's see if they can do the same with their GPU's.",
              "score": 2,
              "created_utc": 1739392102.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbam0t3",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1738851257.0,
          "replies": [
            {
              "id": "mbaouzd",
              "author": "nerdthatlift",
              "body": "Since when does the consumer ever matter from these corporations?\n\nI understand that very well. It's ejther you have the product or not. I don't care how much better Nvidia GPU than AMD if they don't have any product to sell then I'll go to the competition. I'll buy what's available before waiting for what is to be the best to become available.",
              "score": 7,
              "created_utc": 1738852186.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbmow17",
          "author": "onemightypersona",
          "body": "I went all AMD this time and honestly I'm considering selling the GPU.\n\nI know NVIDIA is not great. And I know my experience is limited and my sample size is one. But my Gigabyte 2060 never had any coil whine and never crashed. And my Sapphire Radeon RX 7900 XTX is crashing all the time and has insane coil whine. Crashes all the f-ing time on Windows, but not on Linux, so it's certainly a driver issue. So here we are.",
          "score": 2,
          "created_utc": 1739003791.0,
          "replies": [
            {
              "id": "mccavku",
              "author": "Numerlor",
              "body": "Check what clocks it'đ defaulting to, mine defaults to stupid high clocks on a low binned card",
              "score": 2,
              "created_utc": 1739353718.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbal2v7",
      "author": "SomewhatOptimal1",
      "body": "If fsr4 is as good as HUB and DF preview and it’s as fast as 4070TIS/4080 in RT. We got ourselves contender, nVIDIA bout to lose my business due how poor they treat their customers with intentional scarcity of their products.",
      "score": 66,
      "created_utc": 1738850944.0,
      "replies": [
        {
          "id": "mbe0331",
          "author": "MrCrunchies",
          "body": "It must be priced appropriately too. Aint nobody bat an eye if the price is 700+ usd.",
          "score": 15,
          "created_utc": 1738886120.0,
          "replies": [
            {
              "id": "mbg0dpn",
              "author": "RAF2018336",
              "body": "Eh. If it’s $700 but there’s 3x as much stock as the a vid is cards people will buy them up just to have the latest gen card.",
              "score": 6,
              "created_utc": 1738914275.0,
              "replies": [
                {
                  "id": "mbg7hlq",
                  "author": "MrCrunchies",
                  "body": "No man, and doesn't provide enough hardware and  software features to even be attractive at that price. It doesnt have cuda support, it doesnt have dlss, doesnt have all of that AI shenanigan. A 5070 is literally much better in everything despite lower raster performance. \n\n\nYou just cant beat marketing and public mindshare, fam.",
                  "score": -3,
                  "created_utc": 1738918592.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mb9v186",
      "author": "psykofreak87",
      "body": "7900xt/xtx are already great 4k gaming cards. This series is meant to show to investors they’re releasing something because nvidia did so. UDNA will be the real next gen imo.",
      "score": 89,
      "created_utc": 1738839933.0,
      "replies": [
        {
          "id": "mbax27g",
          "author": "LePouletMignon",
          "body": "I mean, don't people get tired of this argument? \"There was something wrong with RDNA 3 so RDNA 4 will be the REAL RDNA 3\". It's literally the same argument every single generation. It's kind of getting old at this point.",
          "score": 71,
          "created_utc": 1738854735.0,
          "replies": [
            {
              "id": "mbecj8g",
              "author": "EngineeringNo753",
              "body": "That's literally been the same argument forever.\n\nOh bulldozer is bad but the next gen will be a better bulldozer",
              "score": 6,
              "created_utc": 1738890168.0,
              "replies": []
            },
            {
              "id": "mbfklba",
              "author": "Confirmed_AM_EGINEER",
              "body": "What is wrong with RDNA 3? The 7900xtx is a great card and has tons of potential. \n\nA refresh model capable of running at 3,000 might stock like previous aftermarket cards could would kill right now if priced at $1,000.",
              "score": 3,
              "created_utc": 1738906090.0,
              "replies": []
            },
            {
              "id": "mbbfmn3",
              "author": "GrayDaysGoAway",
              "body": "Yep, fuck that noise. Anybody still expecting AMD to make a competitive GPU at any point in the foreseeable future is being very willfully naive. \n\nEven IF they can catch up on raw performance (and that's a huge if), their tech will still be years and years behind the curve.",
              "score": 9,
              "created_utc": 1738860001.0,
              "replies": [
                {
                  "id": "mbfeygh",
                  "author": "cat_prophecy",
                  "body": "People have forever been arguing that AMD cards will be good... eventually. The fact is that the only reason you'd buy one is because you can't/won't buy a Nvidia card. They aren't the performance leader even in their price brackets.  Like why buy an AMD card when you can buy a Nvidia card for slightly more money with better performance?",
                  "score": -7,
                  "created_utc": 1738903691.0,
                  "replies": [
                    {
                      "id": "mbfh0we",
                      "author": "Jra805",
                      "body": "I mean lately that isn’t really true though. Cost of 40 and 50 series cards are sky rocketing right now. I bought an AMD card because it was so much cheaper for basically the same as a 4070. ",
                      "score": 9,
                      "created_utc": 1738904547.0,
                      "replies": []
                    },
                    {
                      "id": "mbkz9kv",
                      "author": "ElJanitorFrank",
                      "body": "I just don't find this to be true. Last card I bought was a RX 7900 GRE which MSRPs at cheaper than a 4070 Super and exceeds it in performance across the board, pulling significantly ahead at higher resolutions.",
                      "score": 1,
                      "created_utc": 1738977158.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbb329p",
              "author": "psykofreak87",
              "body": "Je suis bien d’accord mon Poulet. I’ve watched a video saying RDNA3 had problems with the new GPU layout and drivers etc.. so perf wasn’t met as planned. Now RDNA4 is just a « RDNA 3.5? » and we should wait for UDNA.\n\nEither way my 6800xt does the job for me, I have rly good 1080p screens and I don’t plan to upgrade to 1440p yet, I tend to keep stuff for a long time.\n\nWhen I need to upgrade I’ll go with whichever is the best for me and for my wallet, blue, red or green.",
              "score": -3,
              "created_utc": 1738856482.0,
              "replies": []
            },
            {
              "id": "mbcg50z",
              "author": "Subduction_Zone",
              "body": "Well the argument is true, RDNA1/2 were made on the same process, and RDNA 3/4 are being made on the same process.  \nSomething was very clearly wrong with RDNA1, AMD ought to have been able to crush the 2080ti on TSMC 7nm easily, but the large die was cancelled.  They ended up making good GPUs on 7nm with RDNA2, but by then it was too late to compete against Turing.  \nSomething was also very clearly wrong with RDNA3, the 7800XT only matches the 6800XT despite having higher clocks and being made on a superior process, and the 7900XTX fell short of their initial performance claims.  Remains to be seen if RDNA4 will deliver a good GPU on TSMC 5nm.",
              "score": -3,
              "created_utc": 1738870046.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbcmpl2",
          "author": "jrsedwick",
          "body": "They’re also 1000 bucks. I think pricing is going to be paramount for these new cards.",
          "score": 8,
          "created_utc": 1738871867.0,
          "replies": []
        },
        {
          "id": "mbdzq4d",
          "author": "No_Camel7011",
          "body": "7800xt can actually hold its own on 4K",
          "score": 4,
          "created_utc": 1738886000.0,
          "replies": []
        },
        {
          "id": "mbc0zzr",
          "author": "Bluedot55",
          "body": "Eh, you can have a new lineup that has improvements even if it doesn't push the high end any higher. Like, the 4090 wasn't any faster then sli 3090s, at least in the 2 games or whatever that supported them, but it was still overall better. If they improve the price to performance, and have other things like improved rt and a better upscaler, then it's still solid. \n\nNot many people get the top tier cards of the generation. A generational improvement of the mid tier stuff is a solid leap for them.",
          "score": 1,
          "created_utc": 1738865901.0,
          "replies": []
        },
        {
          "id": "mbeevhq",
          "author": "cblake522",
          "body": "He’ll my 6900 is a great 4k card. Have had no issues with 60fps and can push to 120 easy with frame gen",
          "score": 1,
          "created_utc": 1738890945.0,
          "replies": []
        },
        {
          "id": "mb9x4ij",
          "author": "None",
          "body": "[deleted]",
          "score": -13,
          "created_utc": 1738841081.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbbot2f",
      "author": "Powerman293",
      "body": "The problem with this statement is game developers are hell bent on making games never run at native resolution ever again. Making a mainstream 4K card is literally impossible.",
      "score": 9,
      "created_utc": 1738862524.0,
      "replies": []
    },
    {
      "id": "mbbsblg",
      "author": "CMDR_omnicognate",
      "body": "really wish they didn't kill off their high end cards, there's no equivalent to the 5080/90 which sucks because they're both way too expensive and suck ass",
      "score": 7,
      "created_utc": 1738863496.0,
      "replies": []
    },
    {
      "id": "mb9w4ce",
      "author": "None",
      "body": "Trying to save that stock price",
      "score": 26,
      "created_utc": 1738840536.0,
      "replies": [
        {
          "id": "mbailbe",
          "author": "beleidigtewurst",
          "body": "Stock price is about AI. Neither of the two companies cares about GPU business much.\n\nIt isn't even 10% of the business, for both.",
          "score": 27,
          "created_utc": 1738850096.0,
          "replies": [
            {
              "id": "mbav6s9",
              "author": "randomIndividual21",
              "body": "I don't know why people keep saying this, any corp would bulldoze the amazon or take bread from orphan for 10% revenue increase",
              "score": 32,
              "created_utc": 1738854173.0,
              "replies": [
                {
                  "id": "mbawyuc",
                  "author": "_cuhree0h",
                  "body": "Well put.",
                  "score": 9,
                  "created_utc": 1738854707.0,
                  "replies": []
                },
                {
                  "id": "mbbs1oa",
                  "author": "sorrylilsis",
                  "body": "Because that 10% of the business is way less profitable than the AI/compute part.\n\nAnd developing it further cuts into the resources needed to develop and produce new AI/compute products. The thing is that those two lines are very much in competition with each other and this is a zero sum game.",
                  "score": 4,
                  "created_utc": 1738863421.0,
                  "replies": [
                    {
                      "id": "mbdd16m",
                      "author": "MetalstepTNG",
                      "body": "They made $2.6 billion for 2024 for their graphics card segment out of $25.8 billion in revenue. That's over 10% of their total revenue alone. They're not going to leave that much money on the table if they think they can chase that level of sales again when they made over $6 billion dollars from GPUs the year prior.",
                      "score": 3,
                      "created_utc": 1738879092.0,
                      "replies": [
                        {
                          "id": "mbfio78",
                          "author": "Derp00100",
                          "body": "I think the problem isnt the revenue, i think it's more so the actual profit they make themselves on these cards. Why make a 2000$ msrp gpu when you can just make a 10k/20k ai card and have way more profit.",
                          "score": 4,
                          "created_utc": 1738905252.0,
                          "replies": [
                            {
                              "id": "mbg7gjp",
                              "author": "sorrylilsis",
                              "body": "Yup simple as this. \n\nSo long as the production capacity is the bottleneck, GPU and accelerators are competing for silicon. And one of the two can be sold for more than the other. \n\nNot sure why so people don't seem to realise that supply of high end chips is very much limited right now.",
                              "score": 3,
                              "created_utc": 1738918574.0,
                              "replies": []
                            },
                            {
                              "id": "mbikojy",
                              "author": "MetalstepTNG",
                              "body": "Because demand isn't unlimited.\n\n\nIf it were that easy, they wouldn't be reselling binned chips or have a gaming segment at all.",
                              "score": 1,
                              "created_utc": 1738951079.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mbff8eg",
                          "author": "cat_prophecy",
                          "body": "It's barely over 10%. 10.4%",
                          "score": 1,
                          "created_utc": 1738903806.0,
                          "replies": [
                            {
                              "id": "mbil3z1",
                              "author": "MetalstepTNG",
                              "body": "That's a lot for a company with a $174 B dollar market cap. \n\n\nIf you're not an investor, you don't care. If you are and want an accurate valuation so you don't bag hold, then it's a different story.",
                              "score": 2,
                              "created_utc": 1738951200.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mbedzwf",
                      "author": "tonytrouble",
                      "body": "I don’t know, man it’s on a GPU.. Pretty much the thing that exists because of gaming.  I think the advantages that come with AI processing will funnel into GPU processing , in many different ways.  Not just fake frames.",
                      "score": 1,
                      "created_utc": 1738890653.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbavpc0",
                  "author": "beleidigtewurst",
                  "body": "Let's aggree to diagree here.\n\nE.g. Sun did not try to sue Google, it took Oracle to do it.\n\nNo tech company other than NV was caught strongarming journalists.\n\nAnd so on.",
                  "score": -2,
                  "created_utc": 1738854328.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbddvzy",
              "author": "MetalstepTNG",
              "body": "10% is potentially massive in finance terms.\n\n\nFor a multi-billion segment? Yeah, investors are going to want to see that on the balance sheet still.",
              "score": 1,
              "created_utc": 1738879329.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mb9uu5c",
      "author": "AnimeMeansArt",
      "body": "Sure, Im gonna believe it when I see it",
      "score": 15,
      "created_utc": 1738839822.0,
      "replies": []
    },
    {
      "id": "mbas8cx",
      "author": "Xero_id",
      "body": "Just say the price, competing with a 5070 at the price of a 5070 won't be good for their stock nor will it be competing. 5070 to performance for just under a 5060 price would be good but Nvidia priced their mid-range very well.",
      "score": 11,
      "created_utc": 1738853270.0,
      "replies": [
        {
          "id": "mbddc87",
          "author": "the_abortionat0r",
          "body": ">Just say the price, competing with a 5070 at the price of a 5070 won't be good for their stock nor will it be competing. 5070 to performance for just under a 5060 price would be good but Nvidia priced their mid-range very well.\n\nHow are people this delirious? Do you even hear your self?\n\n\"If its just like a 5070 it must be cheaper than one!\"\n\nHow does that argument make sense?",
          "score": -1,
          "created_utc": 1738879176.0,
          "replies": [
            {
              "id": "mbdeiqf",
              "author": "GrayDaysGoAway",
              "body": "Because raw performance isn't everything. Nvidia's software like DLSS makes their cards punch way above their weight. Buying an AMD GPU is settling for a notably inferior product and the price should reflect that.",
              "score": 15,
              "created_utc": 1738879510.0,
              "replies": []
            },
            {
              "id": "mbeb32k",
              "author": "tastyratz",
              "body": "You get a lot more with nvidia than raw fps. If you can only compete on the fps you need to price out the value of all the other things the card can do. Not having that dlss, RTX performance, ROCM support, etc. all has a value. There is a different way nvidia cards are well rounded with other full developed supported and used technologies you don't get with AMD. I love my AMD cards but I recognize it's not the same product even if it has the same FPS.",
              "score": 3,
              "created_utc": 1738889691.0,
              "replies": []
            },
            {
              "id": "mbdmxge",
              "author": "KalashnikittyApprove",
              "body": "> How does that argument make sense?\n\nPragmatism. Unless you already have an AMD card, I'm not sure what would tempt a lot of people away from Nvidia if the pitch is \"same performance for the same price.\" Might as well stick with Nvidia.",
              "score": 1,
              "created_utc": 1738881963.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbde142",
      "author": "FerricDonkey",
      "body": "I need a new graphics card. If these will compete with the 5070, and I am barely happy with the performance of the 5080, does this mean that there's no point waiting for them to come out? ",
      "score": 3,
      "created_utc": 1738879369.0,
      "replies": [
        {
          "id": "mbf1bff",
          "author": "gaige23",
          "body": "Yes.",
          "score": 3,
          "created_utc": 1738898586.0,
          "replies": [
            {
              "id": "mbg0bgl",
              "author": "FerricDonkey",
              "body": "Cool. Now here's hoping a 5080 actually exists for sale before then. ",
              "score": 2,
              "created_utc": 1738914238.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbde2yh",
      "author": "SniperPilot",
      "body": "The sooner they break the Nvidia monopoly the better",
      "score": 5,
      "created_utc": 1738879383.0,
      "replies": []
    },
    {
      "id": "mba2rjr",
      "author": "ToMorrowsEnd",
      "body": "Dear AMD.  give us MORE VRAM.  my ancient 3080 would actually play some of these games a lot better if it had more than 10gb.  Stop being stupid and put 16gb on the cheap cards and 32gb on the others.   At least thumb your nose at Nvidia that way.",
      "score": 25,
      "created_utc": 1738843903.0,
      "replies": [
        {
          "id": "mbc0puq",
          "author": "hyrule5",
          "body": "\"Ancient 3080\"",
          "score": 29,
          "created_utc": 1738865811.0,
          "replies": [
            {
              "id": "mbi1j9i",
              "author": "mattmaster68",
              "body": "The 3080 is *literally* what Epic devs use for their workstations lmao\n\nGranted, it’s combined with a threadripper but my point still stands haha I can’t believe they actually called the 3080 ancient.",
              "score": 3,
              "created_utc": 1738945678.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbano0u",
          "author": "Ausles",
          "body": "*Cries in 8 GB VRAM 3070TI*",
          "score": 16,
          "created_utc": 1738851800.0,
          "replies": []
        },
        {
          "id": "mbapeve",
          "author": "Stereo-Zebra",
          "body": "That was their entire strategy last generation and it didn't go well. $50 cheaper with 4gb more VRAM and people still flocked to Nvidia",
          "score": 15,
          "created_utc": 1738852365.0,
          "replies": []
        },
        {
          "id": "mbcukhl",
          "author": "StarsMine",
          "body": "Vram is a consequence of bus width. 3GB chips don’t come out till h2. You can’t just casually put more ram in. You never could.",
          "score": 2,
          "created_utc": 1738874039.0,
          "replies": []
        },
        {
          "id": "mbacvfl",
          "author": "None",
          "body": "[deleted]",
          "score": -3,
          "created_utc": 1738848072.0,
          "replies": [
            {
              "id": "mbbaid9",
              "author": "nokinship",
              "body": "Some games won't let you run out of vram because they will make the correct allocation and have textures pop in/reduced draw distance. Others like Indiana Jones and The Great Circle make it clear.",
              "score": 1,
              "created_utc": 1738858587.0,
              "replies": [
                {
                  "id": "mbbgmp2",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -1,
                  "created_utc": 1738860276.0,
                  "replies": [
                    {
                      "id": "mbbj8qk",
                      "author": "nokinship",
                      "body": "It does not play max settings 4k because of 10gb vram. The Texture pool size can only go to medium for me in 4k.\n\nTrust me I already tried different solutions. My game will straight up crash.",
                      "score": 0,
                      "created_utc": 1738860985.0,
                      "replies": [
                        {
                          "id": "mbbjtu2",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 2,
                          "created_utc": 1738861143.0,
                          "replies": [
                            {
                              "id": "mbbk9jl",
                              "author": "nokinship",
                              "body": "I didn't say its unusable. But you can't max things out.\n\nLowering resolution or textures is negligible if your display is 4k. Everything still has to upscale.",
                              "score": 0,
                              "created_utc": 1738861262.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mba4v2b",
          "author": "kazuviking",
          "body": "Even 16 is overkill when you're playing at 1080p with performance upscaling to get playable fps at 4k",
          "score": -19,
          "created_utc": 1738844852.0,
          "replies": [
            {
              "id": "mba5sk1",
              "author": "juh4z",
              "body": "In the span of 3 years we went from 8gb being enough even for 4k gaming to it not being enough for 1080p, and games coming out are just becoming less and less optimized, do you seriously believe that in the next 3 years the vram requirements to run games properly isn't going to skyrocket again?",
              "score": 10,
              "created_utc": 1738845260.0,
              "replies": [
                {
                  "id": "mbakjv3",
                  "author": "Mooselotte45",
                  "body": "Me sitting here with my 3070, weeping",
                  "score": 5,
                  "created_utc": 1738850765.0,
                  "replies": [
                    {
                      "id": "mbapdhi",
                      "author": "juh4z",
                      "body": "same lol",
                      "score": 2,
                      "created_utc": 1738852353.0,
                      "replies": []
                    },
                    {
                      "id": "mbaspz2",
                      "author": "Xero_id",
                      "body": "I'm on 1080 😔",
                      "score": 1,
                      "created_utc": 1738853422.0,
                      "replies": []
                    },
                    {
                      "id": "mbaw1r3",
                      "author": "-r4zi3l-",
                      "body": "My 3060 suddenly feels like a solid investment",
                      "score": 1,
                      "created_utc": 1738854433.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbf6w00",
      "author": "RaptorPrime",
      "body": "Cool so if they launch in March maybe I get one by October?",
      "score": 3,
      "created_utc": 1738900554.0,
      "replies": []
    },
    {
      "id": "mbb9hc3",
      "author": "None",
      "body": "\\>Mainstream 4k  \nI'll take stable and REASONABLY AFFORDABLE 1080p for 100 Alex.",
      "score": 10,
      "created_utc": 1738858299.0,
      "replies": [
        {
          "id": "mbdgga5",
          "author": "IrishExFatty",
          "body": "1440p monitors have been affordable for over a decade now time to move on, 1080p looks like shit especially in games that use TAA.",
          "score": 12,
          "created_utc": 1738880061.0,
          "replies": []
        },
        {
          "id": "mbcmus9",
          "author": "jrsedwick",
          "body": "What do you define as reasonably affordable?",
          "score": 1,
          "created_utc": 1738871907.0,
          "replies": []
        },
        {
          "id": "mbcuct5",
          "author": "Vandorol",
          "body": "I’ll never understand why people game at 1080p, image quality so much worse than 4K",
          "score": -9,
          "created_utc": 1738873980.0,
          "replies": [
            {
              "id": "mbddev4",
              "author": "the_abortionat0r",
              "body": "> I’ll never understand why people game at 1080p, image quality so much worse than 4K\n\nUh, money?",
              "score": 6,
              "created_utc": 1738879197.0,
              "replies": []
            },
            {
              "id": "mbenopw",
              "author": "twigboy",
              "body": "Diminishing returns per dollar spent",
              "score": 2,
              "created_utc": 1738893911.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mb9zly5",
      "author": "TinkW",
      "body": "AMD would be really better if they didn't try to keep up with NVIDIA release schedule and, instead, had a schedule of their own.  \nWhile they're not putting a proper \"fight\" on high-end line, they could easily take over the mid and low-end GPU market share. They have a better cost-efficiency, and their GPUS also aren't as short lived in the low-end because they don't cap on 8GB VRAM as NVIDIA purposefully does.",
      "score": 6,
      "created_utc": 1738842372.0,
      "replies": [
        {
          "id": "mbaiqvp",
          "author": "beleidigtewurst",
          "body": "They'd be hit \"better wait for nvidia\" with that.\n\nAlso, cards are not positioned in a vacuum.",
          "score": 4,
          "created_utc": 1738850149.0,
          "replies": []
        },
        {
          "id": "mbata9h",
          "author": "Xero_id",
          "body": "The Nintendo strategy, don't compete completely with the competition you can't beat",
          "score": 1,
          "created_utc": 1738853595.0,
          "replies": []
        },
        {
          "id": "mbawzjr",
          "author": "-r4zi3l-",
          "body": "They always had dominance in low-mid and below. I remember prioritising AMD for a decade on budget devices. High mids and flagships were Nvidia. All the DLSS fanfare made many budget users move away from team red for the gains Nvidia sold us. And I must say I've had this GPU longer than I had any AMD.",
          "score": 1,
          "created_utc": 1738854713.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbfctjh",
      "author": "compound-interest",
      "body": "Please succeed AMD. I beg thee",
      "score": 4,
      "created_utc": 1738902831.0,
      "replies": []
    },
    {
      "id": "mbd3d2l",
      "author": "MajorFuckingDick",
      "body": "Who is gaming at 4k?",
      "score": 3,
      "created_utc": 1738876434.0,
      "replies": [
        {
          "id": "mbefdov",
          "author": "cblake522",
          "body": "I have been for the last 4 years 🤷🏻‍♂️",
          "score": 4,
          "created_utc": 1738891112.0,
          "replies": []
        },
        {
          "id": "mbde34l",
          "author": "Tailcracker",
          "body": "Quite a lot of people nowadays, 4k monitors are much more accessible than they used to be. Plus I'm sure more would make the switch if they had a GPU that could run 4k at a decent stable framerate. Lots of people are also playing at 3440x1440 which isn't as many pixels as 4k but is still more than 2k 16:9 and requires a decent card as well.",
          "score": 7,
          "created_utc": 1738879385.0,
          "replies": [
            {
              "id": "mbgy77d",
              "author": "Squirrelking666",
              "body": "Yeah, Ultrawide was such a good idea at the time.",
              "score": 1,
              "created_utc": 1738932972.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mba4nq7",
      "author": "scummos",
      "body": "I'm pretty surprised people care so much about this. Graphics hasn't really been the limit to how fun a game is for a long time now. \n\nAnd additionally, computational power or amount of pixels hasn't really been what's limiting graphics for a long time now, either. Quality of the artwork is a much bigger factor.\n\nAnd *additionally*, I'm already having a hard time seeing a difference between a still photograph displayed on a 4k screen and a FHD screen. Maybe I'm just blind, I dunno. For text I do see a big difference, but not for images or video.",
      "score": 3,
      "created_utc": 1738844761.0,
      "replies": [
        {
          "id": "mba8c7b",
          "author": "raxitron",
          "body": "This is a golden age for people who don't notice the difference between 1440p and 4k screens.",
          "score": 12,
          "created_utc": 1738846328.0,
          "replies": [
            {
              "id": "mba9mwv",
              "author": "scummos",
              "body": "Eh, let me counter this: a lot of the pixel enthusiasts don't understand the real difference either. 4k video vs FHD video isn't the relevant comparison if one is five times as large -- you'd need to use the same bit rate with the same codec to encode both of them. But this isn't what usually happens, the 4k video is much larger and thus much higher quality.\n\nThe amount of pixels is very rarely the limiting factor for the visual quality of content on screens. But advertisements (and technical choices to push those, e.g. youtube seems to use better codecs for 4k content) have misled people into associating things with higher resolution, which actually aren't causally related to it.",
              "score": 5,
              "created_utc": 1738846849.0,
              "replies": []
            },
            {
              "id": "mbam9y0",
              "author": "AdmirableSelection81",
              "body": ">This is a golden age for people who don't notice the difference between 1440p and 4k screens.\n\nIf you have a massive monitor, wouldn't the difference be noticeable? Like, Samsung has that 50+ plus inch monitor that rotates.",
              "score": 2,
              "created_utc": 1738851341.0,
              "replies": [
                {
                  "id": "mbankbs",
                  "author": "raxitron",
                  "body": "I'm sure there are lots of people who can see it at x size, but I can only speak for my own eyes. I guess if someone wants to sit really close to that massive monitor and/or has incredible eyesight then gaming is just gonna be a very expensive hobby for them.",
                  "score": 0,
                  "created_utc": 1738851767.0,
                  "replies": [
                    {
                      "id": "mbanzj6",
                      "author": "AdmirableSelection81",
                      "body": "I have my 24 inch 1080P 480hz monitors for gaming, i also have a 50 inch 4k TV that i sometimes hook up my work laptop to when i have massive excel files i have to work on, the difference is immense in that regard at least lol, when i have to audit massive excel files, it's just so much easier to do on my 4k tv.",
                      "score": 3,
                      "created_utc": 1738851904.0,
                      "replies": [
                        {
                          "id": "mbaqf11",
                          "author": "raxitron",
                          "body": "Hmm text might be the exception. I know that I've experienced a few games being unplayable on a steam deck's 720p. But I've never done an eye test for small text on 1440v2160. Dead Space Remake might be a good way to test it - the text looked terrible to me even in 1080p.",
                          "score": 1,
                          "created_utc": 1738852692.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbajmcf",
              "author": "AgentOfSPYRAL",
              "body": "Ultrawide has been an amazing “compromise”.",
              "score": 1,
              "created_utc": 1738850447.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mbizayk",
      "author": "DaJix2k5",
      "body": "Can a man trace some rays for $600?",
      "score": 1,
      "created_utc": 1738955239.0,
      "replies": []
    },
    {
      "id": "mblyw7y",
      "author": "Derwinx",
      "body": "I mean if they get the launch right it will compete with high-end RTX 50 GPUs as well, namely because AMD will have an actual product and Nvidia will still be MIA.",
      "score": 1,
      "created_utc": 1738990183.0,
      "replies": []
    },
    {
      "id": "mc9yawk",
      "author": "Avinay",
      "body": "AMD GPU Marketing is always bs - sadly.",
      "score": 1,
      "created_utc": 1739317175.0,
      "replies": []
    },
    {
      "id": "mbdrbok",
      "author": "Select_Factor_5463",
      "body": "wow, 4k gaming, and most of the nerds just have 1440p monitors.",
      "score": 1,
      "created_utc": 1738883302.0,
      "replies": []
    },
    {
      "id": "mbeo4oe",
      "author": "Appok",
      "body": "AMD is primed for the taking of graphics cards. If they can enough. \n\nHave a card that does better job of a 5080 or 5090 for a much less cost that is actually affordable.",
      "score": 1,
      "created_utc": 1738894063.0,
      "replies": []
    },
    {
      "id": "mbe8f1a",
      "author": "Relevant-Doctor187",
      "body": "If it can do a solid 120fps at 4k then people will buy it.",
      "score": 0,
      "created_utc": 1738888825.0,
      "replies": [
        {
          "id": "me4b20p",
          "author": "samelogic137",
          "body": "I will",
          "score": 1,
          "created_utc": 1740203058.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbbn4xp",
      "author": "GraveyardGuardian",
      "body": "Functioning drivers coming 2030",
      "score": -6,
      "created_utc": 1738862062.0,
      "replies": []
    }
  ]
}