{
  "post": {
    "title": "Intel says ‘stay tuned’ to those asking for Arc B770",
    "author": "a_Ninja_b0y",
    "id": "1kn7re9",
    "score": 821,
    "created_utc": 1747314441.0,
    "selftext": "",
    "num_comments": 85,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kn7re9/intel_says_stay_tuned_to_those_asking_for_arc_b770/"
  },
  "comments": [
    {
      "id": "msg20g2",
      "author": "SadisticChipmunk",
      "body": "What Intel. Who gave us this Intel?",
      "score": 298,
      "created_utc": 1747315674.0,
      "replies": [
        {
          "id": "msg7zpm",
          "author": "HashS1ingingSIasher",
          "body": "Many Bothans died to bring us this information. ",
          "score": 108,
          "created_utc": 1747317633.0,
          "replies": [
            {
              "id": "msj4jnl",
              "author": "notmoleliza",
              "body": "pour one out for our friend Manny Boathands",
              "score": 13,
              "created_utc": 1747348865.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msg8dr5",
          "author": "MedonSirius",
          "body": "Colonel Roy Campbell",
          "score": 13,
          "created_utc": 1747317756.0,
          "replies": [
            {
              "id": "msmu5re",
              "author": "dumbestsmartest",
              "body": "\"The La-li-lu-le-lo!\"",
              "score": 1,
              "created_utc": 1747406952.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msgzzdw",
          "author": "Blind-_-Tiger",
          "body": "Foul the ship.",
          "score": 3,
          "created_utc": 1747325957.0,
          "replies": []
        },
        {
          "id": "msjpe76",
          "author": "Waterme1one",
          "body": "It came through the motherboard",
          "score": 1,
          "created_utc": 1747356415.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msh3nal",
      "author": "badger906",
      "body": "Intels biggest hurdle is fanboy culture. \nI still know people who refuse to buy amd processors and cite reasons based on things that happened 20 years ago.",
      "score": 185,
      "created_utc": 1747327051.0,
      "replies": [
        {
          "id": "mshyehy",
          "author": "_CatLover_",
          "body": "Doesn't even have to be fanboys necessarily, just friction against swapping away from the brand you've \"always used\".\n\nAmd also used to have big driver issues throughout the early 2010s which tarnished their reputation among enthusiast users (especially for GPUs). Things got better with Ryzen but it still took multiple generations for them to become really popular / first choice for gamers. Personally i was choosing between i7-9700k and R7 2700x in 2018 but because i had used intel in my previous build it felt like the safer choice with no other major differences present.\n\nFor GPUs nvidia has really not delivered for the 40- and 50-series, so there's absolutely an opportunity for intel to get their foot in the door through the budget market if the B770 can offer 5060 ti 16GB like performance at a lower price. Im really excited to see what their next gen will look like now that their designs have had 2 generations time to mature. More competition on the GPU market is a win for everyone (except nvidia).",
          "score": 75,
          "created_utc": 1747336005.0,
          "replies": [
            {
              "id": "msidvh6",
              "author": "hijodeosiris",
              "body": "That \"enthusiast\" part is bullshit. Enthusiast users can easily identify when a product / platform provides clear advantages over others, regardless of brand or color, you want the best Adobe software and single core usage, sure intel; want the best multithread-power consuption performance ok AMD, and so on so on (im simplifying it).\n\nAre dumbfuck fanbois who consume w/e stupid marketing and influencers/youtubers of shit reputation and questionable ethics who stick with brand and just repeat the same shit arguments to discredit not switching to X-Y product.\n\nEnthusiast are the one who already have moved the X3D chips to ensure they get the best of the best when talking about games or Epyc / Threadripper for productivity or the ones who still buy 5090s for the the AI productivity and not to AMDs w/e high end they have.",
              "score": 15,
              "created_utc": 1747340557.0,
              "replies": [
                {
                  "id": "msio0al",
                  "author": "_CatLover_",
                  "body": "Huh, yeah the enthusiasts would be the one knowing AMD/Radeon had bad drivers.\n\nThe first X3D chips were for the 4th gen of desktop Ryzens. Which is exactly my point too, it took multiple generations of Ryzen to become the main choice, despite earlier gens already being competitive.\n\nImo when speaking about the PC gaming \"community\" (for lack of a better word), i think it's fine to use the term enthusiast for anyone building their own PCs and doing a bit of extra research about all parts and maximizing for their budget, not only the people buying the most expensive parts. \n\nThe \"fanbois\" are a very small but vocal minority online. There are massive amounts of people who buy prebuilds and can't remember what parts they have outside of \"intel+nvidia\". They had something that worked and they keep buying newer models of the same stuff. That's a common trait among consumers across all markets. And something like 5-10% better value for money isn't gonna make them break their pattern.",
                  "score": 8,
                  "created_utc": 1747343512.0,
                  "replies": [
                    {
                      "id": "msr8u3s",
                      "author": "akeean",
                      "body": "The most popular GPU on Steam is a [4060 laptop](https://store.steampowered.com/hwsurvey/videocard/) GPU. Then probably a lot of stuff from prebuilds and other laptops. The DIY market is tiny compared to those segments, wich is why it gets the dog treatment in terms of pricing and availability.",
                      "score": 1,
                      "created_utc": 1747464484.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "msxkrps",
                  "author": "tornado9015",
                  "body": "People get used to trends. Intel had a significant edge in the top tier cpu market for roughly 50 years. AMD typically offered better performance at the same price point, but if you wanted the best, the answer was undeniably intel. Not everybody has time to carefully review benchmarks or performance per dollar comparisons for everything they buy. If intel has been the best for the last 45 years it seems like a safe bet they would continue to be the best, why would that change? This can absolutely apply to enthusiasys who have spent hundreds of hours researching and coming to the same conclusions again and again for over a decade. At some point you just take for granted that this particular thing doesn't change and you spend your limited time on this earth researching other things more likely to change.\n\nBut sometimes surprises happen.",
                  "score": 1,
                  "created_utc": 1747563232.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "msii4op",
          "author": "Fatal_Neurology",
          "body": "Lack of subject matter expert knowledge by management making staffing decisions in fabs? Ineffectual R&D labs? Neglected investment in instruction set development? Value extraction culture in the board and C-suite? Cashflow constraints? \n\nNo, it's the *fanboys* that are the biggest hurdle. Your weird uncle you have, the psycho who runs userbenchmark, and someone on reddit you saw got like 20 downvotes in a reddit comment for making an overzealous proclamation about Intel chips. \n\nWhat do you all do for work that you think things like this 🤦🏻\n\nWhatever shreds of brand loyalty are left are literally intel's lifeline for figuring out its actual hurdles.",
          "score": 7,
          "created_utc": 1747341782.0,
          "replies": [
            {
              "id": "msiijku",
              "author": "badger906",
              "body": "So you think customers aren’t the most important part? the people that buy the products? I don’t understand how you can think anything else in a business is more\nImportant.",
              "score": 2,
              "created_utc": 1747341901.0,
              "replies": [
                {
                  "id": "msioyou",
                  "author": "Fatal_Neurology",
                  "body": "Do your customers show up to your job site and perform your value added steps for you? Design your process, strategy decisions, making staffing decisions?\n\nThey have *absolutely nothing* to do with your business other than voting on what you bring to market. They're the talent show judges, the judges *not* being part of your talent performance is like the one basic piece of toddler-level information you explain about the whole scene to the child in your stroller.\n\nIs your point that intels biggest hurdle is that it's still in business? You realize that when you're not in business anymore that you're gone. Like we wont see grandma again gone.",
                  "score": 1,
                  "created_utc": 1747343802.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mshsdti",
          "author": "Tarenola",
          "body": "I love my AMD CPU. Switching to a AMD GPU is something I do regret tho. Never had so many driver problems with an Nvidia GPU before.\n\nBasic stuff like my 2nd monitor sometimes been displayed at 480p max...",
          "score": 13,
          "created_utc": 1747334197.0,
          "replies": [
            {
              "id": "mshvdik",
              "author": "badger906",
              "body": "Guess I’m lucky, I’ve never had driver issues. I’ve switched between amd and nvidia many times. I just buy the best performing one in my budget. Currently have 2 setups with all AMD hardware and no issues .",
              "score": 21,
              "created_utc": 1747335096.0,
              "replies": []
            },
            {
              "id": "msi8iub",
              "author": "Neriya",
              "body": "I just swapped to a 9070XT. No issues so far, aside from some games that had better DLSS than FSR support, but I can deal with that.\n\nBut it helps that I've never been brand loyal and my house, which has three computers in it, has always had a mix of vendors. Up until recently I was the only Nvidia GPU in the house; my wife and kid both had 5700XTs. \n\nOver time that got swapped, and now wife and kid run 3070Ti/2080Ti respectively and I'm now the lone AMD user with my new 9070XT.\n\nNobody but me can even tell a difference.",
              "score": 5,
              "created_utc": 1747338999.0,
              "replies": []
            },
            {
              "id": "mshvwfr",
              "author": "yzakydzn",
              "body": "Most people I've met telling me they had driver issues in reality had a faulty GPU and were in denial of having to send it back.",
              "score": 8,
              "created_utc": 1747335252.0,
              "replies": [
                {
                  "id": "msj1hkx",
                  "author": "MiloIsTheBest",
                  "body": "Yeah so the issue that I had was almost certainly a faulty GPU in retrospect but it was such a finicky thing that's it's hard to justify that it was broken and wasn't just some software issue. \n\n\nThat's the problem. It's not shitting out glitches or hard booting the machine it's timing out a driver every so often during a game and returning to desktop. Sometimes once every couple of days, sometimes once a day, sometimes once an hour. Makes it SEEM a lot like a software problem.\n\n\nI can tell you no AMD fanboy ever even suggested I had a faulty GPU when I was investigating the issue. Everything was a problem with something I must've done.\n\n\nHoly moly the suggestions ranged from incorrect bios or registry settings to my literal mains power being dirty. \n\n\nThe fact is that the issue was either faulty hardware or faulty software. In the end I got rid of both so I could finish just one goddamn Flight Sim session.",
                  "score": 2,
                  "created_utc": 1747347788.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msiliee",
              "author": "NightFuryToni",
              "body": "I've actually had a long streak of ATI/AMD GPUs, my first recent one was my RTX 2060 and now my 4070 Super. Before that, the last nVidia GPU I had was a GeForce 4 Ti 4200, and never really had major driver issues with either brands over the years.",
              "score": 2,
              "created_utc": 1747342766.0,
              "replies": []
            },
            {
              "id": "msi5e3u",
              "author": "yashdes",
              "body": "And if you're a developer, there is essentially no alternative to using cuda",
              "score": 4,
              "created_utc": 1747338078.0,
              "replies": [
                {
                  "id": "msiktld",
                  "author": "Fredasa",
                  "body": "And now I'm suddenly wondering if the PyTorch builds have been updated to support the 50xx series yet...",
                  "score": 3,
                  "created_utc": 1747342562.0,
                  "replies": [
                    {
                      "id": "msjd0zk",
                      "author": "throwawaycontainer",
                      "body": "Yes, 2.7 supports CUDA 12.8.",
                      "score": 2,
                      "created_utc": 1747351849.0,
                      "replies": [
                        {
                          "id": "msjm0w6",
                          "author": "Fredasa",
                          "body": "Ah yep, there it is, tucked away almost like an afterthought.  Even though it's probably the single most conspicuous thing people wanted for the last half year.",
                          "score": 1,
                          "created_utc": 1747355140.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "msk1qfz",
              "author": "chizburger999",
              "body": "My HTPC 2 monitors with an RX 480 4gb has been displaying two different resolutions at the same time. I've been using it for almost 10 years without any problems until now.",
              "score": 1,
              "created_utc": 1747360999.0,
              "replies": []
            },
            {
              "id": "mtacr4h",
              "author": "-WallyWest-",
              "body": "Each time I'm switching from one brand to another (CPU or GPU), I always do a clean Windows install. \n\nRecently swapped from a 3080 to a 9070 XT and I've had more issue with my 3080 so far. The only annoying thing with the 9070 XT is that lack of FSR 4 games.",
              "score": 1,
              "created_utc": 1747745348.0,
              "replies": []
            },
            {
              "id": "mti9e4m",
              "author": "VYDEOS",
              "body": "Everyone seems to be having driver problems. Nvidia has the black screen thing rn, Intel drivers just straight up suck, and are unsupported half the time",
              "score": 1,
              "created_utc": 1747848124.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msidu4m",
          "author": "SandmanJr90",
          "body": " regurgitating the same points til they retire without bothering to check",
          "score": 2,
          "created_utc": 1747340547.0,
          "replies": []
        },
        {
          "id": "msl9wq6",
          "author": "correctingStupid",
          "body": "I buy intro because I used to be an amd fanboy and while they are doing well now their past was worse than Intele present. \n\n\nAnd no. Fanboyism isn't why Intel sells server chips. Silly",
          "score": 1,
          "created_utc": 1747382640.0,
          "replies": []
        },
        {
          "id": "msmga9n",
          "author": "DXsocko007",
          "body": "I have own amd but they have the worst vulnerabilities. Zen 1-5 has a new vulnerability that basically allows randsomeware to be injected into the cpu. So even with formats and everything you can’t use the pc again till you pay. Intel doesn’t have this problem",
          "score": 1,
          "created_utc": 1747402661.0,
          "replies": [
            {
              "id": "msoepxe",
              "author": "badger906",
              "body": "Ok.. but think about this realistically. The people who fall for ransomware attacks aren’t tech savvy, and the number of people that do is tiny.. because they go after companies not individuals.",
              "score": 1,
              "created_utc": 1747423664.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxk0n2",
          "author": "Sundaver",
          "body": "Because it still happens lol there have been a handful of games released in the past few years alone that could not be played for some time unless you were team BlueGreen.",
          "score": 1,
          "created_utc": 1747562777.0,
          "replies": []
        },
        {
          "id": "mti7zi1",
          "author": "VYDEOS",
          "body": "I mean, even in this day and age, amd is still objectively worse in gpus. In fps per dollar and value sure, amd wins all day, but in actual features, raster performance, and especially in productivity, it's not even close.\n\n\nIn CPUs, you have a point. Amd is objectively better than Intel right now, although you can argue Intel is better value. In gaming, amd CPUs are all kinda the same. Very little difference from 9600x, 9700x, 9900x and 9950x. The x3ds of course smoke the normal processors, but the difference between 9800x3d, 9900x3d, and 9950x3d isn't huge, and the last two are way out of most peoples budget.\n\n\nJust a few generations ago, I'd argue Intel was still better. Bluescreening and overheating aside, 14900k is probably a better buy than say 7950x3d. But then the quality issues happened, and Intel completely dropped the ball with core ultra and lga 1851 which is already dead. It's really only the last generation or two amd became better, and it's more so due to Intel and Nvidia messing up than amd actually becoming better.",
          "score": 1,
          "created_utc": 1747847732.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mshfzv2",
      "author": "sanoumg",
      "body": "My buddy built a PC with the B580 chipset and he’s got it all figured out. He’s playing his favorite games without any problems. He even jokes about me buying NVIDIA cards, but I gotta admit, Intel’s cards are surprisingly affordable and actually quite good.",
      "score": 41,
      "created_utc": 1747330589.0,
      "replies": [
        {
          "id": "mshs3s8",
          "author": "WoodYouIfYouCould",
          "body": "Did he have any teething issues? Friend of mine recently got a B580 and we have troubleshooted it to the nines. BOSD frequently and that is the only thing that changed. Even with a full fresh W10 install.",
          "score": 10,
          "created_utc": 1747334113.0,
          "replies": [
            {
              "id": "mshtqu6",
              "author": "shofmon88",
              "body": "Is the BSOD code related to the GPU? The codes are often quite informative on what exactly went wrong. You can always go back and check them in Event Viewer. ",
              "score": 14,
              "created_utc": 1747334608.0,
              "replies": []
            },
            {
              "id": "msi0vtl",
              "author": "sanoumg",
              "body": "I just asked him and he said none.",
              "score": 3,
              "created_utc": 1747336738.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "msgyeyr",
      "author": "unabletocomput3",
      "body": "I swear, intel is basically sitting on their butts, while Nvidia and AMD are both shooting each other in the foot on pricing with their gaming gpus. They just need to release something at this point, as long as the drivers function and it doesn’t cost an arm and a leg.",
      "score": 93,
      "created_utc": 1747325493.0,
      "replies": [
        {
          "id": "mshbbo5",
          "author": "DogmaticLaw",
          "body": "While there are many things to critique Intel on, releasing GPUs is a weird one to choose since they have released a solid number of them and seem to be using the investment to improve their integrated graphics as well. On top of that, the drivers work and they don't cost an arm and a leg.",
          "score": 58,
          "created_utc": 1747329263.0,
          "replies": [
            {
              "id": "mshjmwx",
              "author": "unabletocomput3",
              "body": "Yes, but it would be nice to know anything about what they’re planning for the rest of this lineup. \n\nCurrently, the gpu market is a mess. The b570 and b580 are a solid choice for those that want 4060-4060ti performance at $200-300, without the drawback of 8gb of vram and/or lacking bandwidth. That being said, there’s a pretty big hole in the $400-600 price range, with the 5060ti and 5070 being pretty underwhelming for the price they ask, and the 9070 series costing $200-300 more, effectively putting them at $750-900. If Intel put something somewhere inbetween, with decent vram capacity and possibly close to 5070 performance, they could easily win the low-midrange market.\n\nMy issue is that we’re 5 months in to this generation, yet we have next to no info regarding higher end battlemage gpus. They have the perfect opportunity to gain ground against even Nvidia, and they only just started saying “expect some news soon!”",
              "score": 12,
              "created_utc": 1747331618.0,
              "replies": [
                {
                  "id": "mshpnmz",
                  "author": "Dripdry42",
                  "body": "they are building the hype on this. All the other companies do it... and why telegraph their intentions ahead of time so Nvidia or AMD could potentially steal their thunder?",
                  "score": 1,
                  "created_utc": 1747333379.0,
                  "replies": [
                    {
                      "id": "mshsyys",
                      "author": "tastyratz",
                      "body": "AMD and NVIDIA clearly are not stealing anyone's thunder, they can't even produce their own cards they make today.\n\nI have been desperate for a msrp/founders 9070 (xt) for months and the whipped up market adjustment runaway reseller and 3rd party manufacturer market is out of control. \n\nAs far as I'm concerned the mid to upper gamer gpu launches are borderline paper launches while they focus on the AI hype. It's bitcoin mining all over again while they abandon their core markets.\n\nIf Intel can actually get competitive GPU's in the hands of real life gamers at price points even approaching the competition's launch msrp's that's a huge advantage Nvidia & AMD can't seem to even hit in a captive market.\n\nIn case you can't tell I'm with everyone else it seems and pretty salty over it all.",
                      "score": 7,
                      "created_utc": 1747334374.0,
                      "replies": []
                    },
                    {
                      "id": "mshvurh",
                      "author": "unabletocomput3",
                      "body": "I’m not annoyed that they’re building hype, I’m annoyed that they could be passing a golden opportunity to prove that they’re an actual option in the gpu market. \n\nShowing what the specs are could cause the competition to pivot, but in this case, AMD and Nvidia have released (possibly) most of their lineup, and nobody has any idea what to expect with the b770’s performance. You can’t really hype anything up if nobody knows what to expect.",
                      "score": 2,
                      "created_utc": 1747335239.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "msj0ozb",
              "author": "billythygoat",
              "body": "I think most gaming people on reddit just want a 120+ fps at 1440p gpu with what you said with good 1% lows.",
              "score": 1,
              "created_utc": 1747347519.0,
              "replies": [
                {
                  "id": "msmuy64",
                  "author": "dumbestsmartest",
                  "body": "1440p? Why? We should be at 4k these days.",
                  "score": -1,
                  "created_utc": 1747407187.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "msh8efl",
          "author": "CompromisedToolchain",
          "body": "That stuff takes time and doesn’t happen publicly.",
          "score": 19,
          "created_utc": 1747328416.0,
          "replies": [
            {
              "id": "msj1wzn",
              "author": "MiloIsTheBest",
              "body": "Yes I think Intel are making that painfully obvious lol",
              "score": 1,
              "created_utc": 1747347935.0,
              "replies": [
                {
                  "id": "msjl1yt",
                  "author": "CompromisedToolchain",
                  "body": "At least they are making it 🤷🏻‍♂️",
                  "score": 1,
                  "created_utc": 1747354768.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mshkjfk",
              "author": "unabletocomput3",
              "body": "Yes, but we’re 5 months into this gen and there isn’t even specs. They have the perfect opportunity to draw in more users, with the midrange gpu market being a complete mess, and they only just started announcing their plan for something higher than a b580.",
              "score": -5,
              "created_utc": 1747331873.0,
              "replies": [
                {
                  "id": "mshlfqa",
                  "author": "CompromisedToolchain",
                  "body": "Most plans have been disrupted recently. I’m long on Intel.",
                  "score": 5,
                  "created_utc": 1747332127.0,
                  "replies": []
                },
                {
                  "id": "msim3c0",
                  "author": "EJOtter",
                  "body": "Most new chip designs take 1.5-2 years.",
                  "score": 2,
                  "created_utc": 1747342940.0,
                  "replies": [
                    {
                      "id": "msip1jm",
                      "author": "unabletocomput3",
                      "body": "I’d agree, if they didn’t already release the b580, a chip on the same architecture. Unless, of course, they somehow went backwards, instead of getting a full finished chip and cutting down defective die’s for lower end skus.",
                      "score": 0,
                      "created_utc": 1747343825.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "msid9va",
      "author": "None",
      "body": "[deleted]",
      "score": 16,
      "created_utc": 1747340388.0,
      "replies": [
        {
          "id": "msj7n2k",
          "author": "dingbatwelby",
          "body": "Let alone a flagship device “powered” by AI and is somehow miraculously and decidedly worse than its previous generation.",
          "score": 12,
          "created_utc": 1747349972.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msi2olu",
      "author": "ToMorrowsEnd",
      "body": "Honestly these video cards are what is going to keep Intel alive.   Their processors suck right now compared to AMD but these video chips and cards are affordable and work extremely well.",
      "score": 4,
      "created_utc": 1747337271.0,
      "replies": [
        {
          "id": "mtkadrs",
          "author": "bandit8623",
          "body": "they dont suck.  they are fine.  and more affordable.",
          "score": 0,
          "created_utc": 1747869733.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msje6zr",
      "author": "Gloriathewitch",
      "body": "they say this to every comment lol",
      "score": 1,
      "created_utc": 1747352263.0,
      "replies": []
    },
    {
      "id": "mtmibp9",
      "author": "Left-Sink-1887",
      "body": "I just hope that the B770 has three times more TFlops than the previous card, double the Xe Cores and 24 GB VRAM",
      "score": 1,
      "created_utc": 1747904871.0,
      "replies": []
    },
    {
      "id": "mshholp",
      "author": "shalol",
      "body": "Doubt they’ll be changing anything about the 1% market share unless they can cobble up a 5080 tier flagship",
      "score": -8,
      "created_utc": 1747331067.0,
      "replies": [
        {
          "id": "msiksej",
          "author": "CalendarFactsPro",
          "body": "Why do you think this? XX80 tier cards are like under 3-5% marketshare on steam surveys across all generations. I think if they can prove their performance at lower tier cards their marketshare will be way higher than if they chase the unrealistic flagship cards that very few people ever actually go for.",
          "score": 6,
          "created_utc": 1747342553.0,
          "replies": [
            {
              "id": "msjy47e",
              "author": "shalol",
              "body": "Everyone keeps saying “oh if it’s a good value people will buy” but that has yet to happen to a budget card from AMD or Intel since the RX480/580, from over half a decade ago, both models which still massively undersold the 1060 despite being the better value budget card.",
              "score": 1,
              "created_utc": 1747359676.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mshpmry",
          "author": "Caleth",
          "body": "Rome wasn't built in a day, the fact Intel hasn't abandoned the idea is rather amazing. I mean they'd done a push like this before and when it didn't immediately moon they dropped it.\n\nThis time they seem to be sticking with it and laying ground work that's solid.  Hopefully that translates into sales and a taking some of the pie.  Lord knows NVIDIA needs a solid punch in the dick for how they've been behaving lately.",
          "score": 9,
          "created_utc": 1747333372.0,
          "replies": [
            {
              "id": "msj62hl",
              "author": "agitatedprisoner",
              "body": "I don't see any light at the end of the tunnel for Intel unless they can get their foundry yields up.  Who in their right mind thinks Intel will be designing better GPU's than nvidia?  It makes sense for Intel to sell GPU's but selling GPU's won't save intel.",
              "score": 1,
              "created_utc": 1747349410.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "msh8uxb",
      "author": "None",
      "body": "[deleted]",
      "score": -16,
      "created_utc": 1747328548.0,
      "replies": [
        {
          "id": "mshanja",
          "author": "Dt2_0",
          "body": "Doesn't need to. Match the base 4070 with more VRAM would make a super compelling 1440p card. Especially at a good price. B580 is already at an extremely good price (at least MSRP which can sometimes be a thing with ARC), and beats the 4060. Hell I'd say slotting in between the 4060TI and 4070 on the charts at the $350-$400 price point would be a no brainer. That's $200 less than 5070 MSRP, and probably will do better in the future due to more VRAM.",
          "score": 29,
          "created_utc": 1747329070.0,
          "replies": []
        },
        {
          "id": "mshbglw",
          "author": "rockelroolen1",
          "body": "Definitely can, in price.",
          "score": 16,
          "created_utc": 1747329302.0,
          "replies": [
            {
              "id": "mshd8hz",
              "author": "None",
              "body": "[deleted]",
              "score": -18,
              "created_utc": 1747329809.0,
              "replies": [
                {
                  "id": "mshhxi2",
                  "author": "ElectronicMoo",
                  "body": "I guess it depends on what you define as poorly.  All Nvidia cards are _way_ overpriced right now, because they can be.  It's not just gamers who covet Nvidia cards, and they are pricing it accordingly.",
                  "score": 14,
                  "created_utc": 1747331137.0,
                  "replies": [
                    {
                      "id": "mshkqe1",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -10,
                      "created_utc": 1747331927.0,
                      "replies": [
                        {
                          "id": "mshualu",
                          "author": "shofmon88",
                          "body": "“Best priced Nvidia card” is not the same as a well-priced card. Nvidia cards are massively overpriced for what they are. ",
                          "score": 10,
                          "created_utc": 1747334772.0,
                          "replies": [
                            {
                              "id": "mshz2qv",
                              "author": "None",
                              "body": "[deleted]",
                              "score": -5,
                              "created_utc": 1747336206.0,
                              "replies": [
                                {
                                  "id": "msi6xq9",
                                  "author": "shofmon88",
                                  "body": "I don’t know what you’re talking about. \n\nOur major Australian retailer lists the 9070 at $1,049 to $1,289. There are 11 models listed with 6 sold out. \n\nThe 5070 from the same retailer ranges from $1,079 to $1,399. There are 30 models listed with 1 sold out.\n\nNot only is the 9070 cheaper, it seems to be far more in-demand. I actually am shocked at how many Nvidia cards are available, usually they are mostly sold out with supply struggling to meet demand. But 29 versions available out of 30? I’ve literally never seen that before. ",
                                  "score": 3,
                                  "created_utc": 1747338535.0,
                                  "replies": [
                                    {
                                      "id": "msinyjo",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 0,
                                      "created_utc": 1747343498.0,
                                      "replies": [
                                        {
                                          "id": "msjbswa",
                                          "author": "shofmon88",
                                          "body": "Those prices are our MSRP.\n\nI live in Australia, how is that cherry-picking? I could easily accuse you of cherry picking the US instead of looking at global prices at a whole. As a matter of fact, I will accuse you of that since you are attacking any data that refutes your argument, and continue to add random stipulations to what data can be used to force a particular narrative.  Be better. ",
                                          "score": 0,
                                          "created_utc": 1747351422.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "msi8c53",
                                  "author": "shofmon88",
                                  "body": "And just to be thorough, the 9070 XT ranges from $1,249 to $1,499, with 23 models listed and 14 of those sold out. \n\nThe 5070 Ti ranges from $1,509 to $1,999, with 30 models listed and 9 of those sold out. \n\nAMD wins on price massively here, and once again appears to be far more in-demand. ",
                                  "score": 0,
                                  "created_utc": 1747338945.0,
                                  "replies": [
                                    {
                                      "id": "msinhp8",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 0,
                                      "created_utc": 1747343360.0,
                                      "replies": [
                                        {
                                          "id": "msjassy",
                                          "author": "shofmon88",
                                          "body": "I already covered that in my other comment. You chose the 5070 because the Ti version is priced so abysmally, so I get why you wouldn’t want it mentioned; it pokes big holes in your argument. ",
                                          "score": 0,
                                          "created_utc": 1747351074.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "msiraz8",
                  "author": "hertzsae",
                  "body": "Your issue is assuming that a lot of people need 5070 level performance. \n\nI don't even need b580 performance, so the 5070 is terribly priced for me.",
                  "score": 2,
                  "created_utc": 1747344506.0,
                  "replies": [
                    {
                      "id": "msirmcz",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -1,
                      "created_utc": 1747344602.0,
                      "replies": [
                        {
                          "id": "msit0vi",
                          "author": "hertzsae",
                          "body": "And you don't know what it's going to be priced at. If it's priced below the 5070, then it will beat the 5070 on price which you are somehow arguing can't be beat on price.",
                          "score": 2,
                          "created_utc": 1747345029.0,
                          "replies": [
                            {
                              "id": "msiv7zj",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 1,
                              "created_utc": 1747345716.0,
                              "replies": [
                                {
                                  "id": "msiyde2",
                                  "author": "hertzsae",
                                  "body": "And the original reply to your comment points out that questing it's performance in relation to a card that is likely to be a lot more expensive is really fucking stupid. People will not be cross-shopping a likely $350-$400 MSRP b770 with a $550 MSRP 5070.\n\nSo quit being so condescending and insulting in your replies when your comprehension of what others are saying is so poor.",
                                  "score": 1,
                                  "created_utc": 1747346735.0,
                                  "replies": [
                                    {
                                      "id": "msj0qep",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 1,
                                      "created_utc": 1747347532.0,
                                      "replies": [
                                        {
                                          "id": "msnup99",
                                          "author": "areyouhungryforapple",
                                          "body": "The discontinued card? Dude you have 0 understanding of the industry please stop",
                                          "score": 0,
                                          "created_utc": 1747417596.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "msnte2a",
                  "author": "areyouhungryforapple",
                  "body": "This is incredibly ironic. the 9070xt exists dude",
                  "score": 0,
                  "created_utc": 1747417213.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "msntaj8",
          "author": "areyouhungryforapple",
          "body": "As long as it doesn't have similar braindead idiotic pricing it'll be fine\n\nShit if they made a 5060 equivalent with 16gb but significantly cheaper they could capture a good portion of the 1080p gamers \n\nPerfect time to strike for Intel if they do it well",
          "score": 0,
          "created_utc": 1747417185.0,
          "replies": [
            {
              "id": "msnuuvh",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1747417641.0,
              "replies": [
                {
                  "id": "msnv5i0",
                  "author": "areyouhungryforapple",
                  "body": "??????\n\nNvidia doesn't care about gamers in general maybe sure. The xx60 cards have loong been the de facto 1k usd range prebuilts which is a rather significant part of the market\n\nSilly silly comments",
                  "score": 1,
                  "created_utc": 1747417726.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mshcjzp",
      "author": "howardhus",
      "body": "meh.. Arc was always a bad product. i wonder who is \"asking\" for a B770.\n\nNvidia is top notch for AI and can afford to ask for horrendous prices. people are happily paying since their hardaware work flawlessly on windows and linux.\n\nAMD is sleeping on the AI but is second best on the gaming sector on windows on price and best bang-for-the-buck on CPU,\n\nBoth have cheap energy efficient GPUs for the low level and office market.\n\n\nIntel leads the CPU market with the most powerful single core CPU... that nobody cares about since AMD beats it on multicore on price and power and they dont really have a case for anything...\n\nArc is basically the worse card of them all: bad AI and not the fastest for gaming with bad driver support. Windows is bugged and linux drivers are a valley of misery.\n\nThe only thing going for Arc is the price.. and it says something that Intel (!) is now lowering itself to be \"cheap\".\n\nthey are basically living on existing hardware lock-ins. They dont have anything coming up either\n\nI say Intel will die.",
      "score": -26,
      "created_utc": 1747329614.0,
      "replies": [
        {
          "id": "mshnj2q",
          "author": "pr1vatepiles",
          "body": "Please do stand up and take some weight off your brain.",
          "score": 4,
          "created_utc": 1747332747.0,
          "replies": []
        }
      ]
    }
  ]
}