{
  "post": {
    "title": "The Atari ST was eight years too early for Doom, but not anymore | A native port to an emulated 8 MHz processor",
    "author": "chrisdh79",
    "id": "1kalyeg",
    "score": 388,
    "created_utc": 1745927347.0,
    "selftext": "",
    "num_comments": 31,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kalyeg/the_atari_st_was_eight_years_too_early_for_doom/"
  },
  "comments": [
    {
      "id": "mpn7irf",
      "author": "WraithCadmus",
      "body": "I always feel a bit bad for the ST, it wasn't a bad machine by any stretch, but it felt like the A500 immediately ate its lunch. I know it had some success in music production (even into the era of dubstep!) because of the MIDI ports, but that was niche.\n\nPeople will also be looking at this as some sort of \"scam\" because of the monstrous extra hardware, but hey that's how the SNES did it and no-one gives that grief.",
      "score": 37,
      "created_utc": 1745927689.0,
      "replies": [
        {
          "id": "mpndgds",
          "author": "flcinusa",
          "body": "This video of Norman Cooks home setup where he produced You've Come A Long Way Baby using C-Lab Creator on an Atari ST that was already pretty old by 1998 standards is mind-blowing \n\nhttps://www.youtube.com/watch?v=qLjgXPDzeZo",
          "score": 16,
          "created_utc": 1745930040.0,
          "replies": []
        },
        {
          "id": "mpnfcz5",
          "author": "hypothetician",
          "body": "I used to feel bad for the ST too. Went away when I got one, Amiga definitely deserved that win.",
          "score": 11,
          "created_utc": 1745930748.0,
          "replies": [
            {
              "id": "mpoxsgi",
              "author": "cobaltjacket",
              "body": "Bitter Amiga fan here. Some win. The Amiga won the battle but lost the war. Major Commodore marketing blunder.",
              "score": 6,
              "created_utc": 1745947279.0,
              "replies": [
                {
                  "id": "mpqs1ks",
                  "author": "speculatrix",
                  "body": "The Motorola 68060 processor was the last of its line. It was a thing of beauty.\n\nApple switched to PowerPC chips, then x86, and are now on Arm. A strange path, and one which involved CPU emulation, but they could afford to invest in that.\n\nCommodore failed to evolve, and also dropped the ball in failing to create new versions of the custom chip sets. Once PCs could support dedicated GPUs and sound cards, the Amiga line was too far behind to catch up. \n\nAs an owner of an A500 and A3000, and having written GUI programs for it, I feel sad because it's become a bit of a footnote in history. \n\nI also had multiple generation of palm pilot units, and those too are lost in history. And I had a few of the Nokia internet tablets. And Sharp Zauruses.\n\nSigh.",
                  "score": 4,
                  "created_utc": 1745966804.0,
                  "replies": [
                    {
                      "id": "mpsbhj5",
                      "author": "AkirIkasu",
                      "body": "For what it's worth, Amiga kinda-sorta followed into the PowerPC train after the fall of Commodore thanks to AmigaOS being ported to a number of PPC systems.",
                      "score": 1,
                      "created_utc": 1745986489.0,
                      "replies": []
                    },
                    {
                      "id": "mpta9oe",
                      "author": "WraithCadmus",
                      "body": "I've been trying to understand the timeline, one what-if that's rolling around in my head is what if the AAA had released with all features in 1991? I mean Commodore would probably have still messed it up, but I wonder if this \"Early 1200\" would have stood up better.",
                      "score": 1,
                      "created_utc": 1746006411.0,
                      "replies": []
                    },
                    {
                      "id": "mpyp5pd",
                      "author": "BigLan2",
                      "body": "I think they might be a US-centric view. In the UK the Amiga was the most popular home computer/console until the SNES launched (the Mega drive/Genesis was fairly popular too.) Lemmings, Sensible Soccer, Kick Off were huge in the early 90s.\n\n\n(Said as a kid who had an Atari ST.)\n\n\nThe Amiga could be argued to have paved the way for the Archimedes (the sequel to the BBC Model B), which led to ARM chips and their dominance today.",
                      "score": 1,
                      "created_utc": 1746071708.0,
                      "replies": [
                        {
                          "id": "mq00u30",
                          "author": "speculatrix",
                          "body": "when I was university, too many years ago to think about, a couple of friends bought A500s, and I quickly realised I just had to buy one for myself!\n\nGot the RAM pack and second floppy drive immediately, and then later bought a hard drive, a whopping 30MB! I recall being stunned by it, compared to the eight bit machines with monochrome character/console displays I previously had. I made an ADC, and a midi interface, and was pretty smug about it compared to the Atari owners!",
                          "score": 1,
                          "created_utc": 1746098489.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mpsc0ed",
          "author": "AkirIkasu",
          "body": "It's weird that that that feature was all it took to get musicians on board with it. MIDI was basically just serial, and in many cases computer MIDI interfaces were just passive adaptors that attached to the computer's serial port and weren't terribly expensive because of that.",
          "score": 2,
          "created_utc": 1745986725.0,
          "replies": []
        },
        {
          "id": "mpsfzii",
          "author": "ga-co",
          "body": "Wait until you hear what happened with the Atari 7800.",
          "score": 1,
          "created_utc": 1745988544.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpn9n5e",
      "author": "Oiggamed",
      "body": "I had this!  Bought it with money I saved up working my after school job. I bought it mostly for the MIDI interface.  MIDI was brand new and this was the only computer that had it built right in. I may even still have it in my parent’s basement.",
      "score": 13,
      "created_utc": 1745928564.0,
      "replies": [
        {
          "id": "mpnghps",
          "author": "ledow",
          "body": "The ZX Spectrum 128 / +2 / +3 had MIDI ports around the same time, and you could get MIDI addons for the 48K.\n\nIt even features in a famous music video and was used for productions but I'll be damned if I can remember which one.\n\nBut certain things fill certain niches better than others, even if they're not the first or the best for that.  It's why I still constantly hear that people \"have to have\" Apple computers for photoshop or video editing.  Because at one point, people believed that that machine fitted that niche better, but there's no reason for that to be true any more (or, personally, I would say \"ever\").",
          "score": 2,
          "created_utc": 1745931156.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpoqbo0",
      "author": "petethefreeze",
      "body": "I had the 520ST. Great machine and my first personal computer. It had some truly fantastic games.",
      "score": 5,
      "created_utc": 1745945167.0,
      "replies": []
    },
    {
      "id": "mpnnlan",
      "author": "ChafterMies",
      "body": "I remember playing a 3-D game on Commodore 64 that was literally several seconds per frame. Astounding technology at the time. Incredibly frustrating to play.",
      "score": 5,
      "created_utc": 1745933603.0,
      "replies": [
        {
          "id": "mpo8jhi",
          "author": "Squigglificated",
          "body": "The Sentinel?",
          "score": 3,
          "created_utc": 1745939971.0,
          "replies": [
            {
              "id": "mpobrtf",
              "author": "ChafterMies",
              "body": "It was this game, called “Space Station Oblivion” in the U.S.: https://www.lemon64.com/review/driller/1302",
              "score": 2,
              "created_utc": 1745940899.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mposkk1",
      "author": "_northernlights_",
      "body": "A cousin of mine had that Atari ST, damn I loved it, it was much better than our Amstrad CPC 6128. We played so much Populous on it.",
      "score": 3,
      "created_utc": 1745945801.0,
      "replies": []
    },
    {
      "id": "mpq55it",
      "author": "HotspurCOYSusa",
      "body": "Dungeon Master on the Atari ST was my first crawler. Great game!!",
      "score": 3,
      "created_utc": 1745959659.0,
      "replies": []
    },
    {
      "id": "mpp99go",
      "author": "MonkeySafari79",
      "body": "Ah yeah, my first computer. Should have learned some computing, played Monkey Island and Indiana Jones instead.",
      "score": 2,
      "created_utc": 1745950495.0,
      "replies": []
    },
    {
      "id": "mpqhu71",
      "author": "bamboob",
      "body": "I wanna see it, but I'm not gonna hit up any links to X. I'd feel the same way if it were a link to Stormfront",
      "score": 3,
      "created_utc": 1745963461.0,
      "replies": []
    },
    {
      "id": "mpp2gnv",
      "author": "None",
      "body": "My first ever PC was an ST! Great memories from it. Fun games.",
      "score": 1,
      "created_utc": 1745948574.0,
      "replies": [
        {
          "id": "mpqk3hr",
          "author": "Fyfaenerremulig",
          "body": "Gotta be pedantic here, the ST is not a pc",
          "score": 0,
          "created_utc": 1745964182.0,
          "replies": [
            {
              "id": "mpqxxfy",
              "author": "None",
              "body": "BOOOOOOOO! I literally said to myself “I know it’s not a pc but I don’t care”, so well done. The best part about this system was when my Dad was upgrading it with some 3rd party hardware, but it didn’t fit properly so he just sawed a few mm off, and it worked!\n\nMidnight Resistance’s was the best game ever. I think there was also a game about a clown and a red ballon. And the Simpsons. Fuck what a cool system",
              "score": 1,
              "created_utc": 1745968747.0,
              "replies": [
                {
                  "id": "mpsqdj8",
                  "author": "Fyfaenerremulig",
                  "body": "A buddy of mine had an ST and i was amazed at the resolution of the screen. I dont recall quite what the resolution was, but it was very sharp. His dad used it to produce music so they had lots of audio equipment connected to it. Hell yeah it was a cool system.\n\nI remember he used to rave on about the Atari Falcon, which apparently was even cooler.",
                  "score": 2,
                  "created_utc": 1745993965.0,
                  "replies": [
                    {
                      "id": "mqhza2b",
                      "author": "TenMinJoe",
                      "body": "You could plug it into a monitor, rather than just a television. If you bought a monochrome monitor it could drive it at 640x400, which did look amazingly sharp by contemporary standards.",
                      "score": 1,
                      "created_utc": 1746341891.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpr33mu",
              "author": "wysiwywg",
              "body": "Come on.. give the guy a break: he wanted a PC and got one…",
              "score": 1,
              "created_utc": 1745970473.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mpoxk96",
      "author": "cobaltjacket",
      "body": "Doom was developed on NeXTs with 25MHz 68030s. It's not that much of a stretch that some optimization would get it to run on 8MHz 68000s, especially since the Atari ST has some level of hardware coprocessors.",
      "score": 1,
      "created_utc": 1745947216.0,
      "replies": [
        {
          "id": "mpsddj3",
          "author": "AkirIkasu",
          "body": "It really is very much a stretch. Not only are we talking 1/3rd the clock speed, the 030 offered between 60-100% faster performance at the same clock speed. And on top of that, the NeXT computer had an additional FPU and DSP.\n\nThis was a real accomplishment!",
          "score": 1,
          "created_utc": 1745987334.0,
          "replies": [
            {
              "id": "mqhrpwm",
              "author": "_WhatchaDoin_",
              "body": "Plus the pixel format was shit on the ST. 16 bits for bit 0 of 16 pixels. Then 16 bits for bit 1 of the same 16 pixels. Same for bit 2 and 3. Then back to bit 0 of the next 16 pixels. Etc. Just writing the proper pixels on the screen was very inefficient.",
              "score": 2,
              "created_utc": 1746337543.0,
              "replies": []
            },
            {
              "id": "mptf2lz",
              "author": "None",
              "body": "[deleted]",
              "score": 0,
              "created_utc": 1746009188.0,
              "replies": [
                {
                  "id": "mr3b2fs",
                  "author": "Scheeseman99",
                  "body": "Doom didn't run on 286s, it required a 32 bit processor. Given that, your 100% confidence doesn't mean that much.\n\nThe game barely ran on 386. Framerates hover in the teens even with the resolution halved and the window size scaled down and that's at 40mhz. In addition, part of what allowed Doom to run as fast as it did was fast blitting by taking advantage of VGA. No dice on the ST, where blitting is excruciatingly slow.",
                  "score": 0,
                  "created_utc": 1746635844.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}