{
  "post": {
    "title": "Switch 2 joysticks won’t use Hall effect sensors to avoid stick drift | But Nintendo promises \"redesigned\" Joy-Cons are \"smoother\" and \"more reliable.\"",
    "author": "chrisdh79",
    "id": "1jtozpr",
    "score": 1627,
    "created_utc": 1744042100.0,
    "selftext": "",
    "num_comments": 282,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jtozpr/switch_2_joysticks_wont_use_hall_effect_sensors/"
  },
  "comments": [
    {
      "id": "mlw30yq",
      "author": "arthurdentstowels",
      "body": "Trust me bro, this is driftless plastic 👍",
      "score": 1205,
      "created_utc": 1744045165.0,
      "replies": [
        {
          "id": "mlw9jkg",
          "author": "None",
          "body": "[deleted]",
          "score": 308,
          "created_utc": 1744047132.0,
          "replies": [
            {
              "id": "mlwtjav",
              "author": "cm_bush",
              "body": "This is something that gets lost in the marketing for Hall-Effect sticks; this really wasn’t a widespread problem until the last 10-15 years. This means that better sticks can be made, but they just aren’t (while prices for controllers have steadily increased).\n\nIt’s cool tech (I have a hall-effect keyboard and it’s over 40 years old) but it looks like too many people are buying into the marketing hype and thinking that Hall-Effect is the only superior solution.",
              "score": 233,
              "created_utc": 1744053201.0,
              "replies": [
                {
                  "id": "mlxi0lu",
                  "author": "itishowitisanditbad",
                  "body": "Its called shit sensitivity and deadzone being wide af. \n\nHall-effect IS a superior solution. Its probably not the *only* one but its a very simple one at minimal cost that *does* solve the issue. \n\nFeel free to go use a much older controller. A lot of them were basically just a set of on/off buttons by comparison... if not literally. \n\nThats the difference.\n\nAs sticks got more sensitive, it exposes the downside of the tech being used. Deadzones are tiny and tiny drifts start existing.",
                  "score": 130,
                  "created_utc": 1744060850.0,
                  "replies": [
                    {
                      "id": "mlzlvc7",
                      "author": "None",
                      "body": "The ps2 had a feature where it would constantly re zero the joystick after returning to center to counter drift they removed it since they made less on new controllers",
                      "score": 40,
                      "created_utc": 1744089912.0,
                      "replies": []
                    },
                    {
                      "id": "mlxto0x",
                      "author": "synkronize",
                      "body": "Cool, the average gamer who just wants to play some games when they get home won’t be able to tell the difference",
                      "score": -64,
                      "created_utc": 1744064760.0,
                      "replies": [
                        {
                          "id": "mlyd7e5",
                          "author": "itishowitisanditbad",
                          "body": "Um... ok.\n\nThe average gamer, I suppose, can just go buy the cheapest 3rd party stuff they can find and it'll deliver that then...",
                          "score": 24,
                          "created_utc": 1744071591.0,
                          "replies": [
                            {
                              "id": "mlyo159",
                              "author": "synkronize",
                              "body": "If they want but your kidding yourself if people outside of Reddit know what Hall Effect  even is im just speaking the truths sorry if it sounded smug",
                              "score": -26,
                              "created_utc": 1744075552.0,
                              "replies": [
                                {
                                  "id": "mlyt2rh",
                                  "author": "itishowitisanditbad",
                                  "body": "Nobody was talking about if people know what it is.\n\nYou seem to be on a completely different point.",
                                  "score": 14,
                                  "created_utc": 1744077385.0,
                                  "replies": [
                                    {
                                      "id": "mlyvvi4",
                                      "author": "silentcrs",
                                      "body": "The reality is that stick drift is not really a problem for the vast majority of people who play video games. Most people don’t play constantly, so they don’t damage the mechanisms from excessive wear and tear.\n\nLike most fandoms, the most hardcore tend to complain the most LOUDLY. I’ve been using analog controls for decades and never run into stick drift. Neither have my friends. \n\nI would consider myself a mid to high level gamer. I buy every console and multiple first party controllers for each. I switch controllers from time to time and treat them with respect (no excessive grinding the sticks, no shaking the controller and definitely no throwing it). If people treated their controllers like they did their phone, they’d last longer.",
                                      "score": -15,
                                      "created_utc": 1744078412.0,
                                      "replies": [
                                        {
                                          "id": "mlyz5v2",
                                          "author": "itishowitisanditbad",
                                          "body": "I've had 3 360 controllers get drift, plus 2 joycons. \n\nAll treated much nicer than my phone.\n\nNo excessive grinding, no shaking (well, joycon is a bit special on that one, right?) etc \n\nYou can just google and see how prevalent the issue is for some controllers.\n\nTo flatly deny it and put the entire blame on the users being too rough with them, entirely... is just obtuse. \n\nIts straight up head in the sand victim blaming really. \n\nIts literally a known issue. Its literally a drawback of the design. \n\nYou're denying reality. \n\nSo... ok?",
                                          "score": 10,
                                          "created_utc": 1744079657.0,
                                          "replies": [
                                            {
                                              "id": "mlz69ql",
                                              "author": "silentcrs",
                                              "body": "Every article I’ve read on stick drift on the internet cites statistics from questionable sources. Kotaku claimed, without a source, that “thousands” of joycons were sent to Nintendo every week for repair. Another article said 40% of all Switch users experienced stick drift, but if you looked at the source, it was a self-reported survey site. Of course people are going to complain they have a problem. It’s not a representative sample.\n\nThe fact is, again, we’re relying on secondhand data instead of the companies themselves. If there were significant replacements of hardware, publicly traded companies like Microsoft and Nintendo would have to report it because it would eat into revenue. \n\nIn fact, Microsoft did report issues with the 360… console. The red ring of death caused a $1B write up on their financials. They had to report it during an investor’s call (https://www.computerworld.com/article/1579132/xbox-360-red-ring-of-death-costs-microsoft-more-than-1b.html).\n\nLook, I’m not saying stick drift doesn’t exist. It does. But if you ever look at people posting about it, it’s clear that a good chunk of the time (not always, but a good chunk) they have been beating up their controllers pretty badly. I’ve seen “my stick is drifting” pictures on Reddit with broken bumpers. Cracked chassis. Peeling grips. Further, I’ve seen pictures posted in front of what looks like a pigsty. Dirty carpets. Consoles shoved into areas with no ventilation. Visible dust. Hardcore gamers aren’t known to be the most, uh… I’ll just say “rational” and “clean” people. Go to any convention and you’ll see this. The fact that they wig out at the slightest provocation and don’t treat their own bodies with respect doesn’t surprise me when they post pictures of busted controllers.\n\nIn any case, I digress. Tl;dr: drift exists, but it’s not nearly the problem hardcore gamers online make it out to be. If it was, it would show up in company’s financial statements.",
                                              "score": -6,
                                              "created_utc": 1744082472.0,
                                              "replies": [
                                                {
                                                  "id": "mm26nc5",
                                                  "author": "synkronize",
                                                  "body": "My favorite thing about Reddit is you making a sound argument and providing data. But you still get downvotes from people who rather hide your reply without explaining why they downvoted.\n\nTbh I think upvotes/ downvotes / likes are awful for social media in general",
                                                  "score": 1,
                                                  "created_utc": 1744130567.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "mlzknjp",
                                          "author": "NorthCascadia",
                                          "body": "Not using a controller causes more drift than overusing one. Dust is a Joycon killer.",
                                          "score": 1,
                                          "created_utc": 1744089258.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mlyvhgx",
                                  "author": "mehemynx",
                                  "body": "Ever since the craze of hall effect, 3 mates, who are gearheads, went into the hall effect hype. These things have a knock-on effect, especially when every company is putting it in their marketing",
                                  "score": 2,
                                  "created_utc": 1744078269.0,
                                  "replies": []
                                },
                                {
                                  "id": "mm2iw3z",
                                  "author": "mondo445",
                                  "body": "I’m surprised anyone here knows what Hall effect is.  To learn it has applications in gaming controllers is a dual shock.",
                                  "score": 1,
                                  "created_utc": 1744134062.0,
                                  "replies": []
                                },
                                {
                                  "id": "mlytb0k",
                                  "author": "CosmicCreeperz",
                                  "body": "MANY PC gamers do since it’s been an advertising point in controllers and joysticks for a while.\n\nNot to mention I just looked on Google and there are DOZENS of random game sites that picked up this exact topic today.\n\nIt’s crazy how many “average” gamers are now into what were fairly fringe things a decade ago - water cooled LED-laden PCs, arcade emulators, “gaming” chairs…",
                                  "score": 1,
                                  "created_utc": 1744077468.0,
                                  "replies": [
                                    {
                                      "id": "mlz9tmp",
                                      "author": "synkronize",
                                      "body": "I still don’t think those are average gamers but if you say so I believe you, you’ve done more research than me 👍🏿",
                                      "score": 0,
                                      "created_utc": 1744083985.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mlxf4xs",
                  "author": "XuX24",
                  "body": "The old ones didn't drift because they would just straight up sag, I remember how n64 controllers used to just loose all tension.",
                  "score": 49,
                  "created_utc": 1744059915.0,
                  "replies": [
                    {
                      "id": "mly6koo",
                      "author": "LBPPlayer7",
                      "body": "n64 controllers aren't a good comparison as those literally grind themselves to dust from being pure plastic with no lubrication",
                      "score": 48,
                      "created_utc": 1744069209.0,
                      "replies": [
                        {
                          "id": "mlzexys",
                          "author": "DckThik",
                          "body": "I should call her",
                          "score": 23,
                          "created_utc": 1744086344.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mlyd9c0",
                      "author": "Christopher135MPS",
                      "body": "MarioParty was *very* bad for the poor n64 joystick 😂😂😂",
                      "score": 14,
                      "created_utc": 1744071611.0,
                      "replies": [
                        {
                          "id": "mlz2wqd",
                          "author": "richards_86",
                          "body": "I’m surprised my palm is not scarred from the multiple blisters I gave myself from sleepover after sleepover of all night Mario Party.",
                          "score": 4,
                          "created_utc": 1744081123.0,
                          "replies": [
                            {
                              "id": "mm0xn2j",
                              "author": "None",
                              "body": "That damn palm on the stick spin. Yep.",
                              "score": 1,
                              "created_utc": 1744116380.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mlyg0bu",
                          "author": "XuX24",
                          "body": "Dude that and fighting games killed controllers.",
                          "score": 1,
                          "created_utc": 1744072620.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mlx06zg",
                  "author": "nullKomplex",
                  "body": "I'm not the most well versed on the topic, but every controller type I've owned from dreamcast to N64 to xbox 360 has had stick drift. The only difference with the earlier consoles was that their deadzones were massive and it wasn't really a problem.",
                  "score": 29,
                  "created_utc": 1744055276.0,
                  "replies": [
                    {
                      "id": "mlxjfnj",
                      "author": "linuxcorn",
                      "body": "The Dreamcast used hall effect stick. The joystick was just wiggly.",
                      "score": 23,
                      "created_utc": 1744061313.0,
                      "replies": [
                        {
                          "id": "mlxu97f",
                          "author": "nullKomplex",
                          "body": "Fair enough. As I said, not well versed enough!",
                          "score": 2,
                          "created_utc": 1744064966.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mm340by",
                      "author": "nipsen",
                      "body": "It's a kind of interesting topic, because a lot of different gamepads were made with some seriously overblown and much more expensive parts than was actually needed (as in, they'd be priced at 1 dollar a ton, rather than 1 cent, that sort of thing). The ds3, for example, came with a lithium polymer battery (unusual for the time, but means that they are still going to work today..), a rubber in the thumbstick that wouldn't sweat and deteriorate to an unusable level, very small deadzone, analog pressure on the facepad buttons (like.. who does that?) and an onboard logic that an engineer at Sony spent an hour waxing poetically about that would allow all kinds of simplifications for assuring input ranges and deadzone adjustment, and so on. Sixaxis was cool, I thought.. which I apparently was alone in XD\n\nSony would not build that pad today, of course. They want to just earn as much money as possible on only exploiting their fans and market share, like everyone else. But it was and is possible to build something that actually works, doesn't fall off the usability scale over time, and that doesn't actually cost significantly more.",
                      "score": 6,
                      "created_utc": 1744140190.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mlxm6al",
                  "author": "deadgirlrevvy",
                  "body": "Hall effect IS superior in every way.  It's unacceptable in 2025 to offer a joystick that isn't hall effect.  It's just a cheap and slimy way to make another 15 cent (hall effect tech is really inexpensive now and the price difference between that and POT based ones is negligible) - it's not a good look for a $500 console.",
                  "score": 16,
                  "created_utc": 1744062215.0,
                  "replies": [
                    {
                      "id": "mlxzpno",
                      "author": "SteveCastGames",
                      "body": "It’s not that simple. Think about the use case here. They drain more battery and they’re going into little detachable controllers. Controllers that attach with *magnets*. There’s a real potential for interference there.",
                      "score": 11,
                      "created_utc": 1744066841.0,
                      "replies": [
                        {
                          "id": "mlybhvy",
                          "author": "fuj1n",
                          "body": "Power is not really a problem as they could've gone for TMR tech instead of hall effect to solve that, interference, I guess we'll see when the console is out and people start modding.",
                          "score": 7,
                          "created_utc": 1744070969.0,
                          "replies": []
                        },
                        {
                          "id": "mm2y2lq",
                          "author": "deadgirlrevvy",
                          "body": "Not as much as you think.  Hall effect sensors have an extremely tiny field detection radius.  The magnetic attachment isn't an issue and neither is the power requirement which again, is very very low.",
                          "score": 2,
                          "created_utc": 1744138415.0,
                          "replies": []
                        },
                        {
                          "id": "mn9nxcf",
                          "author": "zeknife",
                          "body": "It would not be a significant complication to adjust for a known static magnetic field. Literally just calibrate the sticks.",
                          "score": 0,
                          "created_utc": 1744738607.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mlztfuk",
                      "author": "hjake123",
                      "body": "I'm sure they tried it, found that the magnets caused too much interference, and went with a different design.",
                      "score": -1,
                      "created_utc": 1744094156.0,
                      "replies": [
                        {
                          "id": "mm2yx6k",
                          "author": "deadgirlrevvy",
                          "body": "Doubtful.  The magnets in hall sensors are uber tiny.  They don't cause interference in any of my radio transmitters for RC drones or cars, so that shouldn't be an issue whatsoever.   Hall sensors also take very little power to run them.  It's HIGHLY likely that Nintendo didn't use them solely due to the additional cost (which is pretty negligible) and the fact that if they used hall effect, nobody would need 10 sets of replacement controllers in 6 months time (because hall sensors never wear out).  For them it's a win-win, for everyone else it's additional cost and frustration.",
                          "score": 0,
                          "created_utc": 1744138666.0,
                          "replies": [
                            {
                              "id": "mm2zpon",
                              "author": "hjake123",
                              "body": "No, I mean the controllers are mounted with \"powerful\" magnets that they spend most of their time right next to. Depending on the strength of those magnets, hall effect sensors might be interfered with.\n\nOf course, I don't actually know that. Maybe it's as cynical as you think. But we don't have to assume every decision is always for the worst imaginable reason",
                              "score": 6,
                              "created_utc": 1744138902.0,
                              "replies": [
                                {
                                  "id": "mm39y7r",
                                  "author": "deadgirlrevvy",
                                  "body": "\"But we don't have to assume every decision is always for the worst imaginable reason\"\n\nWe do with Ninty.  We literally have decades of precedent to refer back to.  Look how bad their controllers have been since the N64.  You'd think they'd have learned by now, unless there was an ulterior motive - and that motive comes down to selling replacement controllers.  The profit margin on controllers is obscene compared to the console.  Where it costs 270 bucks or more to make a 300 dollar console, it costs around $3 to make a $60 set of joycons.  You only make $30 on the console, but for every joycon you make $57.  You come out better selling joycons than you do consoles at that point.  It makes perfect sense if you're a sociopath (e.g. any given corporation).\n\nAs far as the magnets are concerned, those wouldn't have made any difference whatsoever to a hall effect sensor.  The strong part of magnetic fields are actually much smaller than people think and it's trivial to calibrate the hall effect sensors to compensate.  Component and board level electronics is what I studied in college.  Trust me on this, it's trivial to work around such things.  There's no technological reason not to have hall effect.  It's all a financial/profit based decision on their part.\n\nNo, the most likely reason is the tiny added cost and the constant revenue stream of replacement controllers.  Do you know how much Ninty made from replacement joycons on the Switch?  TENS OF MILLIONS...all because they didn't use hall effect joysticks (in other words controllers that wear out fast).  Do you honestly think they would do anything to endanger that steady revenue stream?  Absolutely not.  Especially not if it also increased their margin on consale sales by any amount at all.",
                                  "score": 0,
                                  "created_utc": 1744141940.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlwbgrd",
              "author": "i4ndy",
              "body": "Yeah my ps3 controllers other than the battery still works perfectly well… the worst thing is the lubricant drying up",
              "score": 30,
              "created_utc": 1744047697.0,
              "replies": [
                {
                  "id": "mlweg21",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 5,
                  "created_utc": 1744048576.0,
                  "replies": [
                    {
                      "id": "mlwl5t0",
                      "author": "AlekBalderdash",
                      "body": "Rubbers and plastics are made from oil.\n\nWhen they degrade they often turn oily and sticky and gross.\n\nI've found old mice and handheld radios where the rubber buttons & grips turned to goo after sitting in a box for 15-20 years",
                      "score": 20,
                      "created_utc": 1744050618.0,
                      "replies": [
                        {
                          "id": "mlwrjhp",
                          "author": "I_Automate",
                          "body": "Only specific plastics and rubbers will degrade like that.\n\nButyl rubber is probably the worst offender and it's one that is/ was commonly used as the \"soft\" part in multi-shot injection molded products like screwdriver handles and whatnot.\n\nBonus points because it smells like puke as it degrades due to one of the chemicals released",
                          "score": 9,
                          "created_utc": 1744052575.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mlwgmp4",
                      "author": "QuirkyBus3511",
                      "body": "Wtf were doing with that thing",
                      "score": 5,
                      "created_utc": 1744049233.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlxk72n",
              "author": "rpkarma",
              "body": "I had drift with bith Xbox 360 and Xbox One controllers. GameCube, N64 too.",
              "score": 7,
              "created_utc": 1744061563.0,
              "replies": []
            },
            {
              "id": "mlx0ajl",
              "author": "ChrisFromIT",
              "body": ">I know for a fact they can make non Hall effect sticks that don’t drift so… is it possible this time around?\n\nYes. Last time, I believe it happened because a piece of plastic got worn down. A stronger plastic or changing the design so that the plastic doesn't get worn down could do better.",
              "score": 8,
              "created_utc": 1744055306.0,
              "replies": []
            },
            {
              "id": "mlyfq6i",
              "author": "picardo85",
              "body": "Literally all my Xbox 360 controllers have stick drift.",
              "score": 7,
              "created_utc": 1744072518.0,
              "replies": []
            },
            {
              "id": "mlwnqjs",
              "author": "funforgiven",
              "body": "My Xbox 360 controllers definitely drift.",
              "score": 18,
              "created_utc": 1744051415.0,
              "replies": []
            },
            {
              "id": "mlws87q",
              "author": "BentTire",
              "body": "There is also other tech that utilizes magnets other than Hall Effect.\n\nSo, while Hall Effect is out of the question, that does not mean that magnetic based tech is completely out of the question.\n\nBut we will have to see once we can actually teardown the Joycon 2",
              "score": 5,
              "created_utc": 1744052790.0,
              "replies": [
                {
                  "id": "mlwxy30",
                  "author": "andynator1000",
                  "body": "> There is also other tech that utilizes magnets other than Hall Effect.\n\nSuch as?",
                  "score": 2,
                  "created_utc": 1744054581.0,
                  "replies": [
                    {
                      "id": "mlx6hdn",
                      "author": "BentTire",
                      "body": "[Tunnel magnetoresistance](https://en.wikipedia.org/wiki/Tunnel_magnetoresistance) aka TMR.\n\nIt is a pretty new tech, but you can already buy TMR joysticks.",
                      "score": 10,
                      "created_utc": 1744057224.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlwcrt8",
              "author": "MimeTravler",
              "body": "My official xbox 360 controllers eventually did get stick drift but it wasn’t even that bad and I kept using them even after the Xbox One came out. It took like 12 years for it to be bad enough for me to replace them.",
              "score": 8,
              "created_utc": 1744048083.0,
              "replies": []
            },
            {
              "id": "mlxh07h",
              "author": "Upbeat-Freedom8762",
              "body": "Anectodal evidence.. there is physical grinding you will get drift no matter what eventually.Post me a ss of that controller on gamepadtester with it being sub 1 dz and ill accept lol. Also why would you replace it if there was “no stick drift” when the thumb-stick, which is very easily changeable, was the problem and not the analog module ? Fishy ^^",
              "score": 5,
              "created_utc": 1744060521.0,
              "replies": [
                {
                  "id": "mlxiu5a",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -1,
                  "created_utc": 1744061117.0,
                  "replies": [
                    {
                      "id": "mlyiwgt",
                      "author": "Upbeat-Freedom8762",
                      "body": "You have miss understood what i wrote lol, your answer makes no sense ^^\n\nIdc xbox360/one or wtv.\nIf its a potentiometer analog module, you will get stick drift eventually, there is no escaping that.\n\nIdk why you posted your 1-7 list, its totally unrelated lol.\n\nAlso i was modifying my xbox 360 to make scuf controllers before those were even out on the market. Point being, all you need is a torx8 screwdriver and thats it. You remove the face plate, remove your thumbstick and pit a new one.",
                      "score": 2,
                      "created_utc": 1744073670.0,
                      "replies": [
                        {
                          "id": "mlymlwc",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -3,
                          "created_utc": 1744075036.0,
                          "replies": [
                            {
                              "id": "mlz03qo",
                              "author": "Upbeat-Freedom8762",
                              "body": "Your missing the point. the point is you said your controller has no stickdrift after 11 years, to which i said is impossible due to physical grinding. Post proof or lies. You then said (contradicting yourself in the process) that you still had that controller, while simultaneously saying you replaced it because the thumbstick was worn off ? I then said, why would you (maybe i shouldve said why would someone), i obviously wasnt asking a question here) replace their whole controller with, according to you, perfect condition analog modules when you could get a torxt8 screwdriver and 5$ amazon thumbsticks and swap them yourself, a new xbox one controller ?",
                              "score": 1,
                              "created_utc": 1744080018.0,
                              "replies": [
                                {
                                  "id": "mlz0fxp",
                                  "author": "Upbeat-Freedom8762",
                                  "body": "Reading your reply again, maybe you don’t know the difference between the analogue module and the thumbstick? I got you ! The analog module is the little metal cube looking thing on which your plastic thumbstick lies on. Thats the little thing you put your thumb on to move/look around in most games !\n\nReplacing the module is tedious, i can agree having done it in the past. Changing your thumbstick on the other hand, is a childs play",
                                  "score": 1,
                                  "created_utc": 1744080148.0,
                                  "replies": []
                                },
                                {
                                  "id": "mlz32q5",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": -5,
                                  "created_utc": 1744081190.0,
                                  "replies": [
                                    {
                                      "id": "mlz3chm",
                                      "author": "Upbeat-Freedom8762",
                                      "body": "Woah i struck a nerve it seems. Not looking forward a discussion with someone who revolves to insults when caught bullshitting. Calling me a numbskull, oh the irony. Anyways cya kid",
                                      "score": 6,
                                      "created_utc": 1744081299.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlyw59w",
              "author": "Waffleskater8",
              "body": "Yeah, dead ass had  gotten more stick drift on more dualsense controllers in the first year of having it than I got stick drift on ps3 controllers from launch until around 2016-17ish.",
              "score": 1,
              "created_utc": 1744078514.0,
              "replies": [
                {
                  "id": "mlyy3mm",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1744079251.0,
                  "replies": [
                    {
                      "id": "mlyymk8",
                      "author": "Waffleskater8",
                      "body": "Yeah, I can honestly say I’ve never had a problem with any controllers EVER. Even as a kid, wasn’t one of those kids who broke his stuff. Hell my cousin broke more of my controllers than I’ve ever broken(dropped one on hard floor and it broke) . But I’ve had like 4 or 5 ps5 controllers get stuck drift. Granted they were all the early ones. But still.",
                      "score": 2,
                      "created_utc": 1744079451.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlz5iel",
              "author": "mickelboy182",
              "body": "No drift with your 360 controllers? Consider yourself very lucky.",
              "score": 1,
              "created_utc": 1744082165.0,
              "replies": []
            },
            {
              "id": "mm09nxi",
              "author": "Randommaggy",
              "body": "I've had stick drift on 1 360 controller, 1 PS3 Controller, 1 Switch Pro Controller and 2 Xbox One controllers.  \nI have not had stick drift on cheap-shit controllers from ali express with the tiniest dead zone I've ever experienced even though I'm quite rouugh on them when playing Hades and similarly hectic games.  \nConclusion: Nintendo is giving it's customer base the one finger sallute.",
              "score": 1,
              "created_utc": 1744104634.0,
              "replies": []
            },
            {
              "id": "mm0du7w",
              "author": "blaskkaffe",
              "body": "That is because it was common to have 10-15% deadzone.\nSticks usually had a 2-3% drift in the middle from factory, but it was compensated with a minimum threshold.\n\nModern controllers have much higher precision and often no deadzone at all.\n\nAny wear on a modern stick is noticable but ont old ones they had bigger margins.",
              "score": 1,
              "created_utc": 1744107213.0,
              "replies": []
            },
            {
              "id": "mm0rhu7",
              "author": "HannahOnTop",
              "body": "It took me over 10 years for my Xbox 360 controllers to get stick drift with them being used daily.\n\nNow my controllers for my PS5 last about 2 years before getting drift.",
              "score": 1,
              "created_utc": 1744113921.0,
              "replies": []
            },
            {
              "id": "mm0vdd9",
              "author": "Kiwithegaylord",
              "body": "I’ve experienced some very very minor drift with some 360 controllers but it’s not noticeable during gameplay or the menus",
              "score": 1,
              "created_utc": 1744115506.0,
              "replies": []
            },
            {
              "id": "mm4qqrs",
              "author": "dat_w",
              "body": "i bought an XB1 controller in 2017 or so and it's still going strong, hundreds of hours into FIFA and some MK and racing games here and there",
              "score": 1,
              "created_utc": 1744158753.0,
              "replies": []
            },
            {
              "id": "mm5vlyj",
              "author": "StrayDemon-13",
              "body": "Early PS3 controllers have hall effect sticks, they only switched to cheap potentiometers when they redesigned the console.",
              "score": 1,
              "created_utc": 1744174710.0,
              "replies": []
            },
            {
              "id": "mm6hddf",
              "author": "Curse3242",
              "body": "You were lucky I have 4 PS3 controllers & every single one got stick drift. Although one of them keeps working to this day after some cleaning & compressed air techniques. Although has the issue constantly",
              "score": 1,
              "created_utc": 1744187685.0,
              "replies": []
            },
            {
              "id": "mma1b35",
              "author": "LThadeu",
              "body": "The expensive xbox elite controller (the one you can swtich buttons and what not) has a different type of stick connector thing that never develops drift.\nThey could just put the same in the basic series x version, but instead go for the cheaper one.\nIt's planned obsolescence.",
              "score": 1,
              "created_utc": 1744232034.0,
              "replies": []
            },
            {
              "id": "mly6et8",
              "author": "LBPPlayer7",
              "body": "this\n\nonly stick drift issues people had with those controllers was the stick physically getting worn out to the point of being physically loose enough to no longer stay centered",
              "score": 1,
              "created_utc": 1744069151.0,
              "replies": []
            },
            {
              "id": "mlwdce5",
              "author": "0992673",
              "body": "Many DualShock 3 were hall effect, don't know where you got that from.",
              "score": -3,
              "created_utc": 1744048250.0,
              "replies": [
                {
                  "id": "mlwer0x",
                  "author": "Kamakaziturtle",
                  "body": "If they had an original DS3 controller, then they weren't Hal effect.",
                  "score": 15,
                  "created_utc": 1744048667.0,
                  "replies": [
                    {
                      "id": "mlwtasz",
                      "author": "Hillrop",
                      "body": "So the sixaxis?",
                      "score": 2,
                      "created_utc": 1744053128.0,
                      "replies": [
                        {
                          "id": "mlwv6d4",
                          "author": "Kamakaziturtle",
                          "body": "Wasn't sixaxis it's own thing?  I though DS3 replaced it",
                          "score": 2,
                          "created_utc": 1744053712.0,
                          "replies": [
                            {
                              "id": "mlwxci1",
                              "author": "ye_olde_green_eyes",
                              "body": "I think the first PS3 controllers were called sixaxis and were the same as the DS3 except they had no rumble. The DS3 has sixaxis motion sensing tech too. I don't think there was any difference in anything about the controllers beyond the lack of vibration.",
                              "score": 2,
                              "created_utc": 1744054392.0,
                              "replies": [
                                {
                                  "id": "mlx0xt5",
                                  "author": "scottiedog321",
                                  "body": "They were because of a lawsuit involving haptic feedback https://en.m.wikipedia.org/wiki/Sixaxis The DS3 controllers still have SIXAXIS marking on them, as well.",
                                  "score": 3,
                                  "created_utc": 1744055505.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mlz5t3p",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1744082284.0,
                      "replies": [
                        {
                          "id": "mlz8bxv",
                          "author": "Kamakaziturtle",
                          "body": "Potentiometer",
                          "score": 1,
                          "created_utc": 1744083343.0,
                          "replies": [
                            {
                              "id": "mlze5wu",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 1,
                              "created_utc": 1744085968.0,
                              "replies": [
                                {
                                  "id": "mlzhs61",
                                  "author": "Kamakaziturtle",
                                  "body": "Some are magnetic, some are resistive.  There’s multiple versions that have different designs.",
                                  "score": 1,
                                  "created_utc": 1744087759.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mlyvnjk",
                  "author": "nosurprisespls",
                  "body": "People that don't know anything keep downvoting you to keep themselves ignorant lol\n\n[https://youtu.be/bQlB6qkpJrE?t=222](https://youtu.be/bQlB6qkpJrE?t=222)",
                  "score": 1,
                  "created_utc": 1744078331.0,
                  "replies": [
                    {
                      "id": "mn33kiz",
                      "author": "0992673",
                      "body": "I know, right, lol. I have 3 DS3 in front of me and 2 of them are hall effect and one is standard potentiometer type, guess which one has drift (it's the standard one). I hoard them as they last forever on a single charge and work on PC with dshidmini.",
                      "score": 1,
                      "created_utc": 1744648492.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlwdk4y",
              "author": "TheHolyFamily",
              "body": "DS3s had hall effect tho",
              "score": 0,
              "created_utc": 1744048313.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlw98sx",
          "author": "FewHorror1019",
          "body": "The plastic wasnt even the issue",
          "score": 15,
          "created_utc": 1744047044.0,
          "replies": [
            {
              "id": "mlw9zwh",
              "author": "PashaB",
              "body": "Didn't the plastic gears wear down over time and cause drift? I got drift on my pro controller and disassembled it. I sprayed contact cleaner into the little joystick box with 2 plastic gears. It worked but I imagine they'll wear down eventually.",
              "score": 6,
              "created_utc": 1744047267.0,
              "replies": [
                {
                  "id": "mlwagch",
                  "author": "Henry-What",
                  "body": "Nah there's a little graphene sensor in the joycon that gets completely rubbed away from friction no matter what. That's where the drift will come from.",
                  "score": 39,
                  "created_utc": 1744047400.0,
                  "replies": [
                    {
                      "id": "mm2uc88",
                      "author": "PashaB",
                      "body": "Oh wow yeah that makes so much more sense. Why am I cleaning plastic gears with contact cleaner anyway. I see so it worked cuz it cleaned the graphene sensor. I was following directions without really thinking I guess I would use isopropyl to clean the gears if needed.",
                      "score": 1,
                      "created_utc": 1744137320.0,
                      "replies": [
                        {
                          "id": "mm2uvxm",
                          "author": "Henry-What",
                          "body": "Yeah, the simplest fix for the graphene sensor is to stuff cardboard under it so the sensors touch again.",
                          "score": 3,
                          "created_utc": 1744137478.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mlwahdb",
                  "author": "FewHorror1019",
                  "body": "Its the contact between the circuit and the sticks wearing out. Graphite and metal.",
                  "score": 8,
                  "created_utc": 1744047409.0,
                  "replies": []
                },
                {
                  "id": "mlwavfb",
                  "author": "soulsoda",
                  "body": "Yeah idk what they are on about, plastic degrading and leaving bits behind is almost always the issue with drift.",
                  "score": -7,
                  "created_utc": 1744047523.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mlwhx07",
              "author": "Suckage",
              "body": "Tell that to the turtles.",
              "score": 1,
              "created_utc": 1744049625.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlys6ve",
          "author": "prey169",
          "body": "Now... Money please !",
          "score": 2,
          "created_utc": 1744077066.0,
          "replies": []
        },
        {
          "id": "mmpnbcq",
          "author": "MarlonShakespeare2AD",
          "body": "So…\n\nGood for submersibles or not good for submersibles?",
          "score": 1,
          "created_utc": 1744453988.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlwafdf",
      "author": "cat_prophecy",
      "body": "Switch controllers are real pieces of shit for how much they cost. Even replacing the sticks is a pain because if you look at one of the ribbon cables wrong, it breaks inside.",
      "score": 147,
      "created_utc": 1744047392.0,
      "replies": [
        {
          "id": "mlylrv4",
          "author": "None",
          "body": "[removed]",
          "score": 31,
          "created_utc": 1744074730.0,
          "replies": [
            {
              "id": "mlzdc0h",
              "author": "RazingsIsNotHomeNow",
              "body": "No wonder I hated playing Mario Kart at my friend's. The whole point of triggers is that they are analog. Might as well make them bumpers if they are digital.",
              "score": 15,
              "created_utc": 1744085576.0,
              "replies": [
                {
                  "id": "mlzq8lo",
                  "author": "mediumcheese01",
                  "body": "Look I hate digital triggers but c'mon. You don't need analog throttle control in mariokart.",
                  "score": 45,
                  "created_utc": 1744092388.0,
                  "replies": []
                },
                {
                  "id": "mlzwtwx",
                  "author": "Mr_uhlus",
                  "body": "you can still analog throttle in MK8 by using the right stick",
                  "score": 1,
                  "created_utc": 1744096089.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mm7f41k",
          "author": "Dracekidjr",
          "body": "I didn't mind the ribbon cables, but the battery plug is designed to break. They fucking skeletonized the thin plastic.",
          "score": 1,
          "created_utc": 1744204168.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlvvp3n",
      "author": "ghrayfahx",
      "body": "Just when I thought I was out, \n\n\n\n\nThey push me further out.",
      "score": 439,
      "created_utc": 1744042913.0,
      "replies": [
        {
          "id": "mlw5hk9",
          "author": "DavidinCT",
          "body": "I hear that....",
          "score": 28,
          "created_utc": 1744045921.0,
          "replies": []
        },
        {
          "id": "mlxnhjb",
          "author": "PornstarVirgin",
          "body": "I used candycon for my switch, they have hall and are customizable",
          "score": 8,
          "created_utc": 1744062647.0,
          "replies": [
            {
              "id": "mlylv4k",
              "author": "rabidsalvation",
              "body": "Do they have gyro?",
              "score": 2,
              "created_utc": 1744074763.0,
              "replies": [
                {
                  "id": "mlyth5v",
                  "author": "PornstarVirgin",
                  "body": "Yeah, it’s basically designed as a switch controller but it also works on pc. I made mine look like pikachu because all buttons and triggers can be customized.",
                  "score": 3,
                  "created_utc": 1744077530.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm3t8o4",
              "author": "akeean",
              "body": "Flydigi Vader 4 Pro, works on PC, android & Switch, HAL sensors, 4 back buttons, triggers can be switched from analog to digital mode that have short travel, shoulder and trigger digital buttons, ABXY and D-Pad are microswitches, plus you get 2 more buttons under your right thumb joint that you can remap to any other button (i.e. press joystick in), change deadzones (I use 0 dead zone) and change sensitivity response of the sticks individually), profiles save on the gamepad, so you only need to set it up once on a PC and the software supports custom profiles.\n\nEven let's you change the joystick centering force per stick without tools (twist the ring around the base of the stick), and has gyro too. They also sell a charging station for it (to save life on the USB-C port, sticks with alternate stem length and a mount to attach your phone to it - very nice for Gamepass remote play.\n\nBy far the best gamepad I ever used.",
              "score": 0,
              "created_utc": 1744147488.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm16d7f",
          "author": "joostdemen",
          "body": "OH MADONE",
          "score": 2,
          "created_utc": 1744119510.0,
          "replies": []
        },
        {
          "id": "mlw8wr4",
          "author": "None",
          "body": "[deleted]",
          "score": -51,
          "created_utc": 1744046944.0,
          "replies": [
            {
              "id": "mlw9pix",
              "author": "ghrayfahx",
              "body": "Not really. I can do just like I’ve done with other systems that were insanely expensive and not worthwhile. Simply not buy them. Every day I’m happier and happier moving more and more into PC gaming, especially via things like the Steam Deck. Much more value in that system and the games actually go on sale vs costing now $80 for the lifetime of the system.",
              "score": 31,
              "created_utc": 1744047181.0,
              "replies": [
                {
                  "id": "mlwah87",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -33,
                  "created_utc": 1744047408.0,
                  "replies": [
                    {
                      "id": "mlwcx3p",
                      "author": "Photo-Gorilla",
                      "body": "That’s…exactly what they said they were going to do.  Not buy it.  Why can’t they voice their opinion on it?",
                      "score": 25,
                      "created_utc": 1744048127.0,
                      "replies": [
                        {
                          "id": "mlwe4no",
                          "author": "evangelism2",
                          "body": "No you dont understand. If nonexistentnvgtr likes something he only wants to see positive discussion around it.\n\nAlso I am pretty sure /u/Randy_Muffbuster was doing a Sopranos quote. \n\nhttps://www.youtube.com/watch?v=YSNpoIVMW7k",
                          "score": 15,
                          "created_utc": 1744048483.0,
                          "replies": [
                            {
                              "id": "mlwf93v",
                              "author": "ghrayfahx",
                              "body": "I never really watched so I didn’t catch the reference.",
                              "score": -1,
                              "created_utc": 1744048813.0,
                              "replies": []
                            },
                            {
                              "id": "mlxcxw8",
                              "author": "None",
                              "body": "[deleted]",
                              "score": -1,
                              "created_utc": 1744059216.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mlwdvqe",
                      "author": "KeyboardBerserker",
                      "body": "*clicks on reddit page about switch 2 specs*\n\n*complains people share opinions in comments*",
                      "score": 6,
                      "created_utc": 1744048410.0,
                      "replies": []
                    },
                    {
                      "id": "mlwgpi6",
                      "author": "codyzon2",
                      "body": "Then don't read it, seems kind of simple, more so don't respond to it. But here you are letting everybody know you let other people live in your head.",
                      "score": 1,
                      "created_utc": 1744049257.0,
                      "replies": []
                    },
                    {
                      "id": "mlwcce3",
                      "author": "Top5hottest",
                      "body": "Joy cons are the single worst designed video game equipment ever made.",
                      "score": 1,
                      "created_utc": 1744047957.0,
                      "replies": [
                        {
                          "id": "mlwd8r1",
                          "author": "Proletariat_Paul",
                          "body": "You say that like the Power Glove and Virtual Boy don't exist.",
                          "score": 3,
                          "created_utc": 1744048220.0,
                          "replies": [
                            {
                              "id": "mlwdzj4",
                              "author": "Sunny-Chameleon",
                              "body": "I was never a big fan of the original Wii remote either",
                              "score": 3,
                              "created_utc": 1744048441.0,
                              "replies": [
                                {
                                  "id": "mlwjlys",
                                  "author": "Moonlands",
                                  "body": "TBH the Wiimote at least was cool for aiming in video games.  Its probably the closest thing to being as good as a mouse without being a mouse.  But the lack of buttons and it being relatively small kills it a bit really.",
                                  "score": 1,
                                  "created_utc": 1744050146.0,
                                  "replies": []
                                },
                                {
                                  "id": "mlxk5ih",
                                  "author": "Top5hottest",
                                  "body": "But it worked.",
                                  "score": 0,
                                  "created_utc": 1744061549.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mlxk1o4",
                          "author": "Top5hottest",
                          "body": "I thought about those.. but neither of those were a must own part of a major console. Even as a kid i remember thinking those were junk.",
                          "score": 0,
                          "created_utc": 1744061513.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mlwvizf",
                      "author": "bannedin420",
                      "body": "It’s not just Reddit man, if you talk to people irl they too are upset and don’t want to pay that money for a switch 2",
                      "score": 0,
                      "created_utc": 1744053823.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mlwex77",
                  "author": "Revolutionary--man",
                  "body": "Overpriced console? \n\n£400 for the switch 2 whilst an Ally is £600... They'll be making a fat loss on the console. \n\nOverpriced games sure, that's how they'll make back the loss they'll make on the consoles.\n\nIt's better than a base Steam Deck for the same price, at least in my country - and it looks nicer than all Steam deck options I've seen.\n\n\nJust say you don't like the console and move on my man, don't pretend it's because the price isn't right. I get the feeling it could be £300 and you still wouldn't grab one.",
                  "score": -19,
                  "created_utc": 1744048717.0,
                  "replies": [
                    {
                      "id": "mlwg9le",
                      "author": "Framed-Photo",
                      "body": "They're NOT taking a loss on switch 2, let's be hyper clear here.\n\nGo take a look at a Device like the ayn portal if you don't believe me. Top end Qualcomm soc, 120hz bright HDR OLED display, hall effect sticks and triggers, large battery, the whole works, and it costs 330 USD brand new, from a MUCH smaller company than Nintendo.\n\nOther gaming handhelds get far cheaper without skimping out on much.\n\nSo unless Nintendo adding magnets, off the shelf optical mouse sensors, and a Nvidia chip somehow doubles the manufacturing costs, even with their MUCH better economy of scale, then yeah they're still making money on this.",
                      "score": 9,
                      "created_utc": 1744049123.0,
                      "replies": []
                    },
                    {
                      "id": "mlwq56s",
                      "author": "NZafe",
                      "body": "People aren’t buying the Ally either.",
                      "score": 5,
                      "created_utc": 1744052145.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlwj765",
              "author": "pikachuswayless",
              "body": "I don't think many people noticed this was a Sopranos reference lol",
              "score": 4,
              "created_utc": 1744050020.0,
              "replies": [
                {
                  "id": "mlwoqtl",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 4,
                  "created_utc": 1744051722.0,
                  "replies": [
                    {
                      "id": "mlwrunc",
                      "author": "FlyingPotatoSaucer",
                      "body": "Sharp as a cueball",
                      "score": 3,
                      "created_utc": 1744052671.0,
                      "replies": [
                        {
                          "id": "mlxp66h",
                          "author": "TotoCocoAndBeaks",
                          "body": "Dont know the reference, but I do love it when redditors angrily pile on a joke comment, often getting even more annoyed when you point out a joke or reference went over their heads",
                          "score": 2,
                          "created_utc": 1744063210.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mlvtpt6",
      "author": "notred369",
      "body": "hell yeah love e-waste!",
      "score": 174,
      "created_utc": 1744042304.0,
      "replies": [
        {
          "id": "mlvu4ms",
          "author": "scruffles87",
          "body": "It's part of a balanced breakfast",
          "score": 17,
          "created_utc": 1744042428.0,
          "replies": [
            {
              "id": "mlxz2we",
              "author": "Melancholoholic",
              "body": "[Delicious and piping hot in only 3 microwave minutes!](https://youtu.be/b6e_wdtBVW8?si=t7ao870jAtSuO4UL)",
              "score": 0,
              "created_utc": 1744066631.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mlw4uqq",
      "author": "None",
      "body": "![gif](giphy|6JB4v4xPTAQFi|downsized)",
      "score": 60,
      "created_utc": 1744045725.0,
      "replies": []
    },
    {
      "id": "mlwfl0p",
      "author": "Kamakaziturtle",
      "body": "I mean, if they actually do up the quality then it's fine.  The drift issue isn't due to not using Hall Effect, it's due to how cheap hardware is these days.  \n\nThat said I will believe it when I see it.  Not just against Nintendo either, seems like all of em are cutting corners these days.",
      "score": 110,
      "created_utc": 1744048914.0,
      "replies": [
        {
          "id": "mlwmda3",
          "author": "DudesworthMannington",
          "body": "It's not that there's no drift, it's just the drift it's smoother and more reliable",
          "score": 39,
          "created_utc": 1744050997.0,
          "replies": []
        },
        {
          "id": "mlwphhe",
          "author": "Qwirk",
          "body": "Hall Effect controllers use magnets rather than mechanical parts. It's literally the issue causing drift.\n\nNo matter how expensive the parts are, they will be subject to wear.",
          "score": 31,
          "created_utc": 1744051946.0,
          "replies": [
            {
              "id": "mlwrlrk",
              "author": "Kamakaziturtle",
              "body": "Potentiameters are fine, the issue is how cheap the hardware is.  A Joystick in general is prone to wear and tear, theres a lot of moving parts and all of them will degrade over time.  The issue with drift is just due to overall lack of quality that is causing these parts to fail much faster than the rest of the joystick.  It's the current \"weakest link\".\n\nHall effect removes said link altogether, which can obviously help.  But improving the potentiameter hardware so it lasts as long as the rest of the joystick would have the same effect on the longevity of the joystick.",
              "score": 31,
              "created_utc": 1744052594.0,
              "replies": [
                {
                  "id": "mlxyzx8",
                  "author": "yogopig",
                  "body": "Then why are the pots in EVERY controller failing irrespective of manufacturer?",
                  "score": 0,
                  "created_utc": 1744066602.0,
                  "replies": [
                    {
                      "id": "mly223g",
                      "author": "Kamakaziturtle",
                      "body": "They don't.  There are plenty of high quality manufactures out there that make good quality controllers that don't fail.  Unfortunately Sony, Microsoft, and Nintendo aren't one of them.\n\nBecause Sony, Microsoft, and Nintendo don't make the pots.  The two big manufacturers are Favor Union, and Alps Alpine.  Sony, Microsoft, and Nintendo all use both FU and ALPS in their controllers.\n\nBoth of these companies make pretty cheap pots.  The three console giants use them because they are dirt cheap.  Surprise surprise, the answer for why manufacturers are doing something anti-consumer is \"Because Money\"",
                      "score": 9,
                      "created_utc": 1744067641.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mlwt9f4",
                  "author": "WhySpongebobWhy",
                  "body": "Same effect at a significantly higher cost than just using established hall effect technology.  R&D costs money.",
                  "score": -9,
                  "created_utc": 1744053115.0,
                  "replies": [
                    {
                      "id": "mlwub9f",
                      "author": "Kamakaziturtle",
                      "body": "What R&D?  It's not new technology, controllers have been using potentiameters for decades.  The reason why it's become such a big issue as of late is them cutting corners to cut costs.",
                      "score": 18,
                      "created_utc": 1744053443.0,
                      "replies": [
                        {
                          "id": "mlwuiki",
                          "author": "WhySpongebobWhy",
                          "body": "Bro... YOU literally said \"improving the potentiameter hardware\".\n\nHow in God's greenest fuck do you propose improvements be made without R&D?  That's literally how you make improvements to existing hardware.",
                          "score": -17,
                          "created_utc": 1744053507.0,
                          "replies": [
                            {
                              "id": "mlwvkk1",
                              "author": "Kamakaziturtle",
                              "body": "By doing what they used to do.  Sometimes rolling back a design is an improvement, especially in the modern era.  \n\nThis isn't new technology, it exists and has been implemented in the past.  They just made a decision to use cheaper materials.",
                              "score": 12,
                              "created_utc": 1744053837.0,
                              "replies": []
                            },
                            {
                              "id": "mlxphhk",
                              "author": "TotoCocoAndBeaks",
                              "body": "They just needed to not use such a cheap one. No r and d necessary",
                              "score": 4,
                              "created_utc": 1744063315.0,
                              "replies": []
                            },
                            {
                              "id": "mlzg2qz",
                              "author": "nero40",
                              "body": "The joysticks in the old JoyCons was a low quality one that they had to use in order to fit a joystick in such a small space that the JoyCons had. That’s the problem, it wasn’t good joysticks to begin with. \n\nBy going back to established joystick designs that aren’t so easily prone to wear and tear, we MIGHT see an improvement in joystick durability in the Switch 2’s JoyCons. We shall see how Nintendo’s claims of higher durability works in the future when we finally get the device in hand to test.",
                              "score": 1,
                              "created_utc": 1744086903.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mlwshvx",
              "author": "popupsforever",
              "body": "The vast majority of controllers going back to the dawn of the analog stick don't use hall effect sensors and don't have widespread problems with stick drift. It's not a fundamental problem with mechanical analog sticks, it's a problem with Nintendo's (and Microsoft and Sony, to a lesser extent) shit design and part quality in the modern era.",
              "score": 9,
              "created_utc": 1744052874.0,
              "replies": [
                {
                  "id": "mlxz39c",
                  "author": "yogopig",
                  "body": "Yes they do?? Its absolutely a fundamental design flaw??",
                  "score": -2,
                  "created_utc": 1744066634.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mlwyk0p",
              "author": "eestionreddit",
              "body": "Nintendo was using good pots back in the Gamecube and Wii days, I've heard very few cases of those drifting",
              "score": 2,
              "created_utc": 1744054771.0,
              "replies": [
                {
                  "id": "mlx2vxm",
                  "author": "nullKomplex",
                  "body": "I had multiple gamecube controllers with drift. I used to think it was fun sliding along super slowly in smash bros without my hands on the controller even.",
                  "score": 7,
                  "created_utc": 1744056112.0,
                  "replies": []
                },
                {
                  "id": "mlxky4r",
                  "author": "rpkarma",
                  "body": "GameCube controllers absolutely drift haha",
                  "score": 6,
                  "created_utc": 1744061813.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mlxywp4",
          "author": "yogopig",
          "body": "This is just incorrect",
          "score": 0,
          "created_utc": 1744066571.0,
          "replies": [
            {
              "id": "mly2ng8",
              "author": "Kamakaziturtle",
              "body": "You're welcome to elaborate.  Do tell me how there's no difference between an ALPS potentiometer and one from CH Products.",
              "score": 2,
              "created_utc": 1744067843.0,
              "replies": [
                {
                  "id": "mlyxv3d",
                  "author": "yogopig",
                  "body": "I can’t, don’t know anything about that. I have seem every potentiometer controller I have ever had for the last 20 years get stick drift however, and have not seen one example of a hall effect or TMR stick get drift.",
                  "score": 0,
                  "created_utc": 1744079162.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mlw41ap",
      "author": "Kevo1110",
      "body": "Yeah, that's a no from me, dawg.",
      "score": 21,
      "created_utc": 1744045476.0,
      "replies": []
    },
    {
      "id": "mlvz5vt",
      "author": "vgiz",
      "body": "Can’t tariff that great news!",
      "score": 30,
      "created_utc": 1744043985.0,
      "replies": [
        {
          "id": "mlvzpj9",
          "author": "littlerelaxation",
          "body": "yet..",
          "score": 3,
          "created_utc": 1744044157.0,
          "replies": []
        },
        {
          "id": "mlyhhdp",
          "author": "Lyin-Oh",
          "body": "1% improvement is still improvement, I guess.",
          "score": 0,
          "created_utc": 1744073156.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlwe9l6",
      "author": "InspectorTroy",
      "body": "We’re still trying to catch up to the Dreamcast controller?",
      "score": 11,
      "created_utc": 1744048522.0,
      "replies": [
        {
          "id": "mlycb55",
          "author": "parentheticalme",
          "body": "“We’re sill trying to catch up to the Dreamcast?” FIFY",
          "score": 4,
          "created_utc": 1744071263.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlw9s9x",
      "author": "Zachsjs",
      "body": "This title isn’t very clear if you don’t know how Hall effect sensors work.  At first I interpreted it as meaning “to avoid stick drift, Nintendo won’t use Hall effect sensors.”",
      "score": 13,
      "created_utc": 1744047203.0,
      "replies": []
    },
    {
      "id": "mly4m0d",
      "author": "Death2RNGesus",
      "body": "Considering Nintendo should have done a recall on the switch 1's piece of crap sticks, I have little faith that they will fix the issue.",
      "score": 9,
      "created_utc": 1744068525.0,
      "replies": [
        {
          "id": "mm1rykn",
          "author": "TheGreatGamer1389",
          "body": "So another lawsuit then?",
          "score": 0,
          "created_utc": 1744126195.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlwsl9n",
      "author": "dos_user",
      "body": "I'm sure the JoyCons being magnetically attached prevented them from using Hall effect sticks. \n\nAnyway, if it's anything like Xbox's sticks, I'll be fine.",
      "score": 6,
      "created_utc": 1744052903.0,
      "replies": []
    },
    {
      "id": "mlwf43w",
      "author": "Ouibeaux",
      "body": "How about ergonomic?",
      "score": 8,
      "created_utc": 1744048773.0,
      "replies": [
        {
          "id": "mlwys33",
          "author": "Neo_Techni",
          "body": "best we can do is not make it as sharp as a NES controller",
          "score": 10,
          "created_utc": 1744054840.0,
          "replies": [
            {
              "id": "mlz4deb",
              "author": "trantaran",
              "body": "I use my nes controller to cut meat",
              "score": 6,
              "created_utc": 1744081715.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mly6rwp",
      "author": "Master_Bruce",
      "body": "Didn’t they also routinely say there was no stick drift in Switch 1’s joy cons?",
      "score": 7,
      "created_utc": 1744069278.0,
      "replies": []
    },
    {
      "id": "mly5nb9",
      "author": "SquinkyEXE",
      "body": "$90 by the way.",
      "score": 4,
      "created_utc": 1744068886.0,
      "replies": [
        {
          "id": "mlz4myq",
          "author": "trantaran",
          "body": "The extra $10 goes to the free repair cost hypotheically when you send them in for repair",
          "score": 0,
          "created_utc": 1744081822.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlwd6t6",
      "author": "ilikepugs",
      "body": "> more reliable\n\nah yes, the highest of bars",
      "score": 5,
      "created_utc": 1744048204.0,
      "replies": []
    },
    {
      "id": "mlyga63",
      "author": "None",
      "body": "I don’t get it. Ppl used to joke about “nintendium.” \n\nHall effects can’t be more expensive than when the damn Dreamcast used one. It’s already gonna cost 110 per pair I bet.",
      "score": 3,
      "created_utc": 1744072719.0,
      "replies": []
    },
    {
      "id": "mlwcs6u",
      "author": "SensibleCircle",
      "body": "Let's say they're 100% more reliable. That's still shit.",
      "score": 7,
      "created_utc": 1744048086.0,
      "replies": []
    },
    {
      "id": "mlwfm6h",
      "author": "KenshinDreamz5516",
      "body": "Lets see how things look a few months into it",
      "score": 2,
      "created_utc": 1744048924.0,
      "replies": []
    },
    {
      "id": "mlxpzci",
      "author": "oureux",
      "body": "I don’t believe them. Why not go the extra mile to save themselves future recalls and lawsuits? I bet they also rose the prices for joycon pairs.",
      "score": 2,
      "created_utc": 1744063487.0,
      "replies": []
    },
    {
      "id": "mlxvjh6",
      "author": "Dhegxkeicfns",
      "body": "At least someone will make aftermarket good ones.",
      "score": 2,
      "created_utc": 1744065415.0,
      "replies": []
    },
    {
      "id": "mm0p1wr",
      "author": "wintersdark",
      "body": "I loved my switch, but I went through so many joycons.  Not willing to do that again.  But at least the Switch was pretty cheap.  Replacement joycons certainly weren't, but at least the switch was.\n\nIf the Switch 2 was also inexpensive, I'd be les annoyed here, but at that price tag (it's like $750cdn!) I expected better. \n\nMaybe I'm wrong, and they've got some magic way to prevent this problem AND not have wide deadzones and low sensitivity, but... Somehow I doubt it.",
      "score": 2,
      "created_utc": 1744112878.0,
      "replies": []
    },
    {
      "id": "mm3752f",
      "author": "_Spastic_",
      "body": "Former Nintendo employee.\n\nThe plural of Joy-con is Joy-con.\n\nI still hate it, 5 years later.",
      "score": 2,
      "created_utc": 1744141134.0,
      "replies": []
    },
    {
      "id": "mm45fav",
      "author": "EnolaGayFallout",
      "body": "So that it can sell you another pair of joy con every year. Free $99",
      "score": 2,
      "created_utc": 1744151427.0,
      "replies": []
    },
    {
      "id": "mm51a7j",
      "author": "Immoracle",
      "body": "Wow they are actually acknowledging their flawed design.",
      "score": 2,
      "created_utc": 1744162481.0,
      "replies": []
    },
    {
      "id": "mm5kxra",
      "author": "rjksn",
      "body": "Meh. Games are loco pricey",
      "score": 2,
      "created_utc": 1744169800.0,
      "replies": []
    },
    {
      "id": "mm761q8",
      "author": "prick-in-the-wall",
      "body": "Am I missing something? Switch one had non-hall effect joysticks and has stick drift issues. and now they’re saying switch2 will not have a hall effect joysticks to avoid drift issues?",
      "score": 2,
      "created_utc": 1744200812.0,
      "replies": []
    },
    {
      "id": "mlw02w2",
      "author": "patinhat",
      "body": "We won’t be able to play it anyway",
      "score": 5,
      "created_utc": 1744044272.0,
      "replies": []
    },
    {
      "id": "mlw4pmt",
      "author": "tfinx",
      "body": "Well that's disappointing. Whose joycons didn't start eventually drifting? \n\nI've bought a few hall stick controllers, a lot from 8bitdo, and damn do they hold up well and are way more affordable than Nintendo's controllers. Even the switch pro controller had meh sticks. \n\nI'm doubting the quality of whatever they promise, but I guess we'll see when it's in our hands.",
      "score": 3,
      "created_utc": 1744045683.0,
      "replies": [
        {
          "id": "mlw5i1w",
          "author": "AlbiFoxtrot",
          "body": "I hit the lottery with joycons. One instance of drift in my two pairs and that was solved with a calibration. Got my switch at launch too. Maybe I'm light fingered or something?",
          "score": 3,
          "created_utc": 1744045925.0,
          "replies": [
            {
              "id": "mlw8h8f",
              "author": "Dt2_0",
              "body": "I have 2 pairs that have never had drifting issues.",
              "score": 3,
              "created_utc": 1744046818.0,
              "replies": []
            },
            {
              "id": "mlwlo6f",
              "author": "LAMProductions99",
              "body": "Ya I've been lucky too. Got my switch at launch, and didn't use a different pair of joycons until I got the ACNH switch in 2020. The only other controller I had up to that point was the pro controller that I got alongside SSBU, and even then I still played in handheld mode a lot. I still have those original joycons and they haven't drifted yet. None of the joycons I have have done it.",
              "score": 2,
              "created_utc": 1744050777.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlwks1a",
          "author": "whatnowwproductions",
          "body": "The latest batch I purchased seem to have no issues.",
          "score": 2,
          "created_utc": 1744050502.0,
          "replies": []
        },
        {
          "id": "mlwa1uz",
          "author": "yhzh",
          "body": "My launch joy cons are still fine, but I've hardly used them since I got  a pro controller several years ago.\n\nI've never had a controller develop significant drift, but I've had a lot of controllers to spread my usage and keep I them pretty clean/dust free.",
          "score": 0,
          "created_utc": 1744047283.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlw622l",
      "author": "DavidinCT",
      "body": "Nintendo being cheap and over charging.... remember in Japan, they are getting an exclusive Switch 2 that will be $330 but, everyplace else in the world has to pay $450 at least.",
      "score": 1,
      "created_utc": 1744046093.0,
      "replies": [
        {
          "id": "mlwad8n",
          "author": "PashaB",
          "body": "That's to combat scalpers and people abusing the yen currency.",
          "score": 4,
          "created_utc": 1744047375.0,
          "replies": []
        },
        {
          "id": "mlw953w",
          "author": "RegularVega",
          "body": "And you conveniently choose to Ignore region-locked part.",
          "score": 4,
          "created_utc": 1744047013.0,
          "replies": [
            {
              "id": "mlw9yi1",
              "author": "joestaff",
              "body": "I imagine that doesn't really matter for folks who live in the region that it's locked to.\n\n\nConsoles have been region locked since even the NES days, or earlier. Never effected anyone then.\n\n\nGranted, I'm old now and losing touch, but I doubt a region lock would effect a gamer more than a 25% discount.",
              "score": -7,
              "created_utc": 1744047255.0,
              "replies": [
                {
                  "id": "mlwhz9f",
                  "author": "sevenut",
                  "body": "It wasn't really a thing for regular consumers to import games/consoles back then unless you were rich. There were also technological barriers that made region locking a thing.",
                  "score": 3,
                  "created_utc": 1744049645.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mlwdo8o",
      "author": "Akrevics",
      "body": "Joycons were reliable too - we could always rely on them getting stick drift sooner or later.",
      "score": 3,
      "created_utc": 1744048347.0,
      "replies": []
    },
    {
      "id": "mlwludk",
      "author": "None",
      "body": "[deleted]",
      "score": 2,
      "created_utc": 1744050831.0,
      "replies": [
        {
          "id": "mlwnm0g",
          "author": "jcode7090",
          "body": "I think it’s because a new pair of Joy Con’s are $80. Will probably be $100 for the switch 2.",
          "score": 1,
          "created_utc": 1744051376.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlxwvep",
      "author": "ZachTheCommie",
      "body": "If the new controllers drift anyway, I'm taping them to a brick and throwing it through Nintendos window.",
      "score": 2,
      "created_utc": 1744065880.0,
      "replies": [
        {
          "id": "mly8orf",
          "author": "Anxious_Breakfast_14",
          "body": "If authorities question you, just say you weren't aiming for their windows, the drift in the brick altered its course.",
          "score": 1,
          "created_utc": 1744069955.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlw0oig",
      "author": "kaishinovus",
      "body": "Welp.. the tariffs didn't do that.",
      "score": 1,
      "created_utc": 1744044456.0,
      "replies": [
        {
          "id": "mlwqktv",
          "author": "er-day",
          "body": "I mean, they're cutting corners in a down economy to save on cost and price for the end user. It kinda did do that...",
          "score": 0,
          "created_utc": 1744052278.0,
          "replies": [
            {
              "id": "mlwuaew",
              "author": "kaishinovus",
              "body": "The switch 2 has been in development for a while. The decision to not use hall effect joysticks was made well before the last 6 months. So no.. it kinda didn't do that.",
              "score": 0,
              "created_utc": 1744053436.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mlwc153",
      "author": "Ticaticai",
      "body": "Do not break one, could cost you $400to replace …",
      "score": 1,
      "created_utc": 1744047863.0,
      "replies": []
    },
    {
      "id": "mlw4myp",
      "author": "Ab47203",
      "body": "This was obvious to anyone paying attention. The magnetic connection system makes it basically impossible without interference. We're not just not getting them. We can't put aftermarket ones in anymore.\n\nEdit: goddamn this is an echo chamber. Magnets an inch or two from the thumbstick are going to be an issue if the magnets are strong enough to hold the ENTIRE CONSOLE up. Thinking it won't be an issue is cope. There's a reason they didn't put hall effect sticks in the joycons.\n\nIn response I've had one person start slinging insults and tons of people questioning the exact data which does NOT exist yet. It's basic logic if magnets in that spot mess with my hall effect joycons then it'll mess with the switch 2 if it had hall effect.\n\nGuess what I just tested. That's right. It drags my character to the right when I put a magnet on the side of the switch where the connectors on the switch 2 are. \n\nCan I calibrate it away? Yes. When I remove the controller from the console it needs another recalibrating. Almost like I KNEW WHAT I WAS TALKING ABOUT BECAUSE IVE BEEN USING HALL EFFECT AND TMR STICKS FOR YEARS.",
      "score": -2,
      "created_utc": 1744045660.0,
      "replies": [
        {
          "id": "mlwaxsk",
          "author": "Harflin",
          "body": "Do you have any details that suggest the proximity of the magnets would interfere with said hall-effect sensors?",
          "score": 8,
          "created_utc": 1744047544.0,
          "replies": [
            {
              "id": "mlwc0t9",
              "author": "Eric1180",
              "body": "He doesnt because he's making shit up, see my comment response to his original statement. Hall sensors would have zero issues working near the magnetic rails. Its a known interference which can easily be cancelled out. Just like how we cancel out the earths magnetic field on other hall sensors",
              "score": 8,
              "created_utc": 1744047861.0,
              "replies": [
                {
                  "id": "mlx1k7o",
                  "author": "Ab47203",
                  "body": "If it was constant sure. It means you'll be recalibrating EVERY time you disconnect the controllers or reconnect them.",
                  "score": 1,
                  "created_utc": 1744055697.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mlx1pl4",
              "author": "Ab47203",
              "body": "Either they're strong enough to interfere or the weight of the console being supported entirely by the magnets is another big issue.",
              "score": 2,
              "created_utc": 1744055743.0,
              "replies": [
                {
                  "id": "mlx95rn",
                  "author": "Harflin",
                  "body": "I'm looking for something a bit more verifiable than just a statement of \"they'd interfere\"",
                  "score": 1,
                  "created_utc": 1744058045.0,
                  "replies": [
                    {
                      "id": "mm0s0y7",
                      "author": "Ab47203",
                      "body": "Unfortunately there's not exactly confirmation on the magnet strength. Logic would lead almost anyone to believe that a magnet strong enough to hold the console up (strong enough they only used them on one side) then it's strong enough at an inch or two away to interfere with the magnets in the hall effect stick. Would likely mostly be an issue on the left controller.\n\nEdit: tested on my switch 1 and magnets an inch or two from the hall effect sticks I put in my joycons do indeed start interfering. It needs recalibrating when removed from the console too.",
                      "score": 2,
                      "created_utc": 1744114142.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mlwbf85",
          "author": "Eric1180",
          "body": "Thats complete bullshit, I am an electrical engineer. Hall sensor avoids interference by simply normalizes outside influences. Having a magnetic field next to a hall sensor doesn't make it \"IMPOSSIBLE\"  to cancel out interference. If that were true, nothing would work due to the earths magnetic field. \n\nDon't talk out of your ass.",
          "score": 20,
          "created_utc": 1744047684.0,
          "replies": [
            {
              "id": "mlwuqjh",
              "author": "TheBoBiZzLe",
              "body": "Interesting.  Is that the same with say gamesirs mag res tmr sticks?  Always assumed that a strong magnet, like the ones holding joycons on, could pull on something somewhere.  Kinda reminds me of the new MacBook connections and those are pretty sturdy.  \n\nAlso remember seeing a video of when gulikits first started on the switch and people had to use external magnets to calibrate them.  But guess those did go like right up on them.",
              "score": 2,
              "created_utc": 1744053576.0,
              "replies": [
                {
                  "id": "mm2853o",
                  "author": "Ab47203",
                  "body": "I tested it with my switch hall effect sticks. The magnet the same distance as it would be on the switch 2 makes the left thumbstick start pulling to the right. It would need recalibrating every time it's disconnected or reconnected to avoid this especially if the magnets to hold the controllers on the console are so few. Four in total and no matching magnet on the other side. No hardware connection points. Those magnets are going to be POTENT and I would be shocked if you couldn't just stick the switch 2 to a fridge. \n\nNot exactly what I would call usable needing to recalibrate the controllers every time you connect or disconnect them from the console.",
                  "score": 3,
                  "created_utc": 1744131005.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mlx2buh",
              "author": "Ab47203",
              "body": "It would change the magnetic field EVERY time you disconnect or reconnect the controllers. If anyone is talking out of their ass it's you. A magnet near sensors that RELY on magnets to function not interfering is insane levels of cope. If it's not strong enough to interfere then how would FOUR of said magnets be all that holds the two controllers to the console? It would fall off at the drop of a hat. \n\nMaybe instead of slinging insults you could try talking next time. As it is you opened the conversation with the equivalent of \"THIS DUDES A STUPID FUCKIN ASSHOLE MAKING SHIT UP\" and I don't care to continue talking to you.",
              "score": 4,
              "created_utc": 1744055936.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlw6kwy",
          "author": "yayitsdan",
          "body": "I was wondering if the magnetic rail system might making it impossible, but I'd love to see a third party take a crack at it.",
          "score": 6,
          "created_utc": 1744046248.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlwjz87",
      "author": "lodemeup",
      "body": "Will the sticks be as easy to replace as the Switch 1’s were? By the time drift starts happening I’ll plan to replace them with Hall effect ones.",
      "score": 1,
      "created_utc": 1744050258.0,
      "replies": []
    },
    {
      "id": "mlx4ie5",
      "author": "CaseyAnthonysMouth",
      "body": "These mfers gonna cost 100+ they should have a replacement program.",
      "score": 1,
      "created_utc": 1744056622.0,
      "replies": []
    },
    {
      "id": "mlxf11p",
      "author": "No0oo0Ooo",
      "body": "Fuck you Nintendo.",
      "score": 1,
      "created_utc": 1744059880.0,
      "replies": []
    },
    {
      "id": "mlxfjbd",
      "author": "XuX24",
      "body": "I have a controller that I got in November and is already drifting. I'm thinking of getting a third party controller with He just to avoid this. I hate that none of the 3 companies that make consoles make hall effect sticks, I still don't know how some dodgy law firm hasnt went at them for this.",
      "score": 1,
      "created_utc": 1744060043.0,
      "replies": []
    },
    {
      "id": "mlxggx7",
      "author": "rasz_pl",
      "body": "$500, but you peons dont deserve two $1 sensors.",
      "score": 1,
      "created_utc": 1744060346.0,
      "replies": []
    },
    {
      "id": "mlxlbq9",
      "author": "deadgirlrevvy",
      "body": "Jesus... Fucking Nintendo, man.  The balls on them must be solid brass and the size of bowling balls.  Non-hall effect sticks in 2025?...at the pricepoint they are asking for it?  That's beyond insulting.  Especially given how dogshit the swith 1's joysticks were.  You couldn't GIVE me a Switch 2 (unless I could scalp it to some sucker willing to pay above retail).",
      "score": 1,
      "created_utc": 1744061939.0,
      "replies": []
    },
    {
      "id": "mlxn1eh",
      "author": "humanman42",
      "body": "I hope so. every single joystick on every single Nintendo product from the switch has drifted. first and 3rd party",
      "score": 1,
      "created_utc": 1744062498.0,
      "replies": []
    },
    {
      "id": "mlznvy1",
      "author": "Tttutter",
      "body": "I'm still mad about my 4 drifting joysticks. I'll never buy the Switch2",
      "score": 1,
      "created_utc": 1744091040.0,
      "replies": []
    },
    {
      "id": "mlzurtd",
      "author": "BloodSteyn",
      "body": "Cheaping out on parts to save a few cents.\n\nHall effect sticks cheap too, so why not cut a teeny tiny part of profit to give the users what they want.\n\nDo they really want users to keep on buying replacement controllers....oh, now I get it. It's the Razor and Blade model.",
      "score": 1,
      "created_utc": 1744094910.0,
      "replies": []
    },
    {
      "id": "mm0si5a",
      "author": "ColonelBeer",
      "body": "Would hall effect sticks even be possible to add though? I'd imagine the magnets that connect the joycons to the console could cause problems with hall effect sticks no?",
      "score": 1,
      "created_utc": 1744114340.0,
      "replies": []
    },
    {
      "id": "mm1cnn7",
      "author": "fire2day",
      "body": "I wish they would just allow proper third-party controllers rather than having some kind of only-in-handheld-mode limitation. The Hori split pad pro was awesome, despite that one downside.",
      "score": 1,
      "created_utc": 1744121570.0,
      "replies": []
    },
    {
      "id": "mm1dbdp",
      "author": "TheMasterSwordMaster",
      "body": "I've had like 4 sets of joycons and none of them drifted, but it was the triggers and bumpers that broke",
      "score": 1,
      "created_utc": 1744121776.0,
      "replies": []
    },
    {
      "id": "mm2n3qv",
      "author": "bos-g",
      "body": "Too bad we wont be able to afford it in America",
      "score": 1,
      "created_utc": 1744135211.0,
      "replies": []
    },
    {
      "id": "mm2pcju",
      "author": "egguw",
      "body": "does this apply to the pro controllers too?",
      "score": 1,
      "created_utc": 1744135852.0,
      "replies": []
    },
    {
      "id": "mm3rcrf",
      "author": "Faceliss",
      "body": "I swapped my joycon sticks to Hall sensors... this thing still drifts like a btch.",
      "score": 1,
      "created_utc": 1744146908.0,
      "replies": []
    },
    {
      "id": "mmhen8t",
      "author": "ohiocodernumerouno",
      "body": "I think Nintendo copyrighted stick drift",
      "score": 1,
      "created_utc": 1744330907.0,
      "replies": []
    },
    {
      "id": "mn0jmh0",
      "author": "TurboPikachu",
      "body": "They chose not to use Hall Effect joysticks…. To avoid a lawsuit over the Switch 1 sticks",
      "score": 1,
      "created_utc": 1744607123.0,
      "replies": []
    },
    {
      "id": "mlwh7ky",
      "author": "ToMorrowsEnd",
      "body": "Yep. called it.   they are not going to improve squat.",
      "score": 1,
      "created_utc": 1744049409.0,
      "replies": []
    },
    {
      "id": "mlw7ukj",
      "author": "SinkCat69",
      "body": "More reliably bring in money for Nintendo",
      "score": 1,
      "created_utc": 1744046633.0,
      "replies": []
    },
    {
      "id": "mlwaecg",
      "author": "FireMaker125",
      "body": "lmao it keeps getting worse",
      "score": 1,
      "created_utc": 1744047384.0,
      "replies": []
    },
    {
      "id": "mlwjjlf",
      "author": "beat-sweats",
      "body": "New stick drift unlocked",
      "score": 1,
      "created_utc": 1744050126.0,
      "replies": []
    },
    {
      "id": "mlwkt13",
      "author": "thatguywithawatch",
      "body": "Pinky promise?",
      "score": 1,
      "created_utc": 1744050510.0,
      "replies": []
    },
    {
      "id": "mlwxsu7",
      "author": "ExoticMandibles",
      "body": "Why not?  Are Hall sensors really that much more expensive?  Would they have to license patents or something?",
      "score": 1,
      "created_utc": 1744054535.0,
      "replies": [
        {
          "id": "mm0bnwq",
          "author": "trickman01",
          "body": "For starters they would be right next to the magnets holding the joycons onto the switch 2.",
          "score": 3,
          "created_utc": 1744105898.0,
          "replies": []
        },
        {
          "id": "mly6f14",
          "author": "SquinkyEXE",
          "body": "Because if they break you have to buy more. Nintendo is nickel and diming everywhere they can with switch 2. $80 games, $10 for small updates to games you already paid full price for, the tutorial game being paid. Paid discord clone. There's just so many reasons to hate Nintendo right now. I can hardly choose!",
          "score": 1,
          "created_utc": 1744069154.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlxlxvs",
      "author": "None",
      "body": "hall effect is a buzzword at this point anyway. there are bad hall effect controllers with lots of drift and great potentiometer controllers with zero drift. y'all can watch [this](https://youtu.be/VZLaXwS-xpI?si=7Gy4r2dcWu4jYts-) video that explains it",
      "score": 1,
      "created_utc": 1744062138.0,
      "replies": [
        {
          "id": "mlxykjx",
          "author": "Recipe-Jaded",
          "body": "I prefer potentiometer based solely on the fact that hall effect joysticks are a buzzword, as you said. Unless you find quality hall effect sticks in the sea of shitty ones, you can bet they will drift.",
          "score": -1,
          "created_utc": 1744066456.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm1wdee",
      "author": "SaiyanRajat",
      "body": "This is bullshit, Nintendo should've used Hall effect joysticks given the steep 50% increase in base price.",
      "score": 1,
      "created_utc": 1744127497.0,
      "replies": []
    },
    {
      "id": "mlw995l",
      "author": "OriolesMets",
      "body": "For that price, it’s the least they can do.",
      "score": 1,
      "created_utc": 1744047046.0,
      "replies": []
    },
    {
      "id": "mlwdsni",
      "author": "AppalachanKommie",
      "body": "For Nintendo to add hall effect joysticks games would need to be 120 dollars (digital)",
      "score": 1,
      "created_utc": 1744048385.0,
      "replies": []
    },
    {
      "id": "mlwhriq",
      "author": "MartyBellvue",
      "body": "The new thing that's gonna be breaking is those mouse controls. I don't see those lasting for more than a couple weeks.",
      "score": 1,
      "created_utc": 1744049578.0,
      "replies": []
    },
    {
      "id": "mlwp7kz",
      "author": "GaiusMarcus",
      "body": "Or maybe they're just cheaper.",
      "score": 1,
      "created_utc": 1744051863.0,
      "replies": []
    },
    {
      "id": "mlwxu9x",
      "author": "Jaambie",
      "body": "![gif](giphy|jeXiz1RAvzX44)",
      "score": 1,
      "created_utc": 1744054547.0,
      "replies": []
    },
    {
      "id": "mlxnhn3",
      "author": "PaulR79",
      "body": "Good old Nintend'oh! Charging a fortune still and also refusing to make a real change when an incremental update will do for them. What are you (gaming people who like it) gonna do, not buy it?\n\nI've had very few Nintendo products, Wii, 3DS, New 3DS XL but I try to keep up with tech and the way they scrimp on things like this or small product updates (all Gameboys bar a few) you'd think they were looking for money down the back of a couch / sofa to make ends meet.",
      "score": 1,
      "created_utc": 1744062648.0,
      "replies": []
    },
    {
      "id": "mlxtibo",
      "author": "hihowubduin",
      "body": "Given the track record I have with my switch joycons... Yeah this smells like bs.",
      "score": 1,
      "created_utc": 1744064704.0,
      "replies": []
    },
    {
      "id": "mlxwhht",
      "author": "Kageromero",
      "body": "The people who used them at the tech event all praised how smooth and good they felt, so I believe that. Reliability...that's a wait and see",
      "score": 1,
      "created_utc": 1744065746.0,
      "replies": []
    },
    {
      "id": "mlyw7y3",
      "author": "triadwarfare",
      "body": "So... they basically admitted the old joycons were bad.",
      "score": 1,
      "created_utc": 1744078542.0,
      "replies": []
    },
    {
      "id": "mlz4ibd",
      "author": "Popular-Jello9539",
      "body": "It’s like they don’t want it to sell at this point.",
      "score": 1,
      "created_utc": 1744081770.0,
      "replies": []
    },
    {
      "id": "mlwjamd",
      "author": "Jarsky2",
      "body": "ITT: People not considering the potential issues with putting magnetic sensors right next to a big fucking magnet. \n\nNot defending Nintendo, just pointing out there's a pretty fair reason for them not to use Hall Effects.",
      "score": -1,
      "created_utc": 1744050050.0,
      "replies": []
    },
    {
      "id": "mlw0z6z",
      "author": "Grathmaul",
      "body": "Hall effect sticks aren't objectively better.\n\nI've had a PS3 controller for over 12 years that started drifting but was easily fixed by cleaning it. It's much more dependent on the materials used and the actual design of the controller.",
      "score": -11,
      "created_utc": 1744044548.0,
      "replies": [
        {
          "id": "mlw1tb8",
          "author": "Veranova",
          "body": "Well they might be objectively better, but it’s also true that a lot of consoles made in the 2000s came with controllers which still work fine. I never remember stick drift being a concern on the GameCube or Wii sticks, they were super robustly made",
          "score": 6,
          "created_utc": 1744044800.0,
          "replies": [
            {
              "id": "mlw2yic",
              "author": "Marketing_Helpful",
              "body": "gamecube sticks get drift but mainly you get PODE which is another issue",
              "score": 6,
              "created_utc": 1744045144.0,
              "replies": []
            },
            {
              "id": "mlw8rju",
              "author": "Dt2_0",
              "body": "GameCube and Wii didn't have major issues with drift because the system recalibrated the center at startup. Boot up a Gamecube while holding a stick one direction, and the game will think that is the center point.",
              "score": 5,
              "created_utc": 1744046903.0,
              "replies": []
            },
            {
              "id": "mlwcdjb",
              "author": "Grathmaul",
              "body": "I said they aren't objectively better.",
              "score": 2,
              "created_utc": 1744047966.0,
              "replies": [
                {
                  "id": "mlwfsid",
                  "author": "Veranova",
                  "body": "I know, read my comment as if I understood that. I’m not a downvoter by the way but popular belief at least is they are technically better",
                  "score": 1,
                  "created_utc": 1744048977.0,
                  "replies": [
                    {
                      "id": "mlwhvy5",
                      "author": "Grathmaul",
                      "body": "Popular beliefs aren't objective facts. I'm sure they are better in many if not most ways, but they're newer tech and more expensive, and not necessarily worth it in most cases.",
                      "score": 1,
                      "created_utc": 1744049616.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mlw5rqu",
          "author": "DavidinCT",
          "body": "The Switch 1 was known for the drift issues,  PS3/Xbox 360/PS5/Series X, never had any drift issues. My Switch does, replaced the joycons like 3 times....\n\nHall effect would stop that, are they better, nah....",
          "score": 6,
          "created_utc": 1744046007.0,
          "replies": [
            {
              "id": "mlwcnid",
              "author": "Grathmaul",
              "body": "They sucked because of bad design, and cheap materials. Not because they weren't hall effect.",
              "score": 4,
              "created_utc": 1744048048.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlwb17s",
          "author": "forestman11",
          "body": "If that PS3 controller had hall effect sensors it wouldn't have even needed that cleaning. Yes you can make potentiometer-based sticks more reliable than Nintendo, no one's arguing that, but hall effect sensors *are* objectively better.",
          "score": 2,
          "created_utc": 1744047571.0,
          "replies": [
            {
              "id": "mlwenyx",
              "author": "Grathmaul",
              "body": "Sure, and they're new, and more expensive. Nintendo doesn't need any more excuses to jack up their prices though.",
              "score": 1,
              "created_utc": 1744048642.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlw9clm",
          "author": "None",
          "body": "? They are better lol. Magnets as opposed to more components. Reference how HE switches work.",
          "score": 1,
          "created_utc": 1744047075.0,
          "replies": [
            {
              "id": "mlwed79",
              "author": "Grathmaul",
              "body": "Okay maybe there's an argument to be made that they are better, but they're not necessary.",
              "score": 1,
              "created_utc": 1744048553.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mlw7r76",
          "author": "EmeraldFox23",
          "body": "Seriously. I grew up as a console player, from PS1 to PS4 pro (pc now), and I've never had a single controller suffer from stick drift. I specifically chose a non-Hall effect controller when buying one for my pc, specifically to avoid the hassle.",
          "score": -1,
          "created_utc": 1744046604.0,
          "replies": [
            {
              "id": "mlw85xb",
              "author": "Rid1_",
              "body": "What's the hassle with decent hall effect controller?",
              "score": 4,
              "created_utc": 1744046726.0,
              "replies": [
                {
                  "id": "mlwopsp",
                  "author": "EmeraldFox23",
                  "body": "When the sticks eventually start to drift. Then I either need to change the sticks myself, get it repaired, or buy a new controller. I'd rather just buy one controller and use that for the foreseeable future.",
                  "score": 0,
                  "created_utc": 1744051713.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mlws4ab",
      "author": "raxitron",
      "body": "Okay so I have to open it up and put paper between the contacts again the day I pick it up.\n\nPremium prices for sub-par products.",
      "score": -1,
      "created_utc": 1744052755.0,
      "replies": []
    },
    {
      "id": "mlx6t3s",
      "author": "epidemica",
      "body": "Another reason not to buy it.",
      "score": 0,
      "created_utc": 1744057324.0,
      "replies": []
    },
    {
      "id": "mlz4lpq",
      "author": "None",
      "body": "Been lucky, never had stick drift on any console except for when I dropped my switch face down. Some of you use enough pressure to turn coal into diamonds on them.",
      "score": 0,
      "created_utc": 1744081808.0,
      "replies": []
    },
    {
      "id": "mlvwncf",
      "author": "mqwi",
      "body": "Am I the only one confused by the title? Just from reading it, I thought Hall effect sensors were causing the Joy-Con drift, and they’re not going to use them anymore to avoid it. Or is my sense of English just off?",
      "score": -11,
      "created_utc": 1744043201.0,
      "replies": [
        {
          "id": "mlvyxtt",
          "author": "Melodic-Task",
          "body": "Hall Effect are a newer top of the line technology that many consider the best joystick tech in controllers (especially for fighters/fps games).  This is not standard in any basic controller for any console (as far as I am aware), but you can get upgraded controllers for PS5 and XBox with Hall Effect sticks. \n\nThe old joycon drift was a mechanical problem.  According to the article, the new joycons have been redesigned from the ground up, but are still mechanical. So people are worried about drift (or other wear and tear issues).",
          "score": 12,
          "created_utc": 1744043916.0,
          "replies": [
            {
              "id": "mlw0wqt",
              "author": "Skitz-Scarekrow",
              "body": "Not even that new either. Just recently more affordable. The Sega Saturn 3D(1996) and Dreamcast(~~1999~~ 1998^japan) controllers are Hall Effect.",
              "score": 7,
              "created_utc": 1744044527.0,
              "replies": [
                {
                  "id": "mlw3kwx",
                  "author": "Melodic-Task",
                  "body": "I did not realize it had been around that long.  Wow. The ways consoles try to cut costs and where they do it is fascinating.",
                  "score": 6,
                  "created_utc": 1744045336.0,
                  "replies": [
                    {
                      "id": "mlx6x8a",
                      "author": "_RADIANTSUN_",
                      "body": "It's not just cost cutting, it's QA/support scaling.\n\nHall effect sensors are not some magic perfect failure proof technology. The failure mode is just different. Potentiometers degrade gradually whereas a failed HE sensor fully loses control all at once. With millions of units being manufactured and an industry standard failure rate of like 2.5%, you have the choice of like 25K people out of every million having zero control out of the box vs maybe never even noticing a slightly faulty potentiometer. If you are a peripheral company, this is the only RMA you have to do, not even close to the situation of console manufacturer",
                      "score": 3,
                      "created_utc": 1744057360.0,
                      "replies": []
                    },
                    {
                      "id": "mlw5b3t",
                      "author": "Skitz-Scarekrow",
                      "body": "That's the magic of capitalism, baby!\n\nEdit: realistically, I can't fault a business attempting to make the most profit with standard \"off the shelf\" parts that are \"good enough\". Ridiculous that hall effect isn't included in \"premium\" controllers (Dualsense Edge), but that's another rant.",
                      "score": 2,
                      "created_utc": 1744045866.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mlw71w3",
                  "author": "yayitsdan",
                  "body": "I was so surprised when took apart my Dreamcast controller recently and saw that there was nothing connecting the joystick to the PCB. It's just a magnet and a sensor!",
                  "score": 2,
                  "created_utc": 1744046390.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mlvy4xd",
          "author": "sideways_86",
          "body": "hall effect sensors are the fix for stick drift, its the cheaper analog sticks as used in the original switch that suffer from stick drift",
          "score": 6,
          "created_utc": 1744043663.0,
          "replies": []
        },
        {
          "id": "mlw72ae",
          "author": "mpworth",
          "body": "I think you might be missing the force of the word \"but\" in the title. \"But\" indicates that the idea coming after it is about to somehow oppose/contrast/contradict/mitigate the idea that came before it. It seems like the impression you originally had would make more sense if the title had used \"and\" or \"because\" instead of \"but.\"",
          "score": 1,
          "created_utc": 1744046393.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mlvxwoc",
      "author": "reality_boy",
      "body": "How would Hall effect sensors solve stick drift? It’s a mechanical issue with binding from the centering springs.",
      "score": -20,
      "created_utc": 1744043590.0,
      "replies": [
        {
          "id": "mlvyrmv",
          "author": "OnTheGoatBoat",
          "body": "Look up the sensor? It clearly circumvents the problem by having no physical contact points, using magnets. That’s the whole point",
          "score": 24,
          "created_utc": 1744043863.0,
          "replies": []
        },
        {
          "id": "mlw54o4",
          "author": "Ab47203",
          "body": "Stick drift is from wear on the graphite pads in a thumbstick. Hall effect sticks measure magnetic fields from permanent magnets attached to the thumbstick. It makes it near impossible to get drift with a decent quality calibrated hall effect stick. In a normal thumbstick they measure the resistance on the graphite pad which changes with wear and causes drift. No pad? No drift.",
          "score": 3,
          "created_utc": 1744045811.0,
          "replies": []
        },
        {
          "id": "mlw5ugo",
          "author": "aircooledJenkins",
          "body": "https://www.ign.com/articles/nintendo-switch-joy-con-drift-caused-by-fundamental-design-flaws-says-consumer-group\n\nNah, it's wear on the contacts. Springs are fine.",
          "score": 2,
          "created_utc": 1744046030.0,
          "replies": []
        },
        {
          "id": "mlw2jrb",
          "author": "Toomanydamnfandoms",
          "body": "I can’t give you any kind of science based answer cause I simply don’t know how any of this works, but personally I have noticed my steam deck that uses Hall effect has had zero stick drift. I’ve probably put at least 2k hours into both switch and steam deck, I had to replace my switch joycons twice in that time because of stick drift :( but knock on wood I haven’t had any issues at all with my deck sticks.",
          "score": 0,
          "created_utc": 1744045022.0,
          "replies": []
        }
      ]
    }
  ]
}