{
  "post": {
    "title": "Due to export restrictions, Huawei has been forced to develop a weird hybrid SSD/tape storage drive for data archiving",
    "author": "SUPREMACY_SAD_AI",
    "id": "1h1die6",
    "score": 1241,
    "created_utc": 1732737845.0,
    "selftext": "",
    "num_comments": 66,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1h1die6/due_to_export_restrictions_huawei_has_been_forced/"
  },
  "comments": [
    {
      "id": "lzaxxyq",
      "author": "NorysStorys",
      "body": "I mean tape is still the best medium for long term archival so this isn’t shocking. It’s awful if you need to regularly access data off it but if it’s the kind of archive you need to last decades and it gets accessed a handful of times a year then it honestly still hasn’t been beaten.",
      "score": 403,
      "created_utc": 1732741296.0,
      "replies": [
        {
          "id": "lzc302o",
          "author": "henningknows",
          "body": "Why is tape the best?",
          "score": 71,
          "created_utc": 1732755722.0,
          "replies": [
            {
              "id": "lzc5bxt",
              "author": "HI_IM_VERY_CONFUSED",
              "body": "Price per GB/Tb is unbeatable even by 7.2k hard drives",
              "score": 186,
              "created_utc": 1732756624.0,
              "replies": [
                {
                  "id": "lzc5gvk",
                  "author": "henningknows",
                  "body": "Thanks. I thought maybe it was something like dependable or something. Price makes sense too",
                  "score": 34,
                  "created_utc": 1732756676.0,
                  "replies": [
                    {
                      "id": "lzcdnfr",
                      "author": "NorysStorys",
                      "body": "it also doesn't degrade very fast, like TV shows recorded on tape back in the 60s are still viable and are only getting degraded to the point of issue now in 2024 and much of that wasn't stored in controlled environments so under proper storage conditions tape could very well last a century if stored properly.",
                      "score": 105,
                      "created_utc": 1732759832.0,
                      "replies": [
                        {
                          "id": "lzd3qvr",
                          "author": "AlexHimself",
                          "body": "How many times can you read the data from the tape?",
                          "score": 16,
                          "created_utc": 1732770985.0,
                          "replies": [
                            {
                              "id": "lzdeir6",
                              "author": "NJ_Legion_Iced_Tea",
                              "body": "Unless you're reading data with the fervor of a teenage boy looping *that one part* of the VHS, your fine.",
                              "score": 86,
                              "created_utc": 1732776622.0,
                              "replies": [
                                {
                                  "id": "lzdfck6",
                                  "author": "kamacks",
                                  "body": "First of all how dare you",
                                  "score": 75,
                                  "created_utc": 1732777089.0,
                                  "replies": []
                                },
                                {
                                  "id": "m27lwin",
                                  "author": "Goglplx",
                                  "body": "Shoeshine",
                                  "score": 1,
                                  "created_utc": 1734290460.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lzhugim",
                              "author": "apropostt",
                              "body": "LTO Tapes are spec’d to survive 10,000-20,000 r/w cycles.",
                              "score": 9,
                              "created_utc": 1732843934.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lzevnny",
                  "author": "NorthernerWuwu",
                  "body": "Also, quite durable when stored properly and there's robust and tested infrastructure. It might not be the most efficient by some metrics but when it comes to compliance or risk tolerance, it just works as expected.",
                  "score": 14,
                  "created_utc": 1732805589.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lzc5fny",
              "author": "Thelango99",
              "body": "High data density and lasts for a very long time.",
              "score": 31,
              "created_utc": 1732756663.0,
              "replies": []
            },
            {
              "id": "lzdhp24",
              "author": "Zomunieo",
              "body": "It’s a very stable material.",
              "score": 10,
              "created_utc": 1732778451.0,
              "replies": []
            },
            {
              "id": "lzc7h1g",
              "author": "MaapuSeeSore",
              "body": "Price and stability of data on those tapes, which can stay unpowered in stability\n\nThe same cannot be said for ssd/nvme/flash memory (they need to be powered on periodically , you will lose data after 4-6 months unpowered) \n\nSpinning platters/hdd is in the middle",
              "score": 9,
              "created_utc": 1732757448.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lzdl0qn",
          "author": "DaNuker2",
          "body": "Yeah good for cold storage",
          "score": 8,
          "created_utc": 1732780467.0,
          "replies": []
        },
        {
          "id": "lzd430n",
          "author": "carcalarkadingdang",
          "body": "Long term? You’ll want to exercise the tape. Either read it periodically or migrate to new tape as tape technology improves (LTO2 to now LTO9)",
          "score": 14,
          "created_utc": 1732771147.0,
          "replies": []
        },
        {
          "id": "lzehf1q",
          "author": "glytxh",
          "body": "Pretty sure even the large hadron collider uses tape to dump some of the absurd amounts of data some of its sensors pump out.\n\nTape is in its elements when you have huge datasets.",
          "score": 6,
          "created_utc": 1732799840.0,
          "replies": [
            {
              "id": "lzfwbbs",
              "author": "xxbiohazrdxx",
              "body": "They use a large CEPH cluster. Tape would be abysmal if you want to read that data for anything but a sequential restoration",
              "score": 3,
              "created_utc": 1732817815.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lzdliku",
          "author": "trickman01",
          "body": "*cheapest",
          "score": 3,
          "created_utc": 1732780767.0,
          "replies": []
        },
        {
          "id": "lzi6t7s",
          "author": "feint_of_heart",
          "body": "\"Never underestimate the bandwidth of a station wagon full of tapes hurtling down the highway. \"   \n   \nAndrew S. Tanenbaum",
          "score": 2,
          "created_utc": 1732849269.0,
          "replies": []
        },
        {
          "id": "lzjifj1",
          "author": "None",
          "body": "All Netflix shows are required to be archived onto LTPO tape",
          "score": 1,
          "created_utc": 1732876085.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lzarm8l",
      "author": "Warm_Implement6036",
      "body": "This is common in many hotel chains as well for storing data.",
      "score": 72,
      "created_utc": 1732739303.0,
      "replies": [
        {
          "id": "lzd6dz7",
          "author": "-Badger3-",
          "body": "What kind of data are hotel chains storing?",
          "score": 15,
          "created_utc": 1732772282.0,
          "replies": [
            {
              "id": "lzd8h0l",
              "author": "tuscaloser",
              "body": "The kind of porn you \"accidentally\" ordered is the top priority for archiving.\n\nIn reality, it's likely just data on guest check in/out, guest charges/payments, assigned rooms, room charges, reservations, financial transactions, etc. Normal business stuff one has to maintain record of.",
              "score": 41,
              "created_utc": 1732773335.0,
              "replies": [
                {
                  "id": "lzevro6",
                  "author": "Shadow647",
                  "body": "..that sounds like 1 megabyte a day, at most (but more like few kilobytes)",
                  "score": 16,
                  "created_utc": 1732805630.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lzdzyey",
              "author": "Warm_Implement6036",
              "body": "All of the info listed already is correct, but I wanted to point out that at our property we have one tape for each day of the week, we change it out at midnight with the new business day after performing an audit, and then it gets written over each week ((:",
              "score": 4,
              "created_utc": 1732790226.0,
              "replies": [
                {
                  "id": "lzfjal6",
                  "author": "notjfd",
                  "body": "That sounds like the CCTV (video) tape. LTO (data) tapes hold several TBs and are often actually write-once media. This article is about data tape.\n\nI can hardly imagine a single property generating enough data (other than CCTV) to require any sort of storage cycling routines, and come to think of it, I can't think of any data (other than CCTV) that hotels can feasibly throw out within a week.",
                  "score": 6,
                  "created_utc": 1732813551.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lzfp2jr",
              "author": "unidentifiable",
              "body": "Security videos maybe?  Can't think of anything else that would be significant in file size.",
              "score": 1,
              "created_utc": 1732815448.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lzb2204",
          "author": "cubert73",
          "body": "It only exists in China, so it could be common there but it's by no means global.",
          "score": -79,
          "created_utc": 1732742586.0,
          "replies": [
            {
              "id": "lzc3grs",
              "author": "BestieJules",
              "body": "Most industries still use tape for long term, infrequent access, data storage. A single modern reel can store 15TB for far less money than any other option and they last a very long time.",
              "score": 12,
              "created_utc": 1732755906.0,
              "replies": []
            },
            {
              "id": "lzbcqfc",
              "author": "Dan19_82",
              "body": "I used to work in IBM and they had huge machines with racks of tapes that were automatically picked by an electronic arm. These are way more common than you think.",
              "score": 38,
              "created_utc": 1732746000.0,
              "replies": [
                {
                  "id": "lzd1irk",
                  "author": "None",
                  "body": "The state of Missouri has that too! I saw it on a field trip when I was a kid in the 90s. That robot zipping around was awesome",
                  "score": 3,
                  "created_utc": 1732769931.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lzbjsoq",
              "author": "kiki184",
              "body": "Why are you saying it like it is a fact when you have no clue. Still used in the UK too. Pretty sure in other places as well.",
              "score": 20,
              "created_utc": 1732748453.0,
              "replies": [
                {
                  "id": "lzceqi4",
                  "author": "zaboron",
                  "body": "Did you read the article? The ssd-tape hybrid is a recent development by Huawei. I have strong doubts it's used in the UK right now.",
                  "score": -13,
                  "created_utc": 1732760257.0,
                  "replies": [
                    {
                      "id": "lzcwlbj",
                      "author": "just_a_red",
                      "body": "Ok. For one what is China specific is huawei own version of SSD tape hybrid (MED). You can get seagate or western digital ssd hDD hybrid hard disks in any computer store. And they plus Toshiba offer LTO ( which is stated to be superior )based SSD tape hybrid drives for data centers. So for the question is tape SSD hybrids common around the world. The answer is absolutely yes.",
                      "score": -3,
                      "created_utc": 1732767650.0,
                      "replies": [
                        {
                          "id": "lzd1qjs",
                          "author": "TheRealJimDandy",
                          "body": "Do you have a link to anything about the Toshiba LTO based SSD tape hybrid drive? I’m not able to find anything about that. And the other example you gave “SSD HDD hybrid hard disks” have nothing to do with tape.",
                          "score": 1,
                          "created_utc": 1732770033.0,
                          "replies": [
                            {
                              "id": "lzd4hau",
                              "author": "just_a_red",
                              "body": "For pc it is basically called SSHD ( SSD and HDD combo). There was a similar name for the tape and ssd combo. I will comeback. Need to go through my catalog  where I saw it to get it. \n\nBut what we ended up purchasing is an MLogic mRack DIT which is based on LTO 8 with SSD drives add one. Which is very similar but unintegrated SSD LTO tape combo. It was considerably cheaper than the Toshiba integrated version option that it was competing against",
                              "score": 2,
                              "created_utc": 1732771340.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lzcirn5",
              "author": "Themasterofcomedy209",
              "body": "me when I spread misinformation \n\n\n\nAll you have to do is go to r/datahoarder and find out that’s it’s common to use tape for bulk long term storage worldwide. The US gov does it, random hobbyists do it, it’s extremely normal",
              "score": 6,
              "created_utc": 1732761846.0,
              "replies": [
                {
                  "id": "lzdne14",
                  "author": "hiddenuser12345",
                  "body": "I still remember back when I was in high school, there were Mac programs that let you hook up a camcorder by FireWire and directly write to and read from the tape so you didn’t need to get a dedicated tape drive. Of course, the problem now is no Mac sold today has FireWire, and I can’t find the program anymore so even if I had a cable and could get it to recognize my old Sony, how do I read the data? That’s the problem with patched-together solutions.",
                  "score": 2,
                  "created_utc": 1732781938.0,
                  "replies": []
                },
                {
                  "id": "lzfnxn6",
                  "author": "cubert73",
                  "body": "Read the article. This is not just tape, it's a novel solution.",
                  "score": 1,
                  "created_utc": 1732815072.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lzck7ow",
              "author": "jaguarshark",
              "body": "Tape is absolutely global as was extremely common up to the last decade as many companies move to other data retention strategies. We used to make fun of \"Flape\", the early flash/tape hybrid systems. They were new tech 10 years ago and this was all prolific in USA, latam, and Canada. I sold tons of this stuff.",
              "score": 3,
              "created_utc": 1732762419.0,
              "replies": [
                {
                  "id": "lzfps2r",
                  "author": "cubert73",
                  "body": "*This* device is only available in China, and it's not FLAPE.",
                  "score": 1,
                  "created_utc": 1732815683.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lzcdp8b",
              "author": "monsantobreath",
              "body": "Everyone seems to be down voting you because they forgot the article was about a weird hybrid ssd tape form of storage. They didn't even read the title properly.",
              "score": 2,
              "created_utc": 1732759851.0,
              "replies": [
                {
                  "id": "lzcxxvg",
                  "author": "NorysStorys",
                  "body": "Again Flash-tape hybrid has been a thing for quite a while, the article itself is a flawed piece of journalism that’s trying to suggest that China is resorting to using tape where in reality Flash-tape hybrid drives are common place in super high density data centre storage globally as the flash mitigates the slow read/write speeds that tape has inherent to it.",
                  "score": 7,
                  "created_utc": 1732768264.0,
                  "replies": []
                },
                {
                  "id": "lzfnpwe",
                  "author": "cubert73",
                  "body": "Yeah. The article itself says this device is only available in China, but you can't expect people to *read. 🤷‍♂️*",
                  "score": 1,
                  "created_utc": 1732815002.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lzen79i",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1732802295.0,
              "replies": [
                {
                  "id": "lzfo20q",
                  "author": "cubert73",
                  "body": "Try reading the article, sweetie. This isn't just tape.",
                  "score": 0,
                  "created_utc": 1732815113.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lzcnb06",
      "author": "TarmacTartoo12",
      "body": "Hmmm takes me back to the late 80s with an AS400 tape backup I had to do every night and then mail it registered to Corporate ! Haha",
      "score": 6,
      "created_utc": 1732763665.0,
      "replies": [
        {
          "id": "lzdy7pb",
          "author": "t3rmina1",
          "body": "Takes me back to yesterday at the bank. Oh wait...",
          "score": 4,
          "created_utc": 1732789083.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lzcl2vm",
      "author": "Car-face",
      "body": ">Sounds neat, yes? Well, I have a few concerns. While modern NAND flash memory cells are very reliable, that type of storage doesn't have anything like the same lifespan as magnetic tape does. That means there's a good chance that the MED becomes junk long before a normal tape drive would because the internal SSD has failed.\n\nbut SSD failure is only going to lose the most recent \"warm\" data, no? much like most backups, there's a recent time period you lose for a failure - swapping out the SSD module might not be as easy as plug and play, but there's really no reason for it to be \"linked\" to the tape drive considering they need to be fully independent anyway.\n\n>Still, needs must as the Devil drives, or so the saying goes, and Huawei's only doing this because it feels it has no choice. According to Block and Files' report, the first range of MEDs will arrive in 2025, with capacities up to 72 TB, with a power demand of just 10% of that required by equivalent disk drives.\n\nI'm confused - are there any enterprise 72TB HDD on the market today? As far as I'm aware the largest is a 32TB drive. And 10% of the power demand seems like a pretty big benefit for enterprise at scale.\n\nIt honestly sounds like Huawei has come up with a neat intermediate solution between spinning platters and pure tape drives for occasional access data for SME, but for some reason it needs to be framed as \"no, no, no - they *must* be doing this because of sanctions! It's a bad thing!\"",
      "score": 19,
      "created_utc": 1732762766.0,
      "replies": [
        {
          "id": "lzcyeeg",
          "author": "NorysStorys",
          "body": "It’s just bad journalism pushing a very American centric propaganda line. It’s just a modern tech version of ‘the soviets are still using animals to Plow fields, look at how great American tractors are!’",
          "score": 18,
          "created_utc": 1732768478.0,
          "replies": [
            {
              "id": "lzd99nq",
              "author": "Parking-Historian360",
              "body": "And the modern tape drive has been in development and wide use by a few American companies for a few years. I remember seeing them at least 6 years ago or so by IBM. So  they haven't come up with anything new or inventive that doesn't already exist.",
              "score": 2,
              "created_utc": 1732773753.0,
              "replies": []
            },
            {
              "id": "lzhi9zp",
              "author": "Tasty-Traffic-680",
              "body": "I read the entire article. Aside from questioning the long-term reliability of SSDs (which can be mitigated with redundant/mirrored storage schemes) I don't see this mentioned in a negative light at all. The author seems excited for it.\n\nHow the hell is that your takeaway?",
              "score": 0,
              "created_utc": 1732838707.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lzezr79",
          "author": "Tasty-Traffic-680",
          "body": "They're literally doing it because of sanctions. Nobody is allowed to sell them high capacity hard drives.\n\nhttps://www.google.com/amp/s/www.bbc.com/news/business-65332208.amp",
          "score": 4,
          "created_utc": 1732807051.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lzchpy7",
      "author": "JustCopyingOthers",
      "body": "Future Techmoan video.",
      "score": 10,
      "created_utc": 1732761433.0,
      "replies": []
    },
    {
      "id": "lzd87ql",
      "author": "elite_haxor1337",
      "body": "i mean. this is certainly not the first time",
      "score": 3,
      "created_utc": 1732773201.0,
      "replies": []
    },
    {
      "id": "lze0xam",
      "author": "OperationMobocracy",
      "body": "I've long thought that something like this makes a ton of sense.  Storage tiering isn't a new idea, I remember reading about hierarchical storage systems 20 some years ago that combined cold archiving to tape with hot/warm HDD access in a single file system.  Hell, the idea is used with OneDrive and other cloud storage setups for \"download on use\" file sync.  Compellent SANs would do more performance oriented tiering, spreading blocks across SSDs, 10k RPM, 7200 RPM and 5400 RPM drives.  Even Microsoft has had a tiered storage setup available since Windows 2012.\n\nWhere this gets more interesting would be how much intelligence can be baked into the drive shelf itself in combination with the size of the SSD for hot/warm data so that you could get very good predictive transition from tape to SSD.  It basically comes down to something like if you need block N, X% of the time you also need block N2 and N3, so we'll grab block N first and then grab blocks N2 and N3 after so that if you need them they're already available on SSD.  With large enough SSDs, you can afford to have the X% of time be a pretty low number.   And with enough compute intelligence in the system, you could get much more sophisticated analytics on when to pull data, when to write it, etc.\n\nThe hard part might be keeping the data on tape from getting fragmented.  Like if you get your block N and make some change when its on SSD, great, but you'll want that on tape eventually but you can't write N' in the same place N was located, it has to get written in a spot further down the tape reel where the tape hasn't been written.  For some very infrequent blocks this might not be a big deal, but over time it seems like there would be a lot of tape movement and potential for shoeshining.  Ideally you might want to rewrite the entire tape periodically so that the data was stored in as few feet of tape as necessary and with the most likely needed blocks up front, but this seems hard to do without a second SSD/tape in the mix.",
      "score": 3,
      "created_utc": 1732790852.0,
      "replies": []
    },
    {
      "id": "lzfb5to",
      "author": "DenormalHuman",
      "body": "Tape read speeds are great. Seek times are atrocious. And hybrid disk/ssd/etc.. front end,  tape back-end storage appliances have been around for decades.\n\nAnd 45TB compressed per tape isn't to be sniffed at.",
      "score": 3,
      "created_utc": 1732810893.0,
      "replies": []
    },
    {
      "id": "lzfwwdy",
      "author": "ExplosiveDiarrhetic",
      "body": "Boo fucking hoo",
      "score": 3,
      "created_utc": 1732818008.0,
      "replies": []
    },
    {
      "id": "lzhf1my",
      "author": "opi098514",
      "body": "Tape storage has always been a thing and is still a huge thing for long term storage. This isn’t new.",
      "score": 1,
      "created_utc": 1732837352.0,
      "replies": []
    },
    {
      "id": "lzuor1n",
      "author": "GreggAlan",
      "body": "What I want is a standard SATA LTO drive for a desktop PC 5.25\" bay, or an external USB 3 one, at an affordable price. The tapes are available at decent prices but the drives are insanely high priced and require weird controllers nobody has in a normal PC. LTO tape is the only backup media capable of holding a whole current hard drive's data, uncompressed, on a single piece of media.\n\nSome company needs to tap the prosumer, power user, and SOHO markets with this.",
      "score": 1,
      "created_utc": 1733048184.0,
      "replies": []
    },
    {
      "id": "m0jg95j",
      "author": "BrissBurger",
      "body": "Mag tape! Wow, that's going back a bit ('scuse the pun).  I wonder how many FTPI's they're getting.  Personally I preferred paper-tape back in the day - you could read it with your eyes, plus the punchings made great confetti.",
      "score": 1,
      "created_utc": 1733407784.0,
      "replies": []
    },
    {
      "id": "lzes1vk",
      "author": "None",
      "body": "“That won’t fail”. - said no one ever",
      "score": -2,
      "created_utc": 1732804232.0,
      "replies": [
        {
          "id": "lzfjs0f",
          "author": "notjfd",
          "body": "Of course it will fail. But if you know the failure rate you can use multiple tapes in a redundant scheme to eliminate data loss.",
          "score": 1,
          "created_utc": 1732813709.0,
          "replies": []
        }
      ]
    }
  ]
}