{
  "post": {
    "title": "AMD’s new Ryzen Z2 CPUs boost gaming handhelds, if you buy the best one",
    "author": "Sariel007",
    "id": "1hvra7y",
    "score": 119,
    "created_utc": 1736256082.0,
    "selftext": "",
    "num_comments": 15,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hvra7y/amds_new_ryzen_z2_cpus_boost_gaming_handhelds_if/"
  },
  "comments": [
    {
      "id": "m5v8ivk",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736256083.0,
      "replies": []
    },
    {
      "id": "m5w4li8",
      "author": "MadOrange64",
      "body": "New CPU has better performance, who would’ve known",
      "score": 43,
      "created_utc": 1736266921.0,
      "replies": [
        {
          "id": "m5wj9iy",
          "author": "Sk1-ba-bop-ba-dop-bo",
          "body": "read the article  \n\\> The Ryzen Z2, on the other hand, appears to be exactly the same chip as the Ryzen Z1 Extreme, but with a different name.",
          "score": 31,
          "created_utc": 1736271232.0,
          "replies": [
            {
              "id": "m5xp91g",
              "author": "Aleashed",
              "body": "Lol, AM effing D",
              "score": 9,
              "created_utc": 1736283350.0,
              "replies": [
                {
                  "id": "m5zi67p",
                  "author": "etherealcaitiff",
                  "body": "Hey, they made a chip that works and is stable. That's more than Intel is doing, so why bother improving.",
                  "score": 12,
                  "created_utc": 1736304063.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m5wb8c7",
          "author": "Revoldt",
          "body": "Intel missed that memo with their new [Core Ultra](https://www.techpowerup.com/review/intel-core-ultra-9-285k/21.html) line…",
          "score": 12,
          "created_utc": 1736268878.0,
          "replies": []
        },
        {
          "id": "m5xsaxr",
          "author": "Felicity_Here",
          "body": "I was thinking the same. Fluffy marketing speak.",
          "score": 0,
          "created_utc": 1736284225.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5wn24g",
      "author": "wicktus",
      "body": "Frankly i am waiting for RDNA4 and AI upscaling (FSR4) to get in those handhelds before considering getting one\n\nI suspect Valve is working on a custom RDNA 4 SoC with AMD, I don’t see them refreshing SD1 with Z2, wouldn’t make sense",
      "score": 12,
      "created_utc": 1736272331.0,
      "replies": [
        {
          "id": "m60o6kp",
          "author": "MysteriousDesk3",
          "body": "I think the more powerful they make these the less devs will optimise their games and up the graphical intensity, that’s exactly the way it’s always been for desktop GPUs.\n\nIf you want to game on the go just get one. My Legion GO absolutely kicks ass, getting 60fps on an older but gorgeous title like Death Stranding at 800p is possible, especially if you’re running Bazzite/SteamOS.",
          "score": 7,
          "created_utc": 1736323368.0,
          "replies": []
        },
        {
          "id": "m5zqqzp",
          "author": "EVMad",
          "body": "The current Steam Deck is very capable. I played through Indiana Jones and the Great Circle on mine and it was a fine experience. With the size of the screen, even low settings still looked great and I capped the frame rate to 30fps which kept things smooth. On a small screen you would be amazed how well 30fps plays so I cap most of my games at that.",
          "score": 2,
          "created_utc": 1736307129.0,
          "replies": [
            {
              "id": "m61m61a",
              "author": "wicktus",
              "body": "Exactly, SD 1 is working just fine and can totally stay relevant until a custom rdna 4 SoC is mass produced\n\nIndiana jones, fantazio, elden ring,…\nOnly saw complaints around dragon’s dogma 2 and maybe MH wilds but that’s on the RE engine issue",
              "score": 0,
              "created_utc": 1736342462.0,
              "replies": []
            },
            {
              "id": "m5zvung",
              "author": "markianw999",
              "body": "Stop trying to make 30 fps aceptable.lol its not 2002",
              "score": -10,
              "created_utc": 1736309103.0,
              "replies": [
                {
                  "id": "m6046tp",
                  "author": "EVMad",
                  "body": "It's very acceptable on a small OLED screen due to the small size. Consoles still often have 30fps options, it's really not that bad.",
                  "score": 7,
                  "created_utc": 1736312625.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m6706h1",
      "author": "blackburnduck",
      "body": "New switch patent includes some different upscale models, including model upscaling and filesize… but the crux of the problem is that devs got lazy as f.\n\nCompare Crysis, Mirrors Edge, battlefield 2042 or even the modern red dead 2, Star wars battlegrounds 2 with new games like star wars outlaws, FF 7 rebirth, silent hill remake… how come that we need massive gpus for games that only look marginally better (or even downright uglier) than things released 5, 10y ago?\n\nEverything is now a mishmash of TA artifacts while nintendo gave us Tears of the Kingom and Xenoblade 3 on a bloddy tegra that is a mobile chip from 2015.\n\nMeanwhile my 3080 ti struggles with jedi survivor, we need player mods to make elden ring stable, and everything now needs dlss to hit stable frames at 60fps… for games that dont really look that good…",
      "score": 1,
      "created_utc": 1736410041.0,
      "replies": []
    },
    {
      "id": "m6j61w4",
      "author": "SPARTAN1666",
      "body": "Waiting for a Day when the chip can directly run Cyberpunk at High/Ultra at 1080p 60FPS without all the AI enhancements",
      "score": 1,
      "created_utc": 1736571760.0,
      "replies": []
    }
  ]
}