{
  "post": {
    "title": "New FPGA-powered retro console re-creates the PlayStation, CD-ROM drive optional | Works with original PS1 accessories, and supports other MiSTer FPGA cores.",
    "author": "chrisdh79",
    "id": "1ibnb4g",
    "score": 404,
    "created_utc": 1738019982.0,
    "selftext": "",
    "num_comments": 38,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ibnb4g/new_fpgapowered_retro_console_recreates_the/"
  },
  "comments": [
    {
      "id": "m9jm7v2",
      "author": "MrRoboto12345",
      "body": "I like how the color schemes mirror the PSOne, PS1 dev kit, and Net Yaroze respectively",
      "score": 31,
      "created_utc": 1738021047.0,
      "replies": []
    },
    {
      "id": "m9k89eb",
      "author": "rumski",
      "body": "This comment thread is way better than the one yesterday full of “wHy NOt JUst EMUlaTe?!”",
      "score": 24,
      "created_utc": 1738028115.0,
      "replies": [
        {
          "id": "m9mkzu3",
          "author": "None",
          "body": "I mean serious damage could be done with 180$. A Pi and any DualShock 3,4,5 controllers and a sdd sell for a lot less. As someone who’s been emulating since snes9x the price point seems absolutely ridiculous for a console whose library is mostly already available on PSN or recently remastered. I feel this is for someone who wants to pay $180 to plug in their old controllers to play Tomba.\n          \nFor $180 I’d probably crack or buy a cracked ps3.",
          "score": -2,
          "created_utc": 1738068212.0,
          "replies": [
            {
              "id": "m9nf1nd",
              "author": "sqparadox",
              "body": "I tend to agree with you, but retro gaming tends to fall into two camps: \"modernize/improve\" and \"exactly as it was\". \n\nEmulators are the \"modernize/improve\" branch, they suck at \"exactly as it was\" if for no other reason than *they are emulated,* they will never be the same as real hardware.\n\nThis is very much for the \"exactly as it was\" people, and they tend to be willing to spend more, because the alternative is usually old consoles that are now rare and more expensive.\n\nI think this is cool just for the fact they're using an FPGA. I see posts about all the hardware that's just running emulators and can't help but think \"what's the point? I could do that myself.\"",
              "score": 23,
              "created_utc": 1738078504.0,
              "replies": [
                {
                  "id": "m9tp4cf",
                  "author": "None",
                  "body": "I agree with “exactly how it was” until we get to the 3D era, games like legend of dragoon look like crap.",
                  "score": 3,
                  "created_utc": 1738160172.0,
                  "replies": [
                    {
                      "id": "m9yzq9j",
                      "author": "DatTF2",
                      "body": "Yeah personally a lot of 3D titles look better upscaled and with various fixes.",
                      "score": 1,
                      "created_utc": 1738219793.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9pz3cd",
              "author": "zebrasmack",
              "body": "I'm guessing you aren't a fan of console mods and would prefer to just emulate?",
              "score": 2,
              "created_utc": 1738104140.0,
              "replies": [
                {
                  "id": "m9tp70q",
                  "author": "None",
                  "body": "I would love a modded 360 or ps4",
                  "score": 1,
                  "created_utc": 1738160197.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9q1wq5",
      "author": "zebrasmack",
      "body": "For those that don't know, this is not emulation. Not in the way people understand it.\n\n\"emulators\" basically take the code given to them by the game, and translates that code to something modern your computer can understand. It's essentially taking one language and converting it to another, best as they can. This is why some emulators struggle with certain games or aspects of the game, like maybe the sound is messed up, or there's not a slowdown where there was one originally. It's an imperfect process. Still absolutely brilliant what people have pulled off with emulation, but it isn't the original hardware or software.\n\nThis is an FPGA. Field-Programmable Gate Array. With an FPGA you can reprogram the chip to work however you'd like as often as you'd like. Which means you can reprogram the chip to replicate and operate just like original game hardware and their various chip architectures. in FPGA land, we call these \"cores\" instead of \"emulators\" because they don't emulate the code, they replicate how the hardware and chips worked in the original console. So when you load a game using an FPGA, you aren't translating. you're just playing the original game, natively.\n\nNow I glossed over a few things here and there, but that's the gist of it.",
      "score": 17,
      "created_utc": 1738104983.0,
      "replies": [
        {
          "id": "m9qpwwn",
          "author": "SirPancakesIII",
          "body": "This person FPGAs. I use FPGAs all the time and never really thought about their application in console development. \n\nNormally they aren't used much because of the extra expense of them, but can see the use case for something like this.",
          "score": 6,
          "created_utc": 1738112479.0,
          "replies": [
            {
              "id": "m9sz1dy",
              "author": "connor42",
              "body": "If this is the first you’re hearing about gaming applications have a look at Analogue’s range of FPGA based consoles\n\nAlso the very budget FPGBC (FunnyPlaying GameBoy Color)",
              "score": 2,
              "created_utc": 1738149347.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9zwgl8",
          "author": "Green-Salmon",
          "body": "Would it be possible to change cores on the fly? Kinda like retroarch can change it's emulation core to emulate pretty much everything.",
          "score": 1,
          "created_utc": 1738238910.0,
          "replies": [
            {
              "id": "ma03ybu",
              "author": "zebrasmack",
              "body": "yes, the OS of the MiSTER lets you switch to a different core with a few button presses. a far far faaaar easier to navigate menu than retroarch.\n\n\nthis particular fpga the MiSTER uses can only do up to the playstation, the n64, and sega saturn. The chip is not powerful enough to ever play ps2 or gamecube or dreamcast games, so just be aware of its limits. sega saturn support is playable but not 100% yet, but should be in time.\n\n\n\nbut it can also do things like arcade machines and snes and older stuff, provided someone has put in the major effort of developing and releasing a core.\n\n\n\nthis psx fpga is a modified version of his other product, MiSTER Pi: https://m.youtube.com/watch?v=shKwRz9MD-A This product doesn't have a SNAC port, but has a permanent psx SNAC ports. which basically means zero latency when using psx controllers, like original hardware.",
              "score": 2,
              "created_utc": 1738242130.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9jszkx",
      "author": "drmirage809",
      "body": "Gotta love it having a design very reminiscent of the original PlayStation. That thing was a bit of a clunky grey box, but it worked. The optional CD drive is very cool too. Allows you to easily play your original games. I can imagine that the motors in the original CD drive might not be in the best of health after 30 years.",
      "score": 11,
      "created_utc": 1738023239.0,
      "replies": []
    },
    {
      "id": "m9jzz4x",
      "author": "SomeBoxofSpoons",
      "body": "If this is actually everything they’re advertising it as, then the price is an absolute steal.",
      "score": 6,
      "created_utc": 1738025469.0,
      "replies": []
    },
    {
      "id": "m9jno92",
      "author": "shootamcg",
      "body": "Preordered one, can’t wait.",
      "score": 3,
      "created_utc": 1738021519.0,
      "replies": []
    },
    {
      "id": "m9jplrg",
      "author": "Chazybaz13",
      "body": "Good luck trying to find one now that preorders are sold out",
      "score": 5,
      "created_utc": 1738022147.0,
      "replies": [
        {
          "id": "m9jrpi7",
          "author": "HiddenChar",
          "body": "its still available for preorder, just not for the $150 batch 1 price",
          "score": 5,
          "created_utc": 1738022828.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9m8eu4",
      "author": "dylan_1992",
      "body": "I’ve seen these being used in arcades at JFK (along gaming PC’s). Interesting as I thought that’d be illegal.",
      "score": 2,
      "created_utc": 1738061936.0,
      "replies": [
        {
          "id": "m9ml2mb",
          "author": "Biscuits25",
          "body": "If they are using original game discs its 100% legal.",
          "score": 4,
          "created_utc": 1738068245.0,
          "replies": [
            {
              "id": "m9n4pas",
              "author": "dylan_1992",
              "body": "The machines were too small for disks, and you choose each game through a virtual menu.",
              "score": 3,
              "created_utc": 1738075338.0,
              "replies": [
                {
                  "id": "m9o5l79",
                  "author": "Mooseymax",
                  "body": "If they ripped the rom from a disk they own then no problem",
                  "score": 2,
                  "created_utc": 1738086022.0,
                  "replies": []
                },
                {
                  "id": "m9wz1oe",
                  "author": "nicetriangle",
                  "body": "Was probably a Playstation Classic. Sony released a mini PS1 that has like 20 games baked in and doesn't use discs. You can buy one right now. It's basically an emulator box with 20 roms officially sold by Sony.",
                  "score": 2,
                  "created_utc": 1738193300.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9vvfz6",
      "author": "tensei-coffee",
      "body": "seems pointless unless u have a disc collection. ill stick with emulation and all its benefits and convenience. ",
      "score": 1,
      "created_utc": 1738182272.0,
      "replies": []
    },
    {
      "id": "m9olunr",
      "author": "None",
      "body": "Quitting the retro scene was the best decision I ever made",
      "score": 1,
      "created_utc": 1738090446.0,
      "replies": []
    },
    {
      "id": "m9mxt4g",
      "author": "P00slinger",
      "body": "No optical out is a bummer.",
      "score": 1,
      "created_utc": 1738073046.0,
      "replies": []
    },
    {
      "id": "m9k2pdl",
      "author": "ThinkExtension2328",
      "body": "Lawsuits in 3… 2… 1…\n\n\nThat thing is tooo beautiful to be aloud to live by Sony.",
      "score": -8,
      "created_utc": 1738026342.0,
      "replies": [
        {
          "id": "m9k9u5k",
          "author": "flatroundworm",
          "body": "Lawsuits based on what? It’s not violating any copyright and design patents on the ps1 are long expired.",
          "score": 12,
          "created_utc": 1738028625.0,
          "replies": [
            {
              "id": "m9kahqj",
              "author": "ThinkExtension2328",
              "body": "Oooo I’m listening, won’t Sony try pulling a dmca for the software tho?",
              "score": -8,
              "created_utc": 1738028835.0,
              "replies": [
                {
                  "id": "m9kb0xb",
                  "author": "flatroundworm",
                  "body": "There is no Sony IP in the software.",
                  "score": 8,
                  "created_utc": 1738029007.0,
                  "replies": [
                    {
                      "id": "m9kb5ua",
                      "author": "ThinkExtension2328",
                      "body": "Noice. Will it play the original disks? If so I think I want one.",
                      "score": -1,
                      "created_utc": 1738029052.0,
                      "replies": [
                        {
                          "id": "m9kbgaw",
                          "author": "flatroundworm",
                          "body": "To play the original disks it’ll need the dock too (sold separately, aiming for about $40 - includes the disk drive, four more usb ports, and an m.2 nvme ssd slot)",
                          "score": 3,
                          "created_utc": 1738029145.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9lub6f",
      "author": "MetaVaporeon",
      "body": "waste of money whats the point of making the disk optional",
      "score": -8,
      "created_utc": 1738052998.0,
      "replies": [
        {
          "id": "m9o5s10",
          "author": "Mooseymax",
          "body": "Because I’m going to run all mine from an SD card…",
          "score": 7,
          "created_utc": 1738086074.0,
          "replies": []
        },
        {
          "id": "m9payy8",
          "author": "TheRealGenkiGenki",
          "body": "yes let me take out my precious final fantasy seven, OH SHIT I SCRATCHED IT.",
          "score": 5,
          "created_utc": 1738097354.0,
          "replies": []
        }
      ]
    }
  ]
}