{
  "post": {
    "title": "AMD Ryzen 9 9950X3D CPU benchmark leaked, expected to launch in early 2025 | It will be AMD's flagship Zen 5 gaming processor",
    "author": "chrisdh79",
    "id": "1glscy4",
    "score": 800,
    "created_utc": 1730991499.0,
    "selftext": "",
    "num_comments": 156,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1glscy4/amd_ryzen_9_9950x3d_cpu_benchmark_leaked_expected/"
  },
  "comments": [
    {
      "id": "lvwzkxk",
      "author": "GreenLanturn",
      "body": "Early 2025 as in before or after the tariffs?",
      "score": 227,
      "created_utc": 1730995668.0,
      "replies": [
        {
          "id": "lvx663c",
          "author": "None",
          "body": "This is the same question to why I am looking in the comments lol",
          "score": 67,
          "created_utc": 1730997578.0,
          "replies": [
            {
              "id": "lw0og2x",
              "author": "nullstring",
              "body": "I thought tariffs were for Chinese products. How much of an amd chip is Chinese?\n\nOr am I missing something?",
              "score": 8,
              "created_utc": 1731035920.0,
              "replies": [
                {
                  "id": "lw0oo8y",
                  "author": "-Aeryn-",
                  "body": "They're designed specifically to be produced in Taiwan (which the US considers to be part of China), and Trump has promoted tarriffs for far more imports than just China as well.",
                  "score": 27,
                  "created_utc": 1731036002.0,
                  "replies": [
                    {
                      "id": "lw0pd9c",
                      "author": "nullstring",
                      "body": "I didn't realize that. I'll have to look into this. \n\nI hope we get some in depth news coverage. I wonder how this will impact black Friday.",
                      "score": 1,
                      "created_utc": 1731036251.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lvyq3uc",
          "author": "None",
          "body": "[deleted]",
          "score": 79,
          "created_utc": 1731013302.0,
          "replies": [
            {
              "id": "lw07vi5",
              "author": "FlatulenceConnosieur",
              "body": "Amen. People say prices are an issue and vote for the candidate who wants to put tariffs on everything. I honestly do not understand what is happening in the US.",
              "score": 24,
              "created_utc": 1731030250.0,
              "replies": [
                {
                  "id": "lw0j4cc",
                  "author": "Viscount_Disco_Sloth",
                  "body": "Farming and Manufacturing both went into recession because of Trump tariffs, but that was in late 2019. A few months later Covid happened and it all got lumped together in the public consciousness.\nhttps://www.reuters.com/article/economy/us-manufacturing-dives-to-10-year-low-as-trade-tensions-weigh-idUSKBN1WG4IT/\nhttps://www.npr.org/sections/thesalt/2019/12/31/790261705/farmers-got-billions-from-taxpayers-in-2019-and-hardly-anyone-objected",
                  "score": 23,
                  "created_utc": 1731034058.0,
                  "replies": []
                },
                {
                  "id": "lw1s540",
                  "author": "The8Darkness",
                  "body": "People are literally too stupid. They do not read up on anything or dont even care, they vote mostly based on who promised the moon and beyond in their marketing.\n\nSame thing in germany. Like my mother is working near minimum wage and is close to pension, actually wants to go early into pension, but owns a house with solar, though its close to a river so its at risk of flooding if climate keeps getting worse. Yet she votes for those people that want to cut benefits for lower income people, are against solar (so will probably cut tax benefits for it, last time I checked they literally had politicians that say maybe the reason for climate change is solar collecting the sun energy and thus heating the planet lol), want to raise pension age requirements and dont give a fuck about climate change and especially not floodings. Oh and also while I havent read much about tariffs with them, they want to cut farming subsidies so most basic food becomes way more expensive.\n\nWhy she votes for them? Their tiktoks are great at blaming immigrants for everything and promising the moon.\n\nBtw. caselabs went out of business because of trump back then already.",
                  "score": 10,
                  "created_utc": 1731054849.0,
                  "replies": []
                },
                {
                  "id": "lw1sdhs",
                  "author": "DongLife",
                  "body": "“The forest was shrinking, but the trees kept voting for the axe; for the axe was clever and convinced the trees that because his handle was made of wood, he was one of them.”  People saw trump in McDonalds and thought he was for working people.",
                  "score": 3,
                  "created_utc": 1731054999.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvytkiw",
              "author": "imakesawdust",
              "body": "Don't worry, those voters are still going to find a way to blame the Democrats.",
              "score": 46,
              "created_utc": 1731014286.0,
              "replies": [
                {
                  "id": "lvzu6c3",
                  "author": "heliphael",
                  "body": "Then you ~~harass~~ politely and firmly remind them Republicans control everything.",
                  "score": 16,
                  "created_utc": 1731025648.0,
                  "replies": [
                    {
                      "id": "lw0ox6n",
                      "author": "Dr_Jabroski",
                      "body": "sir that only works for people with longer memories than a goldfish and more critical thinking skills than a rock.",
                      "score": 19,
                      "created_utc": 1731036090.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lw0g92k",
                  "author": "TheBigLeMattSki",
                  "body": "\"This is still the aftershocks from BiDeNoMiCs!\"",
                  "score": 8,
                  "created_utc": 1731033083.0,
                  "replies": []
                },
                {
                  "id": "lw1kcz0",
                  "author": "_Dreamer_Deceiver_",
                  "body": "\"it's all your fault, if you had just been better we won't have voted for him\"\n\n\nStuff like that?",
                  "score": 3,
                  "created_utc": 1731050071.0,
                  "replies": [
                    {
                      "id": "lw3g6jb",
                      "author": "imakesawdust",
                      "body": "Not even that.  Even if the GOP controls all 3 houses, Trump will still blame the \"Do Nothing Democrats\" when things go sideways.  He did during his first term.  He'll do it again.  Because his base eats it up.",
                      "score": 3,
                      "created_utc": 1731081098.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw0a18e",
              "author": "None",
              "body": "Yep hope these Nazi fuks that voted for him go broke",
              "score": 1,
              "created_utc": 1731030967.0,
              "replies": []
            },
            {
              "id": "lw0nbhp",
              "author": "carpuzz",
              "body": "yeah count that as a hit back for printing dollars and abusing  on dolars monopoly on world trade.",
              "score": 1,
              "created_utc": 1731035525.0,
              "replies": []
            },
            {
              "id": "lvyxukx",
              "author": "Plank_With_A_Nail_In",
              "body": "You won't be spending your savings for another 25 to 30 years.\n\nEdit: sorry I thought you meant real savings i.e. a pension, not saving for a toy.",
              "score": -19,
              "created_utc": 1731015501.0,
              "replies": [
                {
                  "id": "lw2814p",
                  "author": "Theragord",
                  "body": "Yea, because of regular prices being Higher so he needs to save more instead of being able to spend it.",
                  "score": 1,
                  "created_utc": 1731064688.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvze2uc",
              "author": "revival-tnx",
              "body": "Savings is for saving though. You shouldn’t be spending it, especially with increasing prices.",
              "score": -13,
              "created_utc": 1731020353.0,
              "replies": [
                {
                  "id": "lvzj1iw",
                  "author": "rolfraikou",
                  "body": "I'm saying waste it all before prices go back up. I could have invested in tools and things that would have been useful to my future. Instead I save it so it can be devalued time and time again.",
                  "score": 6,
                  "created_utc": 1731021946.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvzhm1b",
          "author": "ADHD_Supernova",
          "body": "Come on 5090! 🤞🤞",
          "score": 3,
          "created_utc": 1731021479.0,
          "replies": []
        },
        {
          "id": "lvxp8lb",
          "author": "YouInternational2152",
          "body": "If I remember my graduate school economics... The president can only initiate tariffs for 150 days. After that, Congress has to get involved.",
          "score": 9,
          "created_utc": 1731002931.0,
          "replies": [
            {
              "id": "lvxqwaz",
              "author": "None",
              "body": "Do you mean the Republican House and Republican Senate who listen to Trump in everything? Tarrifs forever, baby!! 😅",
              "score": 111,
              "created_utc": 1731003402.0,
              "replies": [
                {
                  "id": "lvxwc6v",
                  "author": "Dirty_Dragons",
                  "body": "We are fucked",
                  "score": 48,
                  "created_utc": 1731004908.0,
                  "replies": [
                    {
                      "id": "lvzwykk",
                      "author": "_Lucille_",
                      "body": "Just in time to help two Supreme Court justices pass the torch to make sure the impact lasts another few decades.",
                      "score": 13,
                      "created_utc": 1731026577.0,
                      "replies": []
                    },
                    {
                      "id": "lvzq2i6",
                      "author": "csgothrowaway",
                      "body": "Well hey! At least our protest votes will make those multi-millionaire Democrat politicians broken hearted that they couldn't be our leaders. They're really going to have to pay for it this time, as they sit on their yachts, sip wine and watch from afar, while we all work until we're 75 with no health benefits, no Social Security and less civil rights.\n\nI'm sure it'll be worth it when the Democrat politicians learn their lesson and run in the next election...that totally wont have a ton of election interference or redistricting or voter suppression or a million ways a MAGA Senate, House, Supreme Court and appointed judges in every land can find ways to make sure a Democrat never holds the presidency again. And we'll never know *how* they do it because there's no longer any checks and balances. Just take the billionaires at their word that they aren't going to run us into the fucking ground, I'm sure it'll work out. Its not like they have a history of lying and trying to duplicitously take everything we have, right?\n\nAnd I'll just say one last thing - when January comes around and the office changes hands - I'd be really cautious about what you say on the phone and what you type on Discord and whatever else. We're heading towards a time where your words can be used against you and we just elected people actually worse than the Republicans that gave us the Patriot Act. And they've aligned themselves with billionaires that are absolutely going to want backdoors into every bit of technology, so they can feed their corporations with our private data. But hey! At least we got to stick it to the Democrats.",
                      "score": 13,
                      "created_utc": 1731024282.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvxvyhs",
              "author": "UnabashedAsshole",
              "body": "Is there anything preventing him from reinstating the tariffs after they expire?",
              "score": 7,
              "created_utc": 1731004802.0,
              "replies": [
                {
                  "id": "lvyd5qf",
                  "author": "ckal09",
                  "body": "Literally nothing is going to prevent this fascist traitor from doing anything he wants. Our country is so fucked",
                  "score": 25,
                  "created_utc": 1731009619.0,
                  "replies": [
                    {
                      "id": "lw07kpm",
                      "author": "kjlo5",
                      "body": "Maybe we should have a court above all other courts that can handle legal matters of this scale and make judgement on the legality of situations like this. Some sort of a Supreme Court if you will. Maybe… oh wait.",
                      "score": 9,
                      "created_utc": 1731030150.0,
                      "replies": [
                        {
                          "id": "lw08vpg",
                          "author": "ckal09",
                          "body": "One of the checks and balances enabling him lol",
                          "score": 6,
                          "created_utc": 1731030583.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvy36nx",
              "author": "TheOvy",
              "body": "Considering that many Trump tariffs are still in place, I'm not sure this is true.\n\nThat said, the law that allows a president to unilaterally slap a tariff on something without congress's approval is supposed to be for items related to national security. That said, it seems like he's gotten away with using it however the fuck he pleases, because he put it on goddamn washing machines, which immediately got more expensive, and have stayed more expensive ever since.",
              "score": 2,
              "created_utc": 1731006811.0,
              "replies": [
                {
                  "id": "lw1goyc",
                  "author": "ICC-u",
                  "body": "Washing Machines? Does the US have a large manufacturing base for those that needed protection?",
                  "score": 1,
                  "created_utc": 1731047987.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvyxob1",
              "author": "Plank_With_A_Nail_In",
              "body": "The rules around who can create tariffs and for how long is politics not economics. Only 5% of the worlds population lives in the USA why would an economics course teach such a narrow thing?\n\nEdit: Wow even US science teaching is US biased, we all fucked.",
              "score": -11,
              "created_utc": 1731015452.0,
              "replies": [
                {
                  "id": "lw0fy1t",
                  "author": "CovfefeForAll",
                  "body": "The concept of tariffs is an economic one. Economics taught in the US will include context specific to the country it was taught in.",
                  "score": 5,
                  "created_utc": 1731032979.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw1nf9a",
          "author": "OkDragonfruit9026",
          "body": "It’ll be exclusively available on January 5th /s",
          "score": 1,
          "created_utc": 1731051914.0,
          "replies": []
        },
        {
          "id": "lvxqbhf",
          "author": "Rapph",
          "body": "I feel like the tariffs are a concern but it’s likely a mid-late 2025 thing if it even happens.",
          "score": -2,
          "created_utc": 1731003238.0,
          "replies": [
            {
              "id": "lvyc01b",
              "author": "None",
              "body": "[deleted]",
              "score": 11,
              "created_utc": 1731009292.0,
              "replies": [
                {
                  "id": "lvycgff",
                  "author": "Rapph",
                  "body": "Wont surprise me either way.",
                  "score": 1,
                  "created_utc": 1731009421.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvz3i63",
          "author": "None",
          "body": "[deleted]",
          "score": -2,
          "created_utc": 1731017121.0,
          "replies": [
            {
              "id": "lvzdtxe",
              "author": "GreenLanturn",
              "body": "Sigh. \n\nSo the solution is to intentionally exacerbate the problem of goods not being made in America - by making it harder to buy them at all? \n\nMaybe instead of making it harder to buy foreign we should make it easier to make them domestically? Maybe by investing in our people via affordable education or new jobs in new factories?\n\nNah let’s give billionaires more tax breaks. They’ll fix it for us.",
              "score": 8,
              "created_utc": 1731020275.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvwosjc",
      "author": "chadwicke619",
      "body": "The replacement for my 7700K has almost arrived.",
      "score": 113,
      "created_utc": 1730992433.0,
      "replies": [
        {
          "id": "lvx91db",
          "author": "NobarTheTraveller",
          "body": "7700k gang rise up!",
          "score": 27,
          "created_utc": 1730998389.0,
          "replies": [
            {
              "id": "lvy459h",
              "author": "None",
              "body": "Heyooooo",
              "score": 4,
              "created_utc": 1731007080.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvwzgl3",
          "author": "NicoleB-",
          "body": "I just thought wow, I was stoked to get that last month and people are already replacing it?\n\nThen I saw the K, thought you meant the Ryzen 7700X.",
          "score": 13,
          "created_utc": 1730995632.0,
          "replies": [
            {
              "id": "lvx4s9n",
              "author": "Lord_Silverkey",
              "body": "I'm still on a 6700k, lol.\n\nIt actually holds up reasonably well with most modern titles. \n\nI haven't felt much of a need for a newer one until this year, especially since ~80% of my gaming is playing titles that are over 5 years old.\n\nThat said, I'm hoping to replace it next year.",
              "score": 18,
              "created_utc": 1730997181.0,
              "replies": [
                {
                  "id": "lvx7k1g",
                  "author": "Sakirth",
                  "body": "Ay 6700k crew! I actually ordered the 9800x3d today to replace it. I indeed started to notice it was starting to show it's age.",
                  "score": 9,
                  "created_utc": 1730997971.0,
                  "replies": [
                    {
                      "id": "lw0oi95",
                      "author": "carpuzz",
                      "body": "waiting for 9950x3d",
                      "score": 3,
                      "created_utc": 1731035942.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvx9dup",
                  "author": "tr_9422",
                  "body": "3700X is holding up fine",
                  "score": 7,
                  "created_utc": 1730998487.0,
                  "replies": [
                    {
                      "id": "lvxoyfv",
                      "author": "YouInternational2152",
                      "body": "Exactly, my 3950x is still perfect! I have it paired with a 4070 graphics card and it will do absolutely anything.",
                      "score": 2,
                      "created_utc": 1731002852.0,
                      "replies": [
                        {
                          "id": "lvy9urf",
                          "author": "murderinthedark",
                          "body": "3900x with my 3080 is pretty comfortable + it keeps me warm at night.  The free heat is a feature!\n\n<3",
                          "score": 2,
                          "created_utc": 1731008686.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lvxrga6",
                      "author": "CloseEnough2Me",
                      "body": "Same, even paired with a 6800xt.",
                      "score": 2,
                      "created_utc": 1731003557.0,
                      "replies": []
                    },
                    {
                      "id": "lvylq4k",
                      "author": "rpkarma",
                      "body": "5600X is okay, but it’s starting to show its limits now that I have a 300hz 1440p monitor",
                      "score": 2,
                      "created_utc": 1731012064.0,
                      "replies": [
                        {
                          "id": "lvyupmu",
                          "author": "AFriendlySloth",
                          "body": "Have same, was going to upgrade to 1440p but I think I will do a cpu and monitor upgrade together",
                          "score": 3,
                          "created_utc": 1731014610.0,
                          "replies": []
                        },
                        {
                          "id": "lvzhn86",
                          "author": "Jon_TWR",
                          "body": "5700x3d is like $150 on aliexpress, pretty big performance bump in almost all workloads (basically only workloads that don’t take advantage of more cores or more cache don’t benefit from the upgrade).",
                          "score": 1,
                          "created_utc": 1731021490.0,
                          "replies": [
                            {
                              "id": "lw04d9w",
                              "author": "rpkarma",
                              "body": "Yeah I’ve been really mulling over it, but I’d like the larger performance jump for non gaming tasks the 7800X3D and especially 9800X3D have, and I’m honestly due for an upgrade (work pays for $1500 worth haha)",
                              "score": 2,
                              "created_utc": 1731029092.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvxwu7i",
              "author": "None",
              "body": "salt quarrelsome offer enjoy kiss engine violet plant placid ludicrous\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 1,
              "created_utc": 1731005047.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvx68mg",
          "author": "Stehlik-Alit",
          "body": "Same! Still on a 7700k",
          "score": 11,
          "created_utc": 1730997598.0,
          "replies": []
        },
        {
          "id": "lvxvim9",
          "author": "grumd",
          "body": "Why did you decide to skip 9800X3D?",
          "score": 5,
          "created_utc": 1731004679.0,
          "replies": [
            {
              "id": "lw2w91a",
              "author": "chadwicke619",
              "body": "I wouldn’t say I decided to skip it. Anytime now I’m going to be building a new PC, and I’m going to go top shelf. If the 9950 is out and available, I’ll get it - if not, I’ll get the next 9800.",
              "score": 1,
              "created_utc": 1731074813.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvym5pp",
          "author": "Zorbonzobor",
          "body": "8700k 1080ti gang",
          "score": 3,
          "created_utc": 1731012185.0,
          "replies": [
            {
              "id": "lw02p7t",
              "author": "D1ckDasterdly",
              "body": "Rise up!",
              "score": 1,
              "created_utc": 1731028525.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvxr7f6",
          "author": "DarkMatterM4",
          "body": "9900k is there for you!",
          "score": 2,
          "created_utc": 1731003488.0,
          "replies": []
        },
        {
          "id": "lvzgzbx",
          "author": "None",
          "body": "Just replaced my i5 7600k + 1080 with a 7800X3D (and kept the 1080), PC feels like new again",
          "score": 1,
          "created_utc": 1731021278.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvx370h",
      "author": "TwofacedDisc",
      "body": "“For example, the average score for the Ryzen 9 7950X3D on Factoriobox is lower than that of the Ryzen 7 7800X3D, while the 5800X3D handily outperforms the 7800X3D, suggesting that this particular benchmark may not be the most accurate indicator of CPU performance”\n\nNothingburger",
      "score": 61,
      "created_utc": 1730996721.0,
      "replies": [
        {
          "id": "lw16bj5",
          "author": "danielv123",
          "body": "Eh, factoriobox is pretty good. The issue is that the article writer choose the stevetrov 10k benchmark which has only been ran 1k times - 2 of which on the 5800x3d. In factorio there are massive differences with memory and cache performance. One of the tricks to get the most out of your CPU is running under Linux with hugepages enabled, notice that a lot of the fastest individual runs are on linux. The benchmark is now also mixes results from 1.1 and 2.0 if you don't filter out old results, which has big differences in terms of performance optimizations. And it sadly doesn't list memory timings or speeds - the listed memory kit on the runs is just based on the model number, not what the kit is actually running at.\n\nIn general, one has to be careful trusting benchmarks from strangers. You never know what else they were doing on their system at the same time. One of the advantages of factoriobox is that it is very reproducible when running locally.\n\nAs well as the fact that it obviously doesn't measure performance for anything but factorio. Its not relevant at all for anything else.",
          "score": 4,
          "created_utc": 1731042836.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvxc4tc",
      "author": "LordoftheChia",
      "body": ">It is expected to sport 128MB of L3 cache, divided equally between the CCDs and a 3D V-Cache stack.\n\nWonder what the source is for that claim in the article.   ~~It's huge if true.~~\n\nEdit: 128MB they're talking about is the 32MB of l3 for each chiplet (64MB) + 64MB of 3D Cache on *one* 8 core chiplet.",
      "score": 14,
      "created_utc": 1730999269.0,
      "replies": [
        {
          "id": "lvz9tcr",
          "author": "FUTURE10S",
          "body": "Well the 7950X3D is 32 and 32+64vcache, so probably there?",
          "score": 6,
          "created_utc": 1731019028.0,
          "replies": [
            {
              "id": "lvza641",
              "author": "LordoftheChia",
              "body": "Oh yup, you're right 64MB from *one* cache chip + 32MB built in on one chipper and 32MB on the second chiplet.",
              "score": 2,
              "created_utc": 1731019136.0,
              "replies": [
                {
                  "id": "lvzdmpw",
                  "author": "FUTURE10S",
                  "body": "I would be really happy if it was 192MB. Alas.",
                  "score": 2,
                  "created_utc": 1731020212.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvxsqdu",
      "author": "Xendrus",
      "body": "Soooo, we assuming this will be slightly worse for gaming than the 9800x3d but better for everything else?",
      "score": 12,
      "created_utc": 1731003910.0,
      "replies": [
        {
          "id": "lvzr283",
          "author": "half3clipse",
          "body": "The 7950X3D was very slightly better than the 7800X3D, and could out perform when doing things like streaming as well. The core parking is a result of your OS and driver working together, and in windows the OS is perfectly capable of waking the parked cores to handle non game threads if there's enough load on the v-cache CCD. That will always be better than running everything on the one CCD. Especially since the vcache CCD on the 9950 should have a slighly higher clock speed out of the box than on the 9800\n\nWhich means the  9950 should also be slightly better for gaming, but without a good non gaming reason to buy it, the 9800 should perform basically the same for cheaper. And without the potential headache of cores not parking correctly.",
          "score": 10,
          "created_utc": 1731024610.0,
          "replies": [
            {
              "id": "lw1nmop",
              "author": "Violetmars",
              "body": "The last line is why I want to go for it 9800x3d lmao",
              "score": 1,
              "created_utc": 1731052041.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lw8mkc6",
          "author": "Pyr0blad3",
          "body": "if you can use the technology from amd to diable the CCD without 3d cache, i dont see why the 9950x3d should not at least be on par with the 9800x3d in gaming.",
          "score": 1,
          "created_utc": 1731155235.0,
          "replies": [
            {
              "id": "lw9c07y",
              "author": "Xendrus",
              "body": "You could do this with the 7950x3d and it would be on par with the 7800x3d? I'm just now getting into AMD cuz of how badly Intel has shit the bed the last 3 gens and I'm still using 9th gen intel, don't know much.",
              "score": 3,
              "created_utc": 1731165563.0,
              "replies": [
                {
                  "id": "lw9c7uf",
                  "author": "Pyr0blad3",
                  "body": "I am not quite aware if this technologie is useable for the 7950x3d or not. It would need a bios update at least i think.",
                  "score": 1,
                  "created_utc": 1731165637.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvzjuom",
          "author": "soulsoda",
          "body": "On default probably. If you're willing to finagle it, you can *probably* get identical or slightly better performance than a 9800X3d by disabling half of the L3 cache on the 9950X3d. It'd behave like a 9800x3d but it'd have an additional 8 cores.  the #950X3D was always slower because windows scheduler doesn't do a perfect job of using the right cores/cache and it wastes time to communicate across. \n\nFor those wanting an ELI5... Its like having two identical towers and your operating system accidentally sent info to the wrong tower(even when it was told not to), but that tower processes info anyways just as well. Then that tower needs to communicate with the other tower to be sure, and then its good to go. rather if it was processed in the correct tower it wouldn't need to check, it just goes.  Hence #800X3d tends to do better in most games. If you turn off a tower completely though windows won't accidentally send the data to the wrong tower, but you still have extra infrastructure of roads(cores) meaning you could see improvement in the X950x3d since its basically a x800x3d now. \n\nFor the discerning buyer... while the 9800x3d is better than the 7800x3d, its overkill in many ways. We're basically approaching the limits of gains from CPUs for gaming. Yes you can get an extra ~50-100 frames in 1080p low gaming. Except you need a monitor that can handle that jump from 500-600fps. If you actually play on 2k-4k ultra settings like a normal person though, you're going to get like ~1-3fps gains. Like sure the 9800x3d or 9950x3d is the next \"king\" but if you can get a 7800x3d or 7950x3d with mobo for cheap you're not missing out. \n\nThe real gains of upgrading from a lets say a 7800x3d to the 9800x3d is more about what zen 4 architecture supports vs zen 5 architecture. I.e. PCIE 5.0 lanes and higher supported ram speeds. Faster Ram will get you more gains in the FPS department than a CPU swap most likely.",
          "score": -3,
          "created_utc": 1731022211.0,
          "replies": [
            {
              "id": "lvzv0rj",
              "author": "SSLByron",
              "body": "I agree on spec, but there are always games that eat CPU cycles for breakfast. We'll be throwing clock at Cities: Skylines II until the world ends. Some things are just difficult to optimize.",
              "score": 5,
              "created_utc": 1731025928.0,
              "replies": [
                {
                  "id": "lvzzniu",
                  "author": "soulsoda",
                  "body": "You could throw a threadripper at Skylines II and it would suffer. That game was/is terribly optimized lmao.  \n\n>there are always games that eat CPU cycles for breakfast.\n\nSure in Sim games if the average sim time was 40 seconds for an 7800x3d, you're gonna save ~3-4 seconds on sim times. is that really worth replacing a cpu, a mobo, and ram?",
                  "score": 1,
                  "created_utc": 1731027482.0,
                  "replies": [
                    {
                      "id": "lw1t3oc",
                      "author": "The8Darkness",
                      "body": "Why would you replace the motherboard and ram, especially when the new motherboards are almost carbon copies of the old, they literally have the exactly same featureset at the same or even higher price points (x600 vs x800) and ram doesnt benefit from going above 6200-6600 (depending on what the cpu imc can handle) \n\nIf you manage to get the 9800x3d for a decent price, chances are you can upgrade a 7800x3d almost for free with current used pricing.",
                      "score": 0,
                      "created_utc": 1731055473.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw1aqqx",
              "author": "Xendrus",
              "body": "Funny I actually am one of those who games at 1080 and want the higher fps, I want to use a triple monitor setup of some of those new 500ishhz monitors and play some newer FPS stuff and have the side view(No 32:9 is not good enough, that's 1 entire monitors worth of space less), but I also really want around 250 fps, I stop being able to feel any difference in the mouse at 200ish so toss on 50 and call it a day. No shot I could do that at 4k. haha",
              "score": 1,
              "created_utc": 1731044898.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvx0b9d",
      "author": "TheBiggyT",
      "body": "This will be the chip that retires my 3900x then!\n\nBring on loading all the leagues in Football Manager.",
      "score": 8,
      "created_utc": 1730995883.0,
      "replies": []
    },
    {
      "id": "lvydo1w",
      "author": "FakeSafeWord",
      "body": "I'm really hoping these and nvidias 5090 come out before tarriffs take affect because I feel like afterwards high end computers will require a mortgage.",
      "score": 12,
      "created_utc": 1731009764.0,
      "replies": [
        {
          "id": "lw1ns32",
          "author": "OkDragonfruit9026",
          "body": "Hey, one more thing you won’t be able to afford! Just like a car, a house, eggs, apparently… /j",
          "score": 2,
          "created_utc": 1731052132.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw052av",
      "author": "jdaniels934",
      "body": "My girlfriend said the name of this cpu sounds what Elon Musk would name his kids",
      "score": 3,
      "created_utc": 1731029319.0,
      "replies": [
        {
          "id": "lw1ntux",
          "author": "OkDragonfruit9026",
          "body": "Don’t give him ideas!",
          "score": 1,
          "created_utc": 1731052162.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvx14xj",
      "author": "AnthMosk",
      "body": "Wait so don’t get a 9800x3d?",
      "score": 3,
      "created_utc": 1730996124.0,
      "replies": [
        {
          "id": "lvxa90u",
          "author": "KemosabeTheDivine",
          "body": "Sounds like the 9800X3D won’t hold the “best gaming CPU on the market” title for very long lol",
          "score": 5,
          "created_utc": 1730998730.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvzme9u",
      "author": "Catinthepimphat",
      "body": "Still on my 1700x. Might get the 7800X3D.",
      "score": 3,
      "created_utc": 1731023059.0,
      "replies": []
    },
    {
      "id": "lvzgy02",
      "author": "None",
      "body": "Fuck I need a custom PC before March. \n\nIf anyone here has a good build that can run games at a top tier rate without worry, please point me in there right direction. I will gladly drop 3k before it turns into 6k this time next year. \n\nAnd yes I’m serious",
      "score": 5,
      "created_utc": 1731021265.0,
      "replies": [
        {
          "id": "lw1fdv1",
          "author": "None",
          "body": "You hopefully have the ability to find guides for these things yourself.",
          "score": 2,
          "created_utc": 1731047273.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvwylmc",
      "author": "BulTV",
      "body": "Starter with 3700x. Upgraded to 3900x. Then to 5900x. Gonna upgrade to 5950x for 300 and sell the 5900x for 200. Will last another 2 years. Best socket ever.",
      "score": 9,
      "created_utc": 1730995379.0,
      "replies": [
        {
          "id": "lvxn49f",
          "author": "gramathy",
          "body": "if you're playing games a 5800x3d is a better upgrade from the 5900x. I know I'm considering it if I can find one.\n\nEven a 5700x3d is an improvement over a 5950 for gaming",
          "score": 9,
          "created_utc": 1731002338.0,
          "replies": [
            {
              "id": "lvxqy4k",
              "author": "BulTV",
              "body": "Streaming and gaming via cpu encoding.;)",
              "score": 2,
              "created_utc": 1731003416.0,
              "replies": [
                {
                  "id": "lvzgsgq",
                  "author": "gramathy",
                  "body": "If you're streaming you're better off using your GPU for faster realtime encoding even at the fps hit you'll take, or getting an entire second computer dedicated to the stream.\n\nCPU encoding gives better quality and compression efficiency results but requires throwing more resources at the problem",
                  "score": 5,
                  "created_utc": 1731021216.0,
                  "replies": [
                    {
                      "id": "lw1iemb",
                      "author": "BulTV",
                      "body": "I know but have no Problems with a 12 Core CPU to do all of this. So even with a 16 core this will be fine.",
                      "score": 1,
                      "created_utc": 1731048942.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvyya4y",
              "author": "Plank_With_A_Nail_In",
              "body": "The 5950x plays games just fine and does a whole load of other non gaming things better than a 5800x3d.",
              "score": 1,
              "created_utc": 1731015624.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvxdbiu",
          "author": "FixTheUSA2020",
          "body": "I've had the 5950x since launch, no plans to upgrade anytime soon, rock solid chip.",
          "score": 3,
          "created_utc": 1730999605.0,
          "replies": [
            {
              "id": "lvxelfp",
              "author": "Moral_conundrum",
              "body": "I, too, got one at launch. When I do a new build in a year or two I’m going to repurpose as my home server CPU.",
              "score": 1,
              "created_utc": 1730999965.0,
              "replies": [
                {
                  "id": "lvyelxc",
                  "author": "qa3rfqwef",
                  "body": "Depending on what your usecase is, keep in mind that your CPU does not have an iGPU and it being AMD means no quick sync so you'll need a dedicated GPU for any kind of video transcoding + AMD in general isn't as well supported for home server setups as intel in my experience.",
                  "score": 4,
                  "created_utc": 1731010037.0,
                  "replies": [
                    {
                      "id": "lvykcob",
                      "author": "Moral_conundrum",
                      "body": "For sure, when I eventually do a new build I’ll repurpose my 3080 TI for just that :)",
                      "score": 2,
                      "created_utc": 1731011673.0,
                      "replies": [
                        {
                          "id": "lw1nz7b",
                          "author": "OkDragonfruit9026",
                          "body": "3080 Ti as a vídeo encoder in a server! Now that’s… a new form of crazy.",
                          "score": 1,
                          "created_utc": 1731052251.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lvxhawf",
          "author": "Shoelebubba",
          "body": "So far, AM5 might rival or out do it depending on how many more they release on it. They’ve committed to at least until 2027 so Ryzen 11xxx and their X3D.    \n    \nStarted with a 7700x and gonna wait until it’s EOL to put something else in.",
          "score": 2,
          "created_utc": 1731000723.0,
          "replies": [
            {
              "id": "lvy1rts",
              "author": "Hellcrafted",
              "body": "This is exactly what I’m thinking. I’m waiting for black friday to see some deals but 7700x is looking really good",
              "score": 1,
              "created_utc": 1731006416.0,
              "replies": [
                {
                  "id": "lvzjjqv",
                  "author": "Shoelebubba",
                  "body": "I got lucky and got a deal when they launched.    \nIt was $400 with a kit of 32gb DDR5 RAM.    \n    \nSounds like a lot, but around the launch of AM5 DDR5 still a premium price, even for the DDR5-5600 kits.    \n    \nNowadays you can get 32gb for like $99 but iirc during that launch date that kit was like $160.      \n    \nIf I remember right, there was also a discount if you bought a X670/670E board just don’t remember the amount.",
                  "score": 1,
                  "created_utc": 1731022110.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvwmz47",
      "author": "a06220",
      "body": "Still happily playing with my Ryzen 5 3600",
      "score": 15,
      "created_utc": 1730991871.0,
      "replies": [
        {
          "id": "lvwo264",
          "author": "definite_mayb",
          "body": "As someone who upgraded from 1700 to 3600 to 5800x3d I highly recommend looking into a 5700x3d even if you are happy now. It seriously makes gaming so much smoother in 1% lows\n\nI have no desire to upgrade from 5800x3d to 9800x3d at 4k",
          "score": 28,
          "created_utc": 1730992207.0,
          "replies": [
            {
              "id": "lvxrgop",
              "author": "None",
              "body": "What's better, 5700x3d or 5800x3d? What's the difference between them, please?",
              "score": 2,
              "created_utc": 1731003560.0,
              "replies": [
                {
                  "id": "lvy5k7y",
                  "author": "Terkey",
                  "body": "5800x3d is 5-10% better performance but not manufactured anymore so 5700x3d is ~$100 cheaper",
                  "score": 11,
                  "created_utc": 1731007480.0,
                  "replies": [
                    {
                      "id": "lvyep2p",
                      "author": "None",
                      "body": "Thank you 😊",
                      "score": 1,
                      "created_utc": 1731010062.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw0301u",
              "author": "vmxcd",
              "body": "I made the jump when the 5700x3d's got so cheap on Aliexpress in the 11/11 sale it's going to be $148 and then there's always a $15-20 coupon off that amount too.",
              "score": 1,
              "created_utc": 1731028629.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvx7j6n",
          "author": "NoTearsOnlyLeakyEyes",
          "body": "As others have said, a 5000 series cpu is a huge upgrade. They're incredibly cheap right now and you can keep all your other hardware. I also had a 3600x. It was a night and day difference when I upgraded to the 5600x. The 1% lows are sooooo much higher in games like cyberpunk. It ran objectively smoother on my RTX 3070 @ 1440p.",
          "score": 5,
          "created_utc": 1730997964.0,
          "replies": []
        },
        {
          "id": "lvwnzra",
          "author": "EchoLynx",
          "body": "I have a 3700X... and I am starting to succumb to the hype. I want a 9000 series replacement.",
          "score": 8,
          "created_utc": 1730992186.0,
          "replies": [
            {
              "id": "lvx7wmm",
              "author": "sc0l3x",
              "body": "This is the boat I am in.. I have a 3900x with a 3070 and the stutters are killing me. I'd like to get a 5800x3d or 5700x3d but losing all the extra cores would suck. So I am excited for the 9950x3d.",
              "score": 7,
              "created_utc": 1730998069.0,
              "replies": []
            },
            {
              "id": "lvwssq4",
              "author": "douillee",
              "body": "Just upgrade for a 3D cache am4 processor and wait for am6. The money you saved in not buying a motherboard and ram will be better spent on a GPU.",
              "score": 9,
              "created_utc": 1730993631.0,
              "replies": [
                {
                  "id": "lvx37jk",
                  "author": "NightFuryToni",
                  "body": "Don't know why you got downvoted but you're right. That's exactly what I did, went 3700X to 5700X3D with a new GPU. The machine's flying even when the GPU is bottlenecked to PCI-E 3.0.",
                  "score": 6,
                  "created_utc": 1730996725.0,
                  "replies": []
                },
                {
                  "id": "lvx4u9n",
                  "author": "zarafff69",
                  "body": "When will AM6 be released tho?",
                  "score": 2,
                  "created_utc": 1730997196.0,
                  "replies": [
                    {
                      "id": "lvx6mvy",
                      "author": "douillee",
                      "body": "if AMD keeps the same pattern, probably after 3 gens of am5 procs so 2 more gens. But I dont see an AM4 X3D being a bottleneck for games in the next 4 years, while the GPU gains should be a lot more over the same period (depending on how the GPU industry evolves, sadly, seeing the current trends)",
                      "score": 4,
                      "created_utc": 1730997710.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvwrcxr",
              "author": "im_brooh",
              "body": "I had one and had no issues in gaming scenarios, only upgraded to 5950x for the additional cores for work-related stuff but it's still overkill for everything else i do, not sure if changing mobo is worth it yet",
              "score": 0,
              "created_utc": 1730993204.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvwzbdj",
          "author": "SteveThePurpleCat",
          "body": "Honestly, unless you are doing specific productivity tasks, or have a bit of big numbers addiction (not judging, I was there, spent months on 3dmark 06 with my E6600) most CPU upgrades are a waste of time. My 7600K from 2017 is only now becoming a bit of a bottleneck in *some* games, might have to overclock it a bit soon.\n\nI have been watching reviews of the new fx chip, 'oh wow it can do 600fps when the previous model could only manage 580fps!'\n\nReally? That's supposed to inspire me on a new build? Nah. That 3600 could have 5+ years in it yet.",
          "score": -5,
          "created_utc": 1730995590.0,
          "replies": [
            {
              "id": "lvx0mhg",
              "author": "innociv",
              "body": "A 5600 is over 2x the performance of the 7600k and half the power consumption. Pretty good upgrade.",
              "score": 4,
              "created_utc": 1730995975.0,
              "replies": []
            },
            {
              "id": "lvx02mg",
              "author": "MessiahPrinny",
              "body": "Games nowadays are getting more CPU heavy. A game like Space Marine 2 will beat the hell out of 3600. Which is why consoles have trouble hitting 60 even at a higher resolution.",
              "score": 5,
              "created_utc": 1730995813.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvwvdwg",
      "author": "BiBoFieTo",
      "body": "I'm holding out for minesweeper benchmarks.",
      "score": 3,
      "created_utc": 1730994394.0,
      "replies": []
    },
    {
      "id": "lw0o1t2",
      "author": "Joe787",
      "body": "seems like a big miss to not launch before end of the year",
      "score": 2,
      "created_utc": 1731035781.0,
      "replies": []
    },
    {
      "id": "lvx7rqw",
      "author": "TheTemplarr",
      "body": "I think my 5600 is gonna be goood until trump finishes his term",
      "score": 2,
      "created_utc": 1730998032.0,
      "replies": [
        {
          "id": "lw1o43d",
          "author": "OkDragonfruit9026",
          "body": "What term? Don’t you remember that there won’t be any more elections? He’s president for life!",
          "score": 2,
          "created_utc": 1731052333.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvxawu6",
      "author": "The_Real_Kingpurest",
      "body": "FINALLY",
      "score": 1,
      "created_utc": 1730998919.0,
      "replies": []
    },
    {
      "id": "lvyp1y6",
      "author": "lyllopip",
      "body": "This is definitely the cpu I can replace my 7800x3d with",
      "score": 1,
      "created_utc": 1731013003.0,
      "replies": []
    },
    {
      "id": "lvzuwqt",
      "author": "SgtBadManners",
      "body": "Does anyone know if it will do well at hosting plex?  \n\nMy understanding is that 8th Gen Intelq forward had built in transcoding, and my AM4 was apparently not about that life.",
      "score": 1,
      "created_utc": 1731025891.0,
      "replies": [
        {
          "id": "lw0onne",
          "author": "AliTheAce",
          "body": "It won't be as good as the Intel Quicksync with the 12th gen onwards but still likely more than fine for Plex transcodes.",
          "score": 3,
          "created_utc": 1731035995.0,
          "replies": [
            {
              "id": "lw0piy3",
              "author": "SgtBadManners",
              "body": "I might have to give it a shot.",
              "score": 1,
              "created_utc": 1731036308.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvzv0yv",
      "author": "rancid_",
      "body": "Alright boys I need a mobo that has USB 4.0 and won't half the PCIE bandwidth on the GPU to 8x.  What are my best options?",
      "score": 1,
      "created_utc": 1731025930.0,
      "replies": []
    },
    {
      "id": "lw06j5p",
      "author": "ap0a",
      "body": "I think the headline should read …it will be AMD’s last affordable flagship Zen 5 gaming processor.",
      "score": 1,
      "created_utc": 1731029802.0,
      "replies": []
    },
    {
      "id": "lw24pgy",
      "author": "MaryJaneAstell",
      "body": "Will the 9950x3d require parking?",
      "score": 1,
      "created_utc": 1731062824.0,
      "replies": []
    },
    {
      "id": "lw24pqb",
      "author": "MaryJaneAstell",
      "body": "Will the 9950x3d require parking?",
      "score": 1,
      "created_utc": 1731062824.0,
      "replies": []
    },
    {
      "id": "lw24tce",
      "author": "MaryJaneAstell",
      "body": "Will the 9950x3d require CPU parking?",
      "score": 1,
      "created_utc": 1731062871.0,
      "replies": []
    },
    {
      "id": "lw2qfwx",
      "author": "MidWestKhagan",
      "body": "Man I don’t know what to do now, I was gonna drive up to a micro center to get the 9800x3D but this might be the best of both worlds. I don’t know what to do",
      "score": 1,
      "created_utc": 1731072760.0,
      "replies": []
    },
    {
      "id": "lwgrewb",
      "author": "FabricationLife",
      "body": "5950x will carry me into the future, long live DDR4!",
      "score": 1,
      "created_utc": 1731269528.0,
      "replies": []
    },
    {
      "id": "lvykayt",
      "author": "Fredasa",
      "body": "How though?  Won't the scheduling problems keep it from being preferable to the 9800?",
      "score": 1,
      "created_utc": 1731011659.0,
      "replies": [
        {
          "id": "lvzrhrs",
          "author": "AimlessWanderer",
          "body": "not when both ccds have 3d-vcache, also scheduler issues are largely a thing of the past with 24h2.",
          "score": 5,
          "created_utc": 1731024754.0,
          "replies": [
            {
              "id": "lw05dl9",
              "author": "Fredasa",
              "body": "The issues it can engender are specifically the sort of thing that drive me up the wall, and the real problem is that 99% of folks, even in a gaming-specific audience, simply don't pick up on the drawbacks, so it's the kind of thing that falls through the cracks.  You won't find \"here is where scheduling issues screwed with our 1% lows\" in a 30 minute benchmark video, especially today when no mainstream PC review entity is going to want to be the guy who finds something to nitpick about AMD.",
              "score": 2,
              "created_utc": 1731029422.0,
              "replies": [
                {
                  "id": "lw06vga",
                  "author": "AimlessWanderer",
                  "body": "ive had a 7950x and currently have a 7950x3d.  so i know of the issues; and there were a lot of talk about them in forums and on youtube. i for one am really looking forward to both ccds being the same and have equal vcache.  im really curious if the ccds will be equal in quality too because my first few 7950xs were wildly different from ccd0-ccd1.",
                  "score": 2,
                  "created_utc": 1731029915.0,
                  "replies": [
                    {
                      "id": "lw0eg4k",
                      "author": "Fredasa",
                      "body": "I'm with you on that, yeah.  I hope somebody takes the time to concretely benchmark the past issues, the alleged fixes, and how the new chip fares in that regard.\n\nResources for those of us who are, shall we say, \"sensitive\" to theoretically subtle drawbacks are extremely rare.  I'll point to TVs as an example: Samsung are somewhat infamous for instituting non-defeatable characteristics into their TVs, designed to trick the vast majority of people even if it simultaneously ruins the entire package for the <1% who notices what's going on.  QLEDs all use dithering and global dimming which essentially cannot be defeated even in the service menu.  To me, those are basically dealbreakers, but I guarantee you almost nobody is even aware.\n\nThat's why I just can't buy simple or theoretical assurances that known issues in prosumer hardware are going to be solved, when those issues clearly never were big enough to ruffle too many feathers and actually ding sales.",
                      "score": 3,
                      "created_utc": 1731032467.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lw02hxx",
          "author": "tpill92",
          "body": "Yes. Context switching across ccds is still enormously costly compared to not doing it at all.",
          "score": 0,
          "created_utc": 1731028456.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw1i7ku",
      "author": "wayniceguy",
      "body": "I’m amazed at the lack of understanding of tariffs here and the rest of the world. We suffer from crippling tariffs on many US made products that are exported, yet we let that same product come into US for free. This has cost the US in terms of jobs moving to some of those countries. Harley couldn’t sell their bikes in India by Indian law. They agreed to change the law in exchange for opening the Mango market here. Once they changed the law India charged Harley a 150% tariff. This caused Harley to assemble bikes in India, thus depriving Harley workers in the US of those jobs. All of this time we allow Indian made motorcycles into the US for zero duty. The PM of India cut their tariff by 50% just because Trump told them that turnabout is fair play. How is any of the tariffs we pay to sell in other countries while their countries product can come to the US for free? What blows me away is wondering how we got here in the first place?\nWe may pay a bit more for certain things, but we’re not exporting as many jobs. Strategic tariffs are a good thing. Free trade is a buzz word that has no real world applications.",
      "score": -1,
      "created_utc": 1731048830.0,
      "replies": []
    },
    {
      "id": "lvwxd2y",
      "author": "None",
      "body": "They wasted their time nobody will be able to afford it lmfao",
      "score": -12,
      "created_utc": 1730994982.0,
      "replies": [
        {
          "id": "lvxp7fw",
          "author": "CompCOTG",
          "body": "With the power of roommates, anything is affordable.\n\nIt was the only reason I could afford a 4090 :)\n\nSad reality, tho.",
          "score": 2,
          "created_utc": 1731002922.0,
          "replies": []
        }
      ]
    }
  ]
}