{
  "post": {
    "title": "Samsung Galaxy S25 Edge review: More than just super thin",
    "author": "dapperlemon",
    "id": "1kwefqn",
    "score": 125,
    "created_utc": 1748320005.0,
    "selftext": "",
    "num_comments": 121,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kwefqn/samsung_galaxy_s25_edge_review_more_than_just/"
  },
  "comments": [
    {
      "id": "muh9kn1",
      "author": "Kep0a",
      "body": "I don't know why this phone is getting remotely positive reviews. It's an awful device. MrMobile recounted it died 3 times in one day from garbage battery life and google maps would crash from overheating. This is unacceptable for an $1100 phone in 2025.\n\nIt doesn't even use the new battery technology. It's literally just an s25 and they removed 30% of the battery to make it thinner.",
      "score": 87,
      "created_utc": 1748331607.0,
      "replies": [
        {
          "id": "mui2fhg",
          "author": "solartacoss",
          "body": "can’t you think about the stockholders?!\nif they used the new tech this year they will have to come up with something new for the s26, besides “improved battery life!”",
          "score": 14,
          "created_utc": 1748347263.0,
          "replies": []
        },
        {
          "id": "mumlw6o",
          "author": "t2guns",
          "body": ">google maps would crash from overheating\n\nWonder if this has anything to do with Google Maps being dogshit for over a year on Samsung phones. Like almost unusable with bugs.\n\nMy S23U gets very hot with Maps as well, even with my phone in shade and unplugged.",
          "score": 1,
          "created_utc": 1748397851.0,
          "replies": [
            {
              "id": "mv3cvnz",
              "author": "FattyWantCake",
              "body": "I haven't had that experience, personally. The YouTube app on the other hand ... \n\nI'm starting to think Google is sabotaging Sammy.",
              "score": 1,
              "created_utc": 1748622310.0,
              "replies": []
            },
            {
              "id": "mykl6jf",
              "author": "sojuboi",
              "body": "My s23U is fine with Google maps",
              "score": 1,
              "created_utc": 1750304055.0,
              "replies": []
            }
          ]
        },
        {
          "id": "muiaic1",
          "author": "badhabitfml",
          "body": "I got the new oneui os on my s24.\n\nThe app tray and notification changes suck. It's VERY iPhone now. And the iPhone is getting all the android features. It's getting very hard to stay with an android.",
          "score": -3,
          "created_utc": 1748350384.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mugpa1v",
      "author": "cuppaseb",
      "body": "yeah, it's more than just super thin, it's also a galaxy phone that no-one asked for. i would gladly trade thinness for a beefy battery.",
      "score": 282,
      "created_utc": 1748320552.0,
      "replies": [
        {
          "id": "mugrycr",
          "author": "phoenixmatrix",
          "body": "Too many people buy phones after looking at them for 2 minutes in the showroom. Phones end up optimized for those 2 minutes. \n\nThen they put a 5 bucks ugly ass super thick case on top.",
          "score": 86,
          "created_utc": 1748321862.0,
          "replies": [
            {
              "id": "muh5ee8",
              "author": "SquareTarbooj",
              "body": "I mean, I long stopped caring about things like specs and processors. Even budget phones are good on that these days.\n\nBut battery mAH is the one thing I do notice. Must be above 4500, ideally 5000, blessed if it's around 6000.",
              "score": 42,
              "created_utc": 1748329128.0,
              "replies": [
                {
                  "id": "mujfz9k",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 8,
                  "created_utc": 1748363101.0,
                  "replies": [
                    {
                      "id": "mun07j9",
                      "author": "TheNinjaScarFace",
                      "body": "I mean, it took me months of back and forth and endless reviews watched and/or read. But I did finally settle on my ZFold 6 and I won't lie. I'm incredibly happy and content with it. Without having to open it up too frequently, the screen folding becomes less of a concern. The narrow aspect ratio of the front screen is a big thing that I was worried about only to find that it enables me to type one handed. Battery would be stellar, I'm sure... If it weren't for requiring a constant Bluetooth connection to my Dexcom sensor. But even then, it still works incredibly well for what I use it for.  I'll agree though. My S7 and subsequent Iphone XR were both great. My last phone was an S22 ultra which, looking back - I really just didn't take full advantage of its features, used the stylus like 4 times in 3 years. And the obscenely large footprint of the phone eventually ended up being just a hassle after it was all said and done and I'd been dealing with it for 3 years.",
                      "score": 3,
                      "created_utc": 1748403088.0,
                      "replies": [
                        {
                          "id": "mun72d3",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 2,
                          "created_utc": 1748406013.0,
                          "replies": [
                            {
                              "id": "munflkl",
                              "author": "TheNinjaScarFace",
                              "body": "I will say that this is one of the higher-end phones that I've ever justified the price on - granted, there was a promotion and I wasn't too upset on having the phone for 36 months. YMMV.\n\nThat being said, one of the big things to consider with the flip vs the fold, even though they're completely different phones for completely different types of users. With the fold - everything primary-function-oriented can be done, exclusively from the cover screen. I've gone days without actually even thinking about opening the phone up. That is not the case at all with the flip. To do pretty much anything on the phone, you pretty much have to open and close it... Or keep it open all the time, negating the key feature of the phone altogether. But the point I'm trying to make, even though they both have the folding screen feature. One is going to see substantially premature wear on the screen/hinge vs the other as far as opening/folding tests go. It's just not one of those big things that people really think about. Food for thought.\n\nI do a degree of repair/troubleshooting in my line of work, and I'll say that while I don't see a lot of Galaxy ZFlips come through with issues - a related phone - the Motorola RAZR. Is easily one of the worst offenders that I see fairly regularly, with hinge/creased screen problems. Could be a design issue, could be a proprietary manufacturer issue. Something is telling me this specific case is the latter.",
                              "score": 1,
                              "created_utc": 1748410065.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "muolt64",
                      "author": "mister2forme",
                      "body": "I miss the days where companies actually did optimizations instead of just throw giant batteries at the problem. My old Sony had a flagship chip, 2700mah battery, and lasted 2-3 days with moderate use.",
                      "score": 2,
                      "created_utc": 1748432774.0,
                      "replies": []
                    },
                    {
                      "id": "mujvyo9",
                      "author": "speculatrix",
                      "body": "Some people buy battery packs that are like rucksacks to power the phone for a week or more, like this\n\nhttps://zerolemon.com/products/galaxy-s24-ultra-battery-case-10000mah\n\nThis is not an endorsement, just an example",
                      "score": 3,
                      "created_utc": 1748367557.0,
                      "replies": [
                        {
                          "id": "muket3m",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 7,
                          "created_utc": 1748372838.0,
                          "replies": [
                            {
                              "id": "munk2ud",
                              "author": "speculatrix",
                              "body": "I still have my lg v20. Awesome phone, got all of that, and removable battery.",
                              "score": 3,
                              "created_utc": 1748412385.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "muk9gq9",
                          "author": "JukePlz",
                          "body": "so, basically a powerbank, but worse, because it's permanently charging at 100%, cant be use with your other devices and turns your ultra slime phone into a blunt weapon.",
                          "score": 3,
                          "created_utc": 1748371316.0,
                          "replies": [
                            {
                              "id": "mukabzr",
                              "author": "graywolfman",
                              "body": "![gif](giphy|TYKOdOASPBVjW)",
                              "score": 2,
                              "created_utc": 1748371563.0,
                              "replies": [
                                {
                                  "id": "mukcwjx",
                                  "author": "JukePlz",
                                  "body": "![gif](giphy|tu54GM19sqJOw)",
                                  "score": 0,
                                  "created_utc": 1748372291.0,
                                  "replies": [
                                    {
                                      "id": "mukegdx",
                                      "author": "Rapier4",
                                      "body": "Its that \"Ultra Slime\" haha.\n\nGreat reddit interaction",
                                      "score": 1,
                                      "created_utc": 1748372736.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "musdax6",
                          "author": "mimic",
                          "body": "That would not power it for a week or more",
                          "score": 1,
                          "created_utc": 1748473651.0,
                          "replies": [
                            {
                              "id": "musgp2k",
                              "author": "speculatrix",
                              "body": "Get multiple battery backpacks?",
                              "score": 1,
                              "created_utc": 1748474776.0,
                              "replies": [
                                {
                                  "id": "musok8f",
                                  "author": "mimic",
                                  "body": "I’m ok, it would interfere with the pop socket that current gen huge phones require. I’ll stick with cables and USB battery packs.",
                                  "score": 1,
                                  "created_utc": 1748477455.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mulhtj0",
                  "author": "lowcrawler",
                  "body": "and camera... but otherwise, yes",
                  "score": 2,
                  "created_utc": 1748384370.0,
                  "replies": []
                },
                {
                  "id": "muto2px",
                  "author": "Kuraeshin",
                  "body": "Battery and storage for me. I still have my S20 because i could put a 256gb mini SD. \n\nGives me near 128 + 256 storage.",
                  "score": 2,
                  "created_utc": 1748490103.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mugz25w",
          "author": "Whammjam",
          "body": "As others have said, lot's of big beefy phones with big batteries are available. This is a company trying something out and seeing if it's successful. In an incrediblely stale smartphone market, that's a good thing.\n\nPersonally won't buy it, as it's beyond what I spent on a phone. I am interested if something like this comes to cheaper phones as well.",
          "score": 11,
          "created_utc": 1748325547.0,
          "replies": []
        },
        {
          "id": "mugvkgi",
          "author": "ASK_ABT_MY_USERNAME",
          "body": "I've had an s23 ultra for 2 years now and the battery easily lasts all day unless I'm constantly using it. Do people's phones not last as long?",
          "score": 18,
          "created_utc": 1748323705.0,
          "replies": [
            {
              "id": "muiuxjt",
              "author": "GravitationalEddie",
              "body": "My S21 is still rockin'.",
              "score": 7,
              "created_utc": 1748357109.0,
              "replies": []
            },
            {
              "id": "mugxflc",
              "author": "ace1oak",
              "body": "im on the same boat as you, with an s22",
              "score": 3,
              "created_utc": 1748324679.0,
              "replies": [
                {
                  "id": "musuyps",
                  "author": "gredr",
                  "body": "Me too, S22+, no complaints at all",
                  "score": 1,
                  "created_utc": 1748479680.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mugxea2",
              "author": "Practical-Custard-64",
              "body": "Sweeping generalisation inbound... The younger generations of smartphone users are constantly glued to their IG/TikTok/whatever feed. They need it more than they need oxygen. You should see the number of posts in the phone-related subs with them asking, \"Is this good screen-on time?\" and uploading a screenshot of the battery settings page showing 8 hours of active usage and all the power being used by those apps.\n\nSo, no. People's phones don't last as long. Not through some fault in the phone but because people can't put them down for 2 minutes. They are literally addicted to their phones.",
              "score": 19,
              "created_utc": 1748324660.0,
              "replies": []
            },
            {
              "id": "muh5kun",
              "author": "SquareTarbooj",
              "body": "Depends on my day. Once spent a Sunday glued to my phone. TikTok, Reddit, Call of Duty pretty nonstop.\n\nThe battery life in my S24 Ultra is pretty good, but in those moments, you feel like 10,000 mAH would be a godsend.",
              "score": -1,
              "created_utc": 1748329231.0,
              "replies": [
                {
                  "id": "muhqbxo",
                  "author": "ASK_ABT_MY_USERNAME",
                  "body": "On those Sundays you'd likely have an outlet nearby.",
                  "score": 3,
                  "created_utc": 1748341667.0,
                  "replies": [
                    {
                      "id": "muhswvn",
                      "author": "SquareTarbooj",
                      "body": "I did. It wasn't an issue. Just a moment of \"wow, I drained this super quickly today\"\n\nI'm someone who always has access to a charger. I still like having extra battery life over a slimmer phone.",
                      "score": 2,
                      "created_utc": 1748342979.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mujphyt",
              "author": "ItsColorNotColour",
              "body": "Only one day?? That's bad",
              "score": 0,
              "created_utc": 1748365775.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mugrfcg",
          "author": "Kitakitakita",
          "body": "the investors demand yearly releases. Enjoy your .01 extra cm",
          "score": 12,
          "created_utc": 1748321599.0,
          "replies": []
        },
        {
          "id": "mumb3x8",
          "author": "OinkMcOink",
          "body": "I listened to these two tech journalist talk about the new phones that featured earlier this year, they were like:\n\n\"Well there you have it, a new Samsung phone.\"\n\n\"Yep, that definitely a phone. Now, moving on...\"",
          "score": 3,
          "created_utc": 1748394160.0,
          "replies": []
        },
        {
          "id": "muh8ia5",
          "author": "unematti",
          "body": "So get one with a beefy battery? I already carry a battery bank, so it might as well be thin",
          "score": 4,
          "created_utc": 1748330963.0,
          "replies": []
        },
        {
          "id": "muh6t51",
          "author": "Thercon_Jair",
          "body": "No meaningful advances in phone related technologies, foldables are still too fragile (loved my flip 3 until a small piece of debris made it in between the foldable display large enough to bridge the gap).\n\nSo we're back to \"innovation\" to get the manufacturers out of this drought of real innovation and improvements. Heck, even the current camera sensors are largely the same old ones from three generations ago.",
          "score": 3,
          "created_utc": 1748329956.0,
          "replies": []
        },
        {
          "id": "mugsaay",
          "author": "SmartphoneCollector",
          "body": "I’m glad that OEMs are bringing lighter phones back to the market that still have high end specs that aren’t just about the cameras. Phones have gotten too heavy in recent years, especially noticeable in pockets and such. Personally holding out for a 17 Air to pair with a Z Fold7, both devices should be much thinner than predecessors. \n\nI know that a big battery is a common desire, but we already have plenty of bulky Pro Max/Ultra type phones on the market with multi-day battery life. We have basically no super thin and light phones on the market, until now. Glad we finally get to pick this type of device.",
          "score": 1,
          "created_utc": 1748322025.0,
          "replies": [
            {
              "id": "mugt45e",
              "author": "CutsAPromo",
              "body": "Need silicone carbon batteries are on the horizon.  I'm holding onto my smashed to shit s22 ultra until something worthy comes along.  the z flips are very interesting.  I'd probably also consider an ultra if they got rid of the s pen and made it smaller or gave it a bigger battery.",
              "score": 3,
              "created_utc": 1748322448.0,
              "replies": [
                {
                  "id": "mugtfy5",
                  "author": "SmartphoneCollector",
                  "body": "Why do you need a bigger battery than what’s on the S Ultras? Battery life is already pretty strong. It seems like most people don’t actually need more battery life, they just get battery anxiety.",
                  "score": -4,
                  "created_utc": 1748322615.0,
                  "replies": [
                    {
                      "id": "mugz1wd",
                      "author": "zarif2003",
                      "body": "You’re speaking to the wrong crowd, the smaller batteries are a non issue for people with low screen time, which is the antithesis of redditors",
                      "score": 7,
                      "created_utc": 1748325543.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mukfp6e",
          "author": "EnvironmentalRun1671",
          "body": "You can it's called S25+",
          "score": 1,
          "created_utc": 1748373095.0,
          "replies": []
        },
        {
          "id": "mushsvx",
          "author": "LongTatas",
          "body": "Imagine once our energy storage tech moves to the next level. It’s lagging a bit compared to chip improvements",
          "score": 1,
          "created_utc": 1748475146.0,
          "replies": []
        },
        {
          "id": "mugzxna",
          "author": "External_Ear_3588",
          "body": "We all would. Well most. But then the battery would be good enough still in two years.",
          "score": 0,
          "created_utc": 1748326030.0,
          "replies": []
        }
      ]
    },
    {
      "id": "muh4d21",
      "author": "SiscoSquared",
      "body": "Yawn. Everything in the phone space has reinforced my plan to upgrade only every 5 years or so. The tiny improvements no one cares about just don't justify the costs.",
      "score": 26,
      "created_utc": 1748328532.0,
      "replies": [
        {
          "id": "mui5ysu",
          "author": "471b32",
          "body": "Same. Still happy with my Pixel 6 pro. ",
          "score": 2,
          "created_utc": 1748348680.0,
          "replies": []
        }
      ]
    },
    {
      "id": "muhcukd",
      "author": "PARANOIAH",
      "body": "Awful price to specs ratio. Hobbled device for a slightly thinner device that nobody asked for. My S25 Ultra with a dbrand case already feels thin enough.",
      "score": 5,
      "created_utc": 1748333606.0,
      "replies": []
    },
    {
      "id": "mugp2ll",
      "author": "BeamImpact",
      "body": "Stop making phones thinner, instead give us more battery!",
      "score": 39,
      "created_utc": 1748320453.0,
      "replies": [
        {
          "id": "mugsj5v",
          "author": "SmartphoneCollector",
          "body": "Companies have been focused on battery life for a while now. Pro Max/Ultra phones exist with big batteries and multi day battery life. Most flagships have big batteries. We have basically no thin and super light phones on the market, so it’s nice to have some variety.",
          "score": 21,
          "created_utc": 1748322150.0,
          "replies": [
            {
              "id": "muhrz60",
              "author": "justthisones",
              "body": "Smaller phones would be better variety than a few mm thinner one with another camera bump. This is more of a fashion thing with a ridiculous price than proper convenience.",
              "score": 5,
              "created_utc": 1748342513.0,
              "replies": [
                {
                  "id": "muj819x",
                  "author": "Various_Procedure_11",
                  "body": "Agreed. I'd like a phone with a good battery that runs cooler and isn't basically a mini tablet. I miss brick phones and flip phones.",
                  "score": 2,
                  "created_utc": 1748360827.0,
                  "replies": []
                },
                {
                  "id": "multc4v",
                  "author": "SmartphoneCollector",
                  "body": "Yes it’s more of a design forward device, but one that’s trying to appeal to both crowds - big screen and light/thin. We’ll see how it performs.",
                  "score": 2,
                  "created_utc": 1748388167.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "muh9cxq",
              "author": "vollmann",
              "body": "you have lost your mind if you think the focus has not been on thin and light. expanded screens and thin bodies are the basis of the modern android/iphone wars.",
              "score": -2,
              "created_utc": 1748331478.0,
              "replies": [
                {
                  "id": "muk8x2c",
                  "author": "vengeancek70",
                  "body": "first flagshipish phone in years to be this thin",
                  "score": 3,
                  "created_utc": 1748371159.0,
                  "replies": []
                },
                {
                  "id": "multncv",
                  "author": "SmartphoneCollector",
                  "body": "I assure you that thin and light has not been the focus of the flagship smartphone industry. Cameras and battery life have been, although companies haven’t gone to the length of shipping an absolute brick (eg a phone that’s so thick it’s massive camera arrays are flush) because those will not sell.",
                  "score": 2,
                  "created_utc": 1748388272.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "muyqsjh",
          "author": "LordSnaggle",
          "body": "Make it thick enough so that the back camera is flush with the back of the phone. And for the love of fuck, give us back the micro sd card slot! I won't upgrade my phone from the s20 since the newer models don't come with expandable storage.",
          "score": 2,
          "created_utc": 1748556885.0,
          "replies": []
        },
        {
          "id": "mui03pm",
          "author": "PhaseExtra1132",
          "body": "There are phones with huge batteries like the ultra series phones. And the Chinese brands. \n\nBut people like these small phones more. The average customer is not a power user",
          "score": 2,
          "created_utc": 1748346292.0,
          "replies": [
            {
              "id": "muixwg6",
              "author": "Alternative-Sock-444",
              "body": "It's not smaller in any meaningful way though. If the screen was smaller, yeah, many people want that. But a phone with a proper battery is already thin enough. I haven't heard anyone complain about phones being too thick in years. Who wants a phone with a huge, power hungry screen lacking a battery to properly support that massive screen? Power user or not, the battery life is atrocious.",
              "score": 3,
              "created_utc": 1748357987.0,
              "replies": [
                {
                  "id": "muj1fjx",
                  "author": "PhaseExtra1132",
                  "body": "The phone is lighter and with a case it’s as light as a phone without one. \n\nPeople criticized the iPhones 16e and said it was a dumb purchase when you could buy the older iPhone 15 which is better stats to stats. But they ended up buying the 16e in mass. \n\nThese companies know their customers better than Reddit commenters. This is a fact.",
                  "score": 1,
                  "created_utc": 1748358986.0,
                  "replies": [
                    {
                      "id": "muj2y7l",
                      "author": "Alternative-Sock-444",
                      "body": "Companies are actually quite known for thinking they know their customers, releasing something based on that assumption, and that product flopping horribly because the corporation is completely out of touch with normal people. I'd almost be willing to put money on that being the case with this phone. I'd be surprised if they release a new version next cycle.",
                      "score": 2,
                      "created_utc": 1748359407.0,
                      "replies": []
                    },
                    {
                      "id": "mum456f",
                      "author": "tu_tu_tu",
                      "body": "The problem is... S25 Edge is 1 gramm heavier than basic S25, lol. So it's like S25 for those who really likes overheating.\n\n>People criticized the iPhones 16e\n\nIt's basically the new SE. SE always was popular enough.",
                      "score": 1,
                      "created_utc": 1748391785.0,
                      "replies": [
                        {
                          "id": "mv5gyur",
                          "author": "applesvenfifty",
                          "body": "S25 gets shitty trade-in deals and I just love the Ultra camera. Otherwise I agree and I would have gone with the normal S25 over the Edge.",
                          "score": 1,
                          "created_utc": 1748644854.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mukg3n1",
          "author": "EnvironmentalRun1671",
          "body": "You already have that. OnePlus put 6000 mah in 13R for example.",
          "score": 1,
          "created_utc": 1748373212.0,
          "replies": []
        },
        {
          "id": "muj7rmu",
          "author": "Various_Procedure_11",
          "body": "Thinner does very little for me. Everyone I know uses a case, anyway.",
          "score": 1,
          "created_utc": 1748360753.0,
          "replies": []
        },
        {
          "id": "mujm7ae",
          "author": "opeth10657",
          "body": "and remove the Gemini garbage",
          "score": 1,
          "created_utc": 1748364865.0,
          "replies": []
        }
      ]
    },
    {
      "id": "muj3oqi",
      "author": "Randactbjthroaway",
      "body": "The things I want are a good camera and decent battery life.",
      "score": 3,
      "created_utc": 1748359613.0,
      "replies": []
    },
    {
      "id": "mujh0vc",
      "author": "sizzlinpapaya",
      "body": "I wish the us had the variety in smart phone manufacturers that they do over seas.",
      "score": 3,
      "created_utc": 1748363404.0,
      "replies": [
        {
          "id": "mukgm88",
          "author": "EnvironmentalRun1671",
          "body": "US pretty much banished chinese phones so you dont and wont",
          "score": 4,
          "created_utc": 1748373361.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mugs139",
      "author": "None",
      "body": "[removed]",
      "score": 14,
      "created_utc": 1748321900.0,
      "replies": [
        {
          "id": "mugvfde",
          "author": "Fortune090",
          "body": "The weird thing too is that they've used the name before, but for an entirely different design feature. It's just strange all around.",
          "score": 28,
          "created_utc": 1748323631.0,
          "replies": [
            {
              "id": "muho2rj",
              "author": "brondonschwab",
              "body": "Galaxy S6 Edge used to be my endgame phone. The super curved screen wasn't very practical but those phones were super sleek back in the day",
              "score": 8,
              "created_utc": 1748340434.0,
              "replies": []
            },
            {
              "id": "mugz04f",
              "author": "HammockTree",
              "body": "I had one of those original Samsung edge. I never once used any of the features that it touted with that curved side panel glass. Just seemed like more area to break and a more expensive repair if it did.",
              "score": 8,
              "created_utc": 1748325516.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "muhdue0",
      "author": "SlipperyScope",
      "body": "I think it really is just super thin, not sure where the title is going?",
      "score": 2,
      "created_utc": 1748334231.0,
      "replies": []
    },
    {
      "id": "muhnwcd",
      "author": "Xtreeam",
      "body": "Guess they are trying hard to get ahead of Apple as usual.",
      "score": 2,
      "created_utc": 1748340332.0,
      "replies": []
    },
    {
      "id": "mum90w8",
      "author": "psykoX88",
      "body": "The s25 Plus and ultra are generally better phones all around, except they aren't thin.... That's literally its whole schtick",
      "score": 2,
      "created_utc": 1748393452.0,
      "replies": []
    },
    {
      "id": "mur94ba",
      "author": "Gringe8",
      "body": "I just got the edge to replace my s23 ultra. I like how much lighter it is, but they should have used the silicon carbon battery or at least 45w charging. This is my first day using it so I'll see how the battery is.",
      "score": 2,
      "created_utc": 1748461622.0,
      "replies": [
        {
          "id": "mv5fheb",
          "author": "applesvenfifty",
          "body": "I did the same thing and I'm loving it.",
          "score": 1,
          "created_utc": 1748644347.0,
          "replies": []
        },
        {
          "id": "mv5znzd",
          "author": "psychoticdream",
          "body": "So how's the battery",
          "score": 1,
          "created_utc": 1748651333.0,
          "replies": [
            {
              "id": "mv618vx",
              "author": "Gringe8",
              "body": "Last 2 days at work it made it thru my 10 hour shift and i got home with 50% battery. This is with steaming to my headphones all day and only using the screen on breaks though so most of the time the screen was off. \n\nToday I have off work so I've been using it alot for web browsing, YouTube and some light games. I took it off the charger at 11am and it's 8:30pm with 34% battery. It's good enough for my use case, but if you are a heavy user don't expect it to last all day without a charge.\n\nId say the only thing I miss is the faster wired charging on my ultra. This really could have used 45w charging. I never used the space zoom or S pen so I don't miss those.",
              "score": 2,
              "created_utc": 1748651916.0,
              "replies": [
                {
                  "id": "mv6gk38",
                  "author": "psychoticdream",
                  "body": "Thanks dude I'm still on s21+ so I was curious if it'd be time to upgrade",
                  "score": 1,
                  "created_utc": 1748657688.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "muvmh59",
      "author": "Oregonrider2014",
      "body": "I have s23 ultra. Loved it until they changed the fucking UI in the last update. Im sure theres a way to change it but i havent tried yet. Just annoyed me that an uodate made it more iphone-like. I dont buy apple for a reason",
      "score": 2,
      "created_utc": 1748524457.0,
      "replies": [
        {
          "id": "mv5fivj",
          "author": "applesvenfifty",
          "body": "Same!",
          "score": 1,
          "created_utc": 1748644361.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mv7qqzn",
      "author": "nee_m_d",
      "body": "My goodness... do any of the people leaving comments here actually *have* the phone? I DO, and I absolutely love it! I'm not a gamer; I use my phone mainly for email, WhatsApp, Facebook, and a few other apps. The battery lasts longer than my S23, and the phone is incredibly thin and light.\n\nI don't have huge hands and always wanted a larger screen without having to deal with a bulky, heavy Plus or Ultra model. This phone is perfect for me!\n\nHonestly, why do people need to constantly complain about literally everything? If it’s not the right fit for you, then don’t buy it...simple as that!",
      "score": 2,
      "created_utc": 1748680597.0,
      "replies": [
        {
          "id": "mvczdms",
          "author": "Exciting_Mine230",
          "body": "Exactly. They are professional complainers.  \"nobody asked for it\", what an argument lol. I got it today and battery is fine for me since I work for home and am not 24/7 looking at a phone. I am selling my iPhone 16 Pro. This edge feels amazing.",
          "score": 1,
          "created_utc": 1748750303.0,
          "replies": []
        },
        {
          "id": "mz0ltbj",
          "author": "gabbylikesfruit",
          "body": "Exactly the reason I got it, my last S22+ was way too heavy and large for my hands and I was happy to upgrade to a thinner lighter phone. I think the reg S25 looked do-able too, but this was slightly better for me. Acting like theres no market for thinner phones even for the sake of a little battery is def ridiculous, many of us will take that deal. I would hope they optimize it long term tho so we get better battery *and* thinness lol, but the phone works very well.",
          "score": 1,
          "created_utc": 1750526624.0,
          "replies": [
            {
              "id": "mz0m61h",
              "author": "nee_m_d",
              "body": "Agree 100%",
              "score": 1,
              "created_utc": 1750526735.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n42kdn8",
          "author": "usedbandaid",
          "body": "Is the phone still working good for you guys? Thinking about getting one.",
          "score": 1,
          "created_utc": 1752964281.0,
          "replies": [
            {
              "id": "n44mzo0",
              "author": "nee_m_d",
              "body": "Hi. Yes, I love it.",
              "score": 1,
              "created_utc": 1752995525.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "muiaubm",
      "author": "Simmangodz",
      "body": "We don't want thin. We want better battery life and replaceable parts.",
      "score": 2,
      "created_utc": 1748350503.0,
      "replies": []
    },
    {
      "id": "mugq5w8",
      "author": "SaiyanRajat",
      "body": "Nobody is asking for thinner phones, stop wasting your resources and time developing them.",
      "score": 4,
      "created_utc": 1748320977.0,
      "replies": [
        {
          "id": "mugseb5",
          "author": "SmartphoneCollector",
          "body": "I’ve been asking for lighter phones for years, and if it means the phones just needed to get super thin, so be it. Light phones don’t make sense until you actually start using them and carrying them.",
          "score": 11,
          "created_utc": 1748322082.0,
          "replies": [
            {
              "id": "muh1yql",
              "author": "circuitocorto",
              "body": "Phones used to be light when they used plastic. ",
              "score": 9,
              "created_utc": 1748327159.0,
              "replies": [
                {
                  "id": "muiql34",
                  "author": "angeAnonyme",
                  "body": "And had 4.5\" screens.",
                  "score": 4,
                  "created_utc": 1748355750.0,
                  "replies": []
                },
                {
                  "id": "mulu0yg",
                  "author": "SmartphoneCollector",
                  "body": "And had tiny batteries for the small screens of that era.",
                  "score": 3,
                  "created_utc": 1748388396.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "muh5pcs",
              "author": "SquareTarbooj",
              "body": "I understand this argument for smaller screen size phones, but a huge thin slab doesn't make the phone much easier than most other oversized slabs.",
              "score": 8,
              "created_utc": 1748329305.0,
              "replies": [
                {
                  "id": "multrlt",
                  "author": "SmartphoneCollector",
                  "body": "Lots of reviewers have stated otherwise.",
                  "score": 3,
                  "created_utc": 1748388311.0,
                  "replies": []
                },
                {
                  "id": "mv5gcia",
                  "author": "applesvenfifty",
                  "body": "Having moved from the Ultra to this, I can say with 100% certainty that you are incorrect. This is far more ergonomic and dextrous. I think maybe you are forgetting how big of a difference the weight makes.",
                  "score": 1,
                  "created_utc": 1748644643.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "muh4t6b",
              "author": "ThinkExtension2328",
              "body": "lol give it 6 months: phone dies after 6hours of standby and knowing for a extra 100$ you could of had the full fat version that would of worked better.",
              "score": 6,
              "created_utc": 1748328790.0,
              "replies": [
                {
                  "id": "multwzo",
                  "author": "SmartphoneCollector",
                  "body": "Doubtful, because that would also impact the rest of the S25 lineup in a material way so it’s a moot point.",
                  "score": 1,
                  "created_utc": 1748388360.0,
                  "replies": [
                    {
                      "id": "mulwjcm",
                      "author": "ThinkExtension2328",
                      "body": "lol watch it happen then, Samsung is just A/B testing if they can get away for charging more for less.",
                      "score": 2,
                      "created_utc": 1748389218.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "muheufu",
      "author": "DeadlyGreed",
      "body": "Poor phone, someone abandoned it to the wilderness and drove off. Or what is this picture supposed to indicate?",
      "score": 2,
      "created_utc": 1748334864.0,
      "replies": []
    },
    {
      "id": "muhyzmd",
      "author": "Nyx-Erebus",
      "body": "Does anyone actually want super thin? I want longer battery life, or hell, a physical keyboard.",
      "score": 2,
      "created_utc": 1748345806.0,
      "replies": []
    },
    {
      "id": "muhwv35",
      "author": "badula-yama-yama",
      "body": "Still rocking an S21 FE  although im on it constantly lol needs two charges a day now🤦🏾",
      "score": 1,
      "created_utc": 1748344849.0,
      "replies": []
    },
    {
      "id": "mujo9y7",
      "author": "1leggeddog",
      "body": "Still on the s22\n\nWorks great still for everything that I need it to.\n\nI've started paying a bit more attention to my usage and managing my battery life more but besides that I'm still happy.",
      "score": 1,
      "created_utc": 1748365435.0,
      "replies": []
    },
    {
      "id": "muldsr4",
      "author": "dzielny_tabalug",
      "body": "S25 mini pls",
      "score": 1,
      "created_utc": 1748383081.0,
      "replies": []
    },
    {
      "id": "muyz5ka",
      "author": "Frequent_Flyer_Miles",
      "body": "The way I see it, and most others seem to do too, with all the complaints, is that manufacturers are ignoring the people's feedback and simply producing what \"they want\"..\n\nThe customer is what's keeping them alive, so that alone should drive the phones they produce, not trying to impress us with stuff we don't need. I think a good move for phone manufacturing would be to see a yearly mandatory poll being publicly released on their website every year with points they plan to upgrade or improve on, maybe even trial new ideas there, before they jump the gun, to see what customers actually want and what they don't. That way they can make informed and real changes, not gimmicks.\n\nThe most important factors these days that most seem to be crying out for are, bigger batteries, better cameras and more storage.. Simple. The rest is secondary. \n\nSlim phones, AI in every corner, and the latest high end Snapdragon 8 Elite are no longer that important. Slim is no good if you're squeezing a tiny battery in, when people want longevity. Phone processors now are so good you don't need the latest and greatest. They're fast enough for anyone and gimmicks just seem to annoy people. AI, not everyone wants it so give people the choice between a model implemented with AI and one without, for a lesser cost on the latter. Give people the choice instead of forcing it on everyone. Also, technology advances seems to have slowed to an all time low because all we're seeing every year are tiny iterations, and they're struggling to produce anything with the \"wow\" effect, which is why they're resorting to gimmicks. There's no real jumps anymore so it's not worth the upgrade every year, or even two. Not like the good old days where every year was way better than the previous.\n\nMaybe it's time for them to start releasing phones every 3 years rather than 10 different models a year. That way we feel like we're actually getting the jump in tech we deserve and not flooding the market with dozens of wasteful makes and models of phones people don't want.",
      "score": 1,
      "created_utc": 1748559619.0,
      "replies": []
    },
    {
      "id": "mvd32of",
      "author": "TheModeratorWrangler",
      "body": "This is why I will forever mock Android. Back in the day Android held so much promise but fragmentation made it all moot. The last Android phone I had was the Motorola super slim Verizon variant (SLVR or RAZR Droid) with a Windows Phone full theme. Terrible battery life, but decently enough hardware that I could handle it…\n\nTried out a few times on my friends to see if Galaxy is worth it. Absolutely not. Don’t even get me started on the UI. It’s like watching someone go “your iPhone can’t do that!” before asking me an hour later to make a call because their phone died from how much GOD DAMN DATA THAT ANDROID SELLS TO PAY FOR YOUR FREE PHONE OS.\n\nOnce I went back to iPhone I never looked back. I enjoy knowing iCloud has my back with frequent password changes, seamless integration, and that my phone just freaking works.\n\nSent from my 16e",
      "score": 1,
      "created_utc": 1748751989.0,
      "replies": []
    },
    {
      "id": "mwzvgjp",
      "author": "Ok_Translator4447",
      "body": "Man I just know everyone in here complains about them having a choice. Like you all are saying no one wanted this phone, we wanted more battery. Then this phone isn't for you. They have phones with more battery. Buy it. This phone isn't for you because of the battery, don't buy it and move on. \n\nYall are complaining because a company has given us a choice. You have the choice to buy a phone for you and that's OK that this is not it.",
      "score": 1,
      "created_utc": 1749553731.0,
      "replies": [
        {
          "id": "mxbro1s",
          "author": "Cydiapixel4u",
          "body": "Lots of professional complainers",
          "score": 1,
          "created_utc": 1749702056.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzwmto6",
      "author": "Alternative-Cod512",
      "body": "They copied the iPhone 17 Air and rushed a subpar phone onto the market so they can claim they did it first? Typical Samsung lol",
      "score": 1,
      "created_utc": 1750954523.0,
      "replies": []
    },
    {
      "id": "mulo9p2",
      "author": "Likes2Phish",
      "body": "Give me an sd card slot and a bigger battery. Holding these phones without a case is awkward.",
      "score": 1,
      "created_utc": 1748386499.0,
      "replies": []
    },
    {
      "id": "mugocgg",
      "author": "I_will_take_that",
      "body": "If its more then you would have expected them to focus their marketing on the thiness of the product no?",
      "score": 0,
      "created_utc": 1748320105.0,
      "replies": []
    },
    {
      "id": "mukq1zm",
      "author": "dustofdeath",
      "body": "Noone has asked for thin since first smartphones decade+ ago.\n\n\nIt makes them feel flimsy and cheap.",
      "score": 0,
      "created_utc": 1748376076.0,
      "replies": []
    },
    {
      "id": "mumvxow",
      "author": "Successful_Athlete38",
      "body": "Mine arrives tomorrow to replace my S23 ultra.  On paper, this may feel like a downgrade to some...but I am looking so forward to having a phone that doesn't feel like a brick in my pocket and annoying to carry around...or having it fall on my face and leave a bruise when I'm using it laying in bed.  I've slowed down phone upgrades lately (used to be on the yearly bandwagon s7-s8-s9-s10+-s21u-s23u (only because the camera failed in the s21u)...but I've hated how heavy and unwieldy these big phones have become and have been pining for a high-end phone that's small and light.  \n\n  \nWhy choose the largest model?  Samsung annoyingly locks the best screen, cameras and storage out of the base phones- I need at least 512GB storage.  Otherwise, I'd just choose the base phones with maxed out storage.\n\nI still have my old S10+ in a drawer and took it out to inspect it....and man, that phone was amazing.  I didn't appreciate it at the time, but that phone is one of the all-time greats.  And I definitely can't believe the S25 edge will be thinner and lighter than that phone.\n\nLooking forward to seeing if the S25 edge can recapture some of the S10+'s charm/magic.",
      "score": 0,
      "created_utc": 1748401412.0,
      "replies": [
        {
          "id": "mv5fptl",
          "author": "applesvenfifty",
          "body": "I made the same upgrade for the same reason and I'm really happy. This thing feels like a piece of magical paper. 🤣",
          "score": 1,
          "created_utc": 1748644427.0,
          "replies": []
        }
      ]
    }
  ]
}