{
  "post": {
    "title": "Galaxy Z Fold 7 hands-on: Samsung finally made the foldables we’ve been asking for | Except for the price. We didn’t ask for that.",
    "author": "chrisdh79",
    "id": "1lvjucr",
    "score": 901,
    "created_utc": 1752070394.0,
    "selftext": "",
    "num_comments": 374,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lvjucr/galaxy_z_fold_7_handson_samsung_finally_made_the/"
  },
  "comments": [
    {
      "id": "n26gfq0",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752070395.0,
      "replies": []
    },
    {
      "id": "n26hixs",
      "author": "ReturnCorrect1510",
      "body": "Isn’t the price basically what it was for the 6?",
      "score": 223,
      "created_utc": 1752070709.0,
      "replies": [
        {
          "id": "n26ilbt",
          "author": "Laucien",
          "body": "In the EU it seems 100/200 Euro more? I recall seeing the base 6 for about 1900? And it's 2100 now.",
          "score": 94,
          "created_utc": 1752071013.0,
          "replies": [
            {
              "id": "n26j3bn",
              "author": "Rhaerc",
              "body": "Us prices never include taxes I think.",
              "score": 73,
              "created_utc": 1752071159.0,
              "replies": [
                {
                  "id": "n26j7ut",
                  "author": "Laucien",
                  "body": "Right. Forgot that detail.",
                  "score": 18,
                  "created_utc": 1752071194.0,
                  "replies": []
                },
                {
                  "id": "n27gouf",
                  "author": "Gasnia",
                  "body": "Yea, because we like to be surprised when we get to the till.",
                  "score": 28,
                  "created_utc": 1752080420.0,
                  "replies": [
                    {
                      "id": "n28tcqk",
                      "author": "officialspinster",
                      "body": "Because different states have different tax, so there is no “US Tax.”",
                      "score": -22,
                      "created_utc": 1752093765.0,
                      "replies": [
                        {
                          "id": "n2974vq",
                          "author": "CptRoque",
                          "body": "Same for each country in the EU, but somehow they're able to include the tax in the price.",
                          "score": 26,
                          "created_utc": 1752097661.0,
                          "replies": [
                            {
                              "id": "n29omux",
                              "author": "Possible_Top4855",
                              "body": "Even within states, sales tax varies by county and sometimes city.",
                              "score": 2,
                              "created_utc": 1752103216.0,
                              "replies": []
                            },
                            {
                              "id": "n297oxs",
                              "author": "officialspinster",
                              "body": "That’s not the same.  Tax across each country in the EU is the same, if I’m not mistaken.  You’re not paying 3% in one part of France and 6% in another part of France.  The EU is not analogous to the USA.",
                              "score": -13,
                              "created_utc": 1752097829.0,
                              "replies": [
                                {
                                  "id": "n29qidw",
                                  "author": "ClaudiuT",
                                  "body": "Literally every country has a different VAT (in the range of 19% to 25%).\n\nBut if a product costs 1000 euros, then the company eats the difference between the VATs.\n\nI could drive from France (20%) to Germany (19%) to Belgium (21%) and the same product has to be 1000 euros in all three countries.",
                                  "score": 10,
                                  "created_utc": 1752103821.0,
                                  "replies": [
                                    {
                                      "id": "n2b75a0",
                                      "author": "Techno-Diktator",
                                      "body": "The Yankee mind cannot comprehend this lmao",
                                      "score": 7,
                                      "created_utc": 1752123341.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "n2bxmox",
                                      "author": "danielv123",
                                      "body": "I mean, it doesn't have to be 1000 eur in all of them. Pricing of stuff often varies even between stores.\n\nIt's just that manufacturers like their products to be priced at round numbers.",
                                      "score": 1,
                                      "created_utc": 1752137571.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n2ap4r0",
                          "author": "amaria_athena",
                          "body": "I immediately thought this. \n\nWe got state and county and sometimes city/town/village taxes that differ all across America. \n\n\nSo here is my sole upvote to help you out of your hole. Good luck!",
                          "score": 5,
                          "created_utc": 1752115847.0,
                          "replies": []
                        },
                        {
                          "id": "n297ve7",
                          "author": "mystlurker",
                          "body": "Taxes can vary down to individual addresses, not just states. Counties and cities can also have sales taxes, and in many places special assessment zones (used to pay for various infrastructure) can be applied to individual shopping centers or even individual buildings. Not necessarily a great system, but you are underselling how complicated it is.",
                          "score": 3,
                          "created_utc": 1752097882.0,
                          "replies": [
                            {
                              "id": "n29iyu2",
                              "author": "projectsangheili",
                              "body": "Surely the place selling it must know, I really do not understand the problem. Hell, you could slap every single tax version in an excel sheet and reference the address and be done. It's such a strange reason.",
                              "score": 3,
                              "created_utc": 1752101380.0,
                              "replies": [
                                {
                                  "id": "n29qwvj",
                                  "author": "mystlurker",
                                  "body": "It changes frequently and requires a fair amount of work to maintain. Usually either managed by the Point of Sale systems or by third party companies that places build into their checkout in some way.\n\nWhen doing online purchase the address of the receiver is the one thats calculated, so they do it at checkout during the online process. It is effectively a giant excel, but managed by a third party (online its usually either a third party you integrate or managed by the store software like Shopify). So you can know it, but not until the last step of checkout process, so all prices are quoted before tax and most people have a general idea of their local tax rate (typically 8-10%).\n\nThere are unique situations where some states do not have any sales tax and people will use that to get cheaper prices by going to those states to shop, but technically all other states have \"use\" taxes that force people to pay the tax for all items they come back to the state with, so its not really a loophole.",
                                  "score": 2,
                                  "created_utc": 1752103952.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "n29ivfn",
                              "author": "officialspinster",
                              "body": "I know I am, but I’m still wrong, apparently, somehow.",
                              "score": -2,
                              "created_utc": 1752101350.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n2blf37",
              "author": "zzazzzz",
              "body": "i see insane discounts for the folds tho. if you wait a year you can get it for a 1000euros",
              "score": 1,
              "created_utc": 1752130618.0,
              "replies": [
                {
                  "id": "n2c2kvc",
                  "author": "Laucien",
                  "body": "Yeah, if I were to trade in my Fold6 I'd get around 800 Euro discount.\n\nI'm really tempted to get the new one but I'm gonna wait to Black Friday and see what shows up there.",
                  "score": 1,
                  "created_utc": 1752140433.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n26r9dd",
          "author": "MacEbes",
          "body": "No. The fold 5 was 1800, 6 was 1900, this is 2000",
          "score": 27,
          "created_utc": 1752073464.0,
          "replies": [
            {
              "id": "n2dfn01",
              "author": "ReturnCorrect1510",
              "body": "Thanks for proving my point. A 5% increase considering inflation is basically the same price",
              "score": 3,
              "created_utc": 1752158951.0,
              "replies": []
            },
            {
              "id": "n29l5ha",
              "author": "swarmy1",
              "body": "Considering the tariff situation, a $100 increase doesn't seem that bad really.",
              "score": 0,
              "created_utc": 1752102087.0,
              "replies": [
                {
                  "id": "n29o6ff",
                  "author": "MacEbes",
                  "body": "Theres literally no way a phone in development for at least a year has tarrifs factored that were decided on like 2 days ago. Its also up in other territories as well. This is just in no way related.",
                  "score": -2,
                  "created_utc": 1752103071.0,
                  "replies": [
                    {
                      "id": "n2c3mng",
                      "author": "N2-Ainz",
                      "body": "You ever heard of head-room? Obviously they knew for over half a year that they could suffer from tariffs and raised the price as a safety pre-caution",
                      "score": 2,
                      "created_utc": 1752141008.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n26yark",
          "author": "debo69872",
          "body": "Does the tariff have anything to do with it?",
          "score": 11,
          "created_utc": 1752075406.0,
          "replies": [
            {
              "id": "n2791st",
              "author": "Sivalon",
              "body": "It might.",
              "score": 10,
              "created_utc": 1752078349.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n26uazq",
          "author": "kr4ckenm3fortune",
          "body": "Minus the s-pen...",
          "score": 4,
          "created_utc": 1752074307.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n26jf4q",
      "author": "OniExpress",
      "body": "The poor dust resistance is the kicker for me. Thing will die just being in my pockets.",
      "score": 235,
      "created_utc": 1752071252.0,
      "replies": [
        {
          "id": "n26qu1k",
          "author": "iguacu",
          "body": "I loved my Fold4, but when it suddenly stopped being able to open all the way and I had to use a 3rd party repair company for the warranty, it was a disaster.  I swore to myself never again.",
          "score": 109,
          "created_utc": 1752073345.0,
          "replies": [
            {
              "id": "n27mvcs",
              "author": "VagueSomething",
              "body": "Having lived through flip phones the first time, I'm not considering folding screens as a serious product for a few more generations. Hinges weaken over time, moving parts are always the first thing to fail on phones. These early versions are essentially paid data gathering.",
              "score": 47,
              "created_utc": 1752082081.0,
              "replies": [
                {
                  "id": "n28qkg1",
                  "author": "Enderkr",
                  "body": "I look back very fondly on the OG flip phones, the RAZR was hands-down my favorite phone of all time. With new flips I can't get over the screen crease. I'm not willing to sacrifice screen quality for screen size, especially when the full size phones we have these days are more than big enough.",
                  "score": 12,
                  "created_utc": 1752092999.0,
                  "replies": [
                    {
                      "id": "n2fgjfc",
                      "author": "chostax-",
                      "body": "There were soooo many flip phones before the RAZR. The RAZR was just the nicest, thinnest one to come out and its design made huge waves. \n\nI’d argue in terms of tech, we haven’t made the same progress on the foldable phones as we did from the first flip phones to the razr.",
                      "score": 3,
                      "created_utc": 1752179417.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n29tvsy",
                  "author": "corecenite",
                  "body": "can't remember who said it first, i think it was a youtuber. they said \"if something moves in/on a phone, stay away from it\"",
                  "score": 6,
                  "created_utc": 1752104924.0,
                  "replies": []
                },
                {
                  "id": "n2gvfv7",
                  "author": "RhetoricalOrator",
                  "body": "I'd jump if they were priced closer to mid-tier. $2,000 for a mid to decent spec phone with terrible durability just doesn't work for me. \n\nHonestly, though, I had a Microsoft Duo 2 and if the software wasn't so bad, I would have been perfectly pleased with it having two screens and a small gap down the middle. I maintain it was a cool idea.",
                  "score": 2,
                  "created_utc": 1752195723.0,
                  "replies": []
                },
                {
                  "id": "n28i84t",
                  "author": "bickandalls",
                  "body": "Get a case that covers the hinge. I'd never recommend a fold without one. Just asking for trouble if you keep your phone in your pocket.",
                  "score": 2,
                  "created_utc": 1752090701.0,
                  "replies": [
                    {
                      "id": "n28nqzi",
                      "author": "VagueSomething",
                      "body": "A case doesn't fix physics. The repeated movement degrades the product over time.",
                      "score": 12,
                      "created_utc": 1752092230.0,
                      "replies": [
                        {
                          "id": "n2anevt",
                          "author": "RimStain",
                          "body": "I owned the flip 3 and 5 for 2Y each, the hinge is well built. There's a video on YT where people open and close it for 6 days straight 418K opens and closes before it breaks. The real problem is the flexible screen separating from the glass like screen protector that comes factory, this is from moisture and grease, not physical movement.",
                          "score": -1,
                          "created_utc": 1752115213.0,
                          "replies": []
                        },
                        {
                          "id": "n2asqzg",
                          "author": "bickandalls",
                          "body": "No, dust doesn't damage it. Pieces of foreign materials, and small dents do. A tiny dent is almost a death sentence for a fold. A cover prevents anything large enough to damage it from getting near the hinge, and obviouslyprotects against dents. Covers also have relatively strong springs for what they are.\n\nI've had my fold 5 since week of release. It will likely be retired shortly because two years of heavy use is hard on a battery, but everything else is golden.\n\nNo, a hinge cover can't garentee zero damage, but its a night and day difference from no cover.",
                          "score": -1,
                          "created_utc": 1752117252.0,
                          "replies": [
                            {
                              "id": "n2l0y7r",
                              "author": "Agreeable_Safety3255",
                              "body": "I have a 3, I agree",
                              "score": 1,
                              "created_utc": 1752254426.0,
                              "replies": []
                            },
                            {
                              "id": "n2ba4ej",
                              "author": "Damfino901",
                              "body": "No idea why you're getting downvoted. I've had my 5 since release and was skeptical because of the negativity surrounding the above commenters' talking points, but I have not been easy on this thing and I have zero issues with it. Hell, I've even dropped it hard enough to put a dent in the spine months ago and it's still fine. I constantly fold and unfold it, stick it in tablet mounts at home and work, and  put it into a GameSir controller that uses retention to hold it in place. It's been both the most practical and most fun mobile device I've ever owned.",
                              "score": 0,
                              "created_utc": 1752124751.0,
                              "replies": [
                                {
                                  "id": "n2bhe62",
                                  "author": "bickandalls",
                                  "body": "Because it's reddit. Just a bunch of men getting rock hard over seeing negative.\n\nAlso, probably a lot of guys pissed off about everything because their phone broke, so they are going to say that dust does in fact break folds.",
                                  "score": 2,
                                  "created_utc": 1752128454.0,
                                  "replies": []
                                },
                                {
                                  "id": "n2endmy",
                                  "author": "Commander-Typo",
                                  "body": "Fold 2 owner here. I bought it in 2020 and still using it right now. Over the years I've dropped it a few times and as a result, it does not open fully flat. I have a hard plastic cover that snaps on. Actually two pieces and it does not cover the hinge. If I had that extra protection, my phone would probably still open fully flat. There are a few nicks in the main screen that have gone through the permanent screen protector, so it is no longer stuck to the screen the full length over top of the hinge. Still quite usable, but time for an upgrade, which is why I'm here...",
                                  "score": 1,
                                  "created_utc": 1752171059.0,
                                  "replies": []
                                },
                                {
                                  "id": "n2bk5ql",
                                  "author": "KBeightyseven",
                                  "body": "Yep zlip6 owner here, according to the internet this would be the worst phone possible for me, Im a mechanical engineer in the heavy industries, I'm usually dirty, metal swarf in my pockets etc, \n\nthe phone has held up as well if not better than a slab phone, \niv also bent the last two slap phones and cracked the screens while being in my pocket as they are so huge compared to a closed flip.",
                                  "score": 0,
                                  "created_utc": 1752129939.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n28k2zb",
                      "author": "QuackersTheSquishy",
                      "body": "Have a toddler sibling, and butter fingers. 3 cases had the hinge cover break on my 5. Been over a year rocking no hinge protection and zero issues with my hinge despite working in some arid enviorments (midwest summer heatwave in USA ifyk yk) and while I don't garden or work direcrly in the dirt I'd say for the average city-indivdual the hinge was durable enough with the f5 redesighn. That was actually what made me choose to get a fold5, I could finnaly see the product as a serious daily driver ",
                      "score": 2,
                      "created_utc": 1752091216.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n28ywqn",
                  "author": "Sophrosynic",
                  "body": "Flip phones had to be opened every time you used it. The Fold will be used closed a lot, and only opened up when settling in for an extended session.",
                  "score": 1,
                  "created_utc": 1752095281.0,
                  "replies": [
                    {
                      "id": "n2943jx",
                      "author": "VagueSomething",
                      "body": "It is still mechanical parts to fail over time in the hinges and stress on the screen area. Minimal gain with this current design too so it is really just for tech fans.",
                      "score": 5,
                      "created_utc": 1752096766.0,
                      "replies": [
                        {
                          "id": "n296b24",
                          "author": "Sophrosynic",
                          "body": "Yeah but with a lower cycle rate it'll probably outlive the phone.",
                          "score": 0,
                          "created_utc": 1752097417.0,
                          "replies": [
                            {
                              "id": "n2gkco7",
                              "author": "corecenite",
                              "body": "You also have to factor in changes of environment. Their lab tests are done in controlled environment with consistent pressure. Heat and pressure make physics variable.",
                              "score": 1,
                              "created_utc": 1752191840.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n28jxht",
              "author": "LeoThePom",
              "body": "The 4 had a major hinge fault, they were/are all basically guaranteed to fail. 5s hinge fixed it and is a lot more durable.",
              "score": 8,
              "created_utc": 1752091173.0,
              "replies": [
                {
                  "id": "n28q0k0",
                  "author": "Sparkko",
                  "body": "Mine survived over 2 years of daily use until I upgraded to an S25 ultra because my battery was failing. Guess I got lucky.",
                  "score": 2,
                  "created_utc": 1752092851.0,
                  "replies": [
                    {
                      "id": "n2rrwk3",
                      "author": "LeoThePom",
                      "body": "I had a 2nd hand one that was already a little funky that lasted 11 months. It's luck of the draw when it breaks, but break it will!",
                      "score": 1,
                      "created_utc": 1752345987.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n274v68",
              "author": "rcm_rx7",
              "body": "I had the same problems with my 4, turns out the dust seal brush things came unglued inside and prevented it from opening. I scraped them out with a thin piece of plastic from some packaging and was able to get it working again. Traded it for a Fold 5 because of that. Unfortunately it seems the 5 has the same problems (not for me so far).",
              "score": 6,
              "created_utc": 1752077197.0,
              "replies": [
                {
                  "id": "n27uyaz",
                  "author": "Ton13579",
                  "body": "Still rocking my flip 4. Same thing happened 2 times. Love the phone, hate the hinge mechanism. Gonna try to buy the 7 at the end of the year",
                  "score": 5,
                  "created_utc": 1752084243.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n27uu1r",
              "author": "unepmloyed_boi",
              "body": "Repairing these phones is a nightmare. They literally have to break and replace the outer display to get to the internals even if the display is perfectly fine.",
              "score": 5,
              "created_utc": 1752084210.0,
              "replies": []
            },
            {
              "id": "n26wkzd",
              "author": "OniExpress",
              "body": "Yeah, im perfectly happy with my current Ultra but even then the 23 was so prone to damage that I already look at Samsung a little sideways. The vulnerability to literal pocket sand is too much for me to go with a folder.",
              "score": 3,
              "created_utc": 1752074937.0,
              "replies": []
            },
            {
              "id": "n2b2185",
              "author": "HurpityDerp",
              "body": "Exactly this. Just under two years and the hinge failed, now it's sitting in a drawer.",
              "score": 1,
              "created_utc": 1752121067.0,
              "replies": []
            },
            {
              "id": "n2jaaga",
              "author": "homeslice1479",
              "body": "I heavily used my Fold 3 every day for three years before upgrading to the 6, hinge held up well. Was the hinge better on 3 than 4?",
              "score": 1,
              "created_utc": 1752235599.0,
              "replies": [
                {
                  "id": "n2joad3",
                  "author": "iguacu",
                  "body": "No idea, but lost in this discussion is that I wouldn't have been that mad about the hinge breaking (under warranty) if it hadn't required driving to a 3rd party repair shop 30 minutes away 5 different times, so 5(!) hours of driving, months of waiting for Samsung to send them the part needed (I would call and they would say it should be in any day now), before finally cutting my losses before the 12-month warranty was up, mailing it to Samsung official repair, using a PIxel 2 for a few days, buying an iPhone, and putting the refurbished unit on Swappa as soon as it came back to cover half my losses.",
                  "score": 1,
                  "created_utc": 1752240459.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n27lcmg",
              "author": "peppaz",
              "body": "My fold 2 and fold 4 both had the weather sealing in the hinge explode out like spaghetti.",
              "score": 1,
              "created_utc": 1752081672.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n280e6g",
          "author": "Skaterkid221",
          "body": "I’m a soil scientist. I couldn’t get near one of these with a 10 foot pole.",
          "score": 9,
          "created_utc": 1752085760.0,
          "replies": [
            {
              "id": "n28ufcx",
              "author": "Alpha-Leader",
              "body": "I live in a high desert. Wind, dirt, sand. \n\nHard enough to keep regular phones from getting messed up.",
              "score": 3,
              "created_utc": 1752094056.0,
              "replies": [
                {
                  "id": "n28x469",
                  "author": "Skaterkid221",
                  "body": "My life is basically filled with sand, silt, and clay particles. Based on my time in the high desert I was the only one of my friends who didn’t notice how dusty I would get.",
                  "score": 1,
                  "created_utc": 1752094787.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n2c4q7t",
              "author": "phero1190",
              "body": "Pixel 10 Pro Fold is rumored to have an IP68 rating, so in line with most slab phones",
              "score": 2,
              "created_utc": 1752141600.0,
              "replies": [
                {
                  "id": "n2ienuk",
                  "author": "Pun_In_Ten_Did",
                  "body": "Don't know if I'm more excited for that or the price.",
                  "score": 1,
                  "created_utc": 1752219477.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n2a5c7r",
              "author": "SGTBookWorm",
              "body": "I'm a QA on infrastructure construction\n\nI would absolutely not be able to take that in the tunnels with me (which is a shame, because I really want one....)",
              "score": 1,
              "created_utc": 1752108870.0,
              "replies": [
                {
                  "id": "n2abjfv",
                  "author": "snoogins355",
                  "body": "The fold 7 is so thin, there has to be a case that would cover it",
                  "score": 1,
                  "created_utc": 1752111017.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n2bjivw",
          "author": "KBeightyseven",
          "body": "I hammer the shit out of my phones, being a mechanical engineer in the heavy industries, my zlip6 has held up surprisingly well! I have had it well over a year and nothing to note so far.",
          "score": 3,
          "created_utc": 1752129600.0,
          "replies": []
        },
        {
          "id": "n2bzbik",
          "author": "deserted",
          "body": "IP68 or bust. You gotta have standards.",
          "score": 3,
          "created_utc": 1752138557.0,
          "replies": [
            {
              "id": "n2c5w0r",
              "author": "ReddyGivs",
              "body": "Then get the pixel 10 pro fold when it drops, it will be IP68. Honestly this is fold 7 is a bust because it gets rid of the things that gave it an edge over its competitors. Without s pen and UDC its basically just an inferior Vivo X fold with a larger price tag. Only a fool would believe this is the best route for Samsung to go. At this point, Sammy has likely lost me as a customer because I would be stupid to choose the fold 7 over the pixel 10 pro fold's IP68. The only real trade off is the chip and camera but at the end of the day it still will have a great chip and camera with superior durability. \n\nMy guess is sammy is hoping casual users will become the core base for their foldable, but that isn't realistic with their pricing. If I want a thinner fold, I can get the Vivo X Fold that has a better camera, faster charging, bigger battery, and is thin with zero pen support and no UDC. Its basically a better version of fold 7, and the 1TB version is only $1599 compared to the 2k sammy wants. Sammy has lost the plot.",
              "score": 4,
              "created_utc": 1752142222.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n26l9q1",
      "author": "prestocoffee",
      "body": "Funny how they claimed they had to drop S-Pen support to make it thinner. Why then does the OPPO Find N5 have full OPPO stylus support on both external and internal screens while still being as thin as the Fold 7? Samsung is gaslighting the industry...",
      "score": 146,
      "created_utc": 1752071785.0,
      "replies": [
        {
          "id": "n26n1fa",
          "author": "criticalt3",
          "body": "Yeah with this and the new thin galaxy that doesn't include the s-pen I wouldn't be surprised if they're trying to back out of s-pen support to cut upkeep costs. While raising phone prices ofc.",
          "score": 51,
          "created_utc": 1752072288.0,
          "replies": [
            {
              "id": "n26ppdg",
              "author": "tubbis9001",
              "body": "The s pen is the only feature that kes me coming back to Samsung. I'll be so disappointed if they drop it entirely, especially after killing the note line and then finally bringing it back on the S ultra line a few years later.",
              "score": 30,
              "created_utc": 1752073031.0,
              "replies": [
                {
                  "id": "n26x4dc",
                  "author": "WingnutWilson",
                  "body": "I would assume kids these days will only ever type or dictate things and pens get very little use out of anyone under 25",
                  "score": 11,
                  "created_utc": 1752075083.0,
                  "replies": [
                    {
                      "id": "n2709e8",
                      "author": "stellvia2016",
                      "body": "Yeah, one of the podcasts I follow was advertising something called Plaud that you hit the button to turn it on and it will dictate the entire meeting, attribute dialogue to specific people, let you verbally ask it to search the minutes for things, annotate, etc.\n\nWhich ngl does sound like it could be transformative for everyone to simply be engaged and not have to worry about taking themselves out of a discussion to jot down notes. Question is how well does the speech to text actually work, and of course I'm sure it's a monthly fee of some sort.",
                      "score": 7,
                      "created_utc": 1752075939.0,
                      "replies": [
                        {
                          "id": "n277gu7",
                          "author": "Tom_A_toeLover",
                          "body": "I have one. It’s pretty good for all the things you’ve listed as far as subscriptions, you get 300 minutes free of transcriptions a month. There’s other plans too for unlimited minutes",
                          "score": 5,
                          "created_utc": 1752077914.0,
                          "replies": []
                        },
                        {
                          "id": "n278f5i",
                          "author": "blackscales18",
                          "body": "Yeah I just looked it up, it's using various models (chat gpt, Claude, Gemini) and requires either a yearly plan or pay by blocks of time. I don't trust most LLMs at all for accurate transcription, nvm translation, so this seems like it's probably a bad deal but as long as you don't mind paying 150 for the device and 100-250 per year for transcoding depending on how much you need (plan that comes with device only allows for 5 hours a month) then maybe it's an option?",
                          "score": 1,
                          "created_utc": 1752078176.0,
                          "replies": []
                        },
                        {
                          "id": "n2784y0",
                          "author": "Binks-Sake-Is-Gone",
                          "body": "I checked out plaud a while back,  and did a \"faux podcast\" with a buddy of mine, and it worked SPOOKY good (I do have GOOD microphones and we both annunciated a bit more intentionally than normal) . If I had a need for it, I'd probably be about it for life lol",
                          "score": 0,
                          "created_utc": 1752078099.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n27m1db",
                      "author": "VagueSomething",
                      "body": "As someone well over 25, outside of the novelty and playing Balatro I've found the Pen pretty pointless when applied to the real world. It is OK for editing photos but that's not a common real world need for me and has mainly been for shitposting into group chats. My handwriting is somewhere between doctor and poet even with a real pen so the fake pen being harder to hold makes it worse. Nice to have the feature but if it gets cut it will barely be missed.",
                      "score": 7,
                      "created_utc": 1752081856.0,
                      "replies": []
                    },
                    {
                      "id": "n27dds0",
                      "author": "juh4z",
                      "body": "I have no idea why anyone would use the pen to take notes, I use it for drawing and math.",
                      "score": 4,
                      "created_utc": 1752079541.0,
                      "replies": [
                        {
                          "id": "n2aa3ed",
                          "author": "_RADIANTSUN_",
                          "body": "Handwriting stuff is proven to improve retention and comprehension over typing stuff.",
                          "score": 3,
                          "created_utc": 1752110509.0,
                          "replies": [
                            {
                              "id": "n2cvuhk",
                              "author": "Hoverbeast",
                              "body": "I believe it, it helped me learn to code. I feel like it may be because I'm physically writing out the letters/numbers, and that's all unique, whereas typing.. it's all just the same size keys, the same tactile expression.",
                              "score": 1,
                              "created_utc": 1752152958.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n28onu4",
                      "author": "GrayDaysGoAway",
                      "body": "I can't imagine anyone under, like, 80 ever wanting to use a pen on a phone. It's wildly impractical for anything short of a full sized tablet, and even then it's only really good for art.",
                      "score": 3,
                      "created_utc": 1752092481.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n26q2n0",
                  "author": "criticalt3",
                  "body": "I agree completely",
                  "score": 2,
                  "created_utc": 1752073133.0,
                  "replies": []
                },
                {
                  "id": "n2ifkp3",
                  "author": "4r4r4real",
                  "body": "Honest question, what do you use it for? I've had 2 devices with it for 5ish years total and I'm pretty sure I can count on my fingers the times I've used it, almost always to scribble some dumb shit on a picture to send to a friend. ",
                  "score": 1,
                  "created_utc": 1752220000.0,
                  "replies": [
                    {
                      "id": "n2ivoj0",
                      "author": "tubbis9001",
                      "body": "I use it nearly every day on my 22 Ultra. Some mundane features I like: remote camera shutter (removed on newer phones unfortunately), cropping and annotating screen shots is a breeze, scrolling with a pen is often just more comfortable than a finger...especially if the screen is dirty or you have gloves on. It's also great for clicking on tiny links in websites that aren't optimized for mobile yet (or websites where the mobile version is dogshit and you need to force the desktop version. On that note, it acts like a cursor when hovered over the screen, allowing mouseover functionality such as drop down menus.\n\nThe S pen isn't for everyone. But for those of us that rely on it, we would never buy a phone without it unless absolutely forced to.",
                      "score": 2,
                      "created_utc": 1752229096.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n26n8n4",
          "author": "acegard",
          "body": "Can you get the Oppo folds in the US? Im very interested in those (as a Z Fold 5 owner) but haven't been able to find a good answer. I feel like Samsung is really dropping the ball here but I love the \"hotdog style\" form factor. So I'm definitely looking for alternatives.",
          "score": 8,
          "created_utc": 1752072345.0,
          "replies": [
            {
              "id": "n26pal1",
              "author": "prestocoffee",
              "body": "You can import them and use 3rd party insurance to cover any device hardware issues.  Hop over to r/OppoFindN5Phone and you'll find a list of retailers and a lot more information about which carriers and such it will work with",
              "score": 6,
              "created_utc": 1752072917.0,
              "replies": []
            },
            {
              "id": "n275064",
              "author": "spamjunk150",
              "body": "Depending on carrier, they totally gimp features. AT&T doesn't allow visual voicemail, wifi calling, etc.",
              "score": 2,
              "created_utc": 1752077236.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n26mtrx",
          "author": "Cornflakes_91",
          "body": "\"we had to remove our extra layer to fit stuff\" doesnt imply any impossibility for anyone else",
          "score": 18,
          "created_utc": 1752072228.0,
          "replies": [
            {
              "id": "n26pged",
              "author": "prestocoffee",
              "body": "yeah I understand that but it just seems like Samsung is dragging behind the challengers at this point and pulling an Apple with that statement",
              "score": 2,
              "created_utc": 1752072963.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n27dzz1",
          "author": "unematti",
          "body": "Ah. Dang. No sd card and now, no pen even. I'll hold onto my note 20 ultra i guess",
          "score": 6,
          "created_utc": 1752079706.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n26gqcz",
      "author": "chrisdh79",
      "body": "From the article: At 8.9mm thick when folded, it’s up there with the likes of the Oppo Find N5 as far as thinness goes. Oppo’s device is so slim that my colleague Dominic Preston dubbed it the “final evolution of foldables.” Open, the Z Fold 7 is just a hair thicker than the USB-C port on the bottom of the device. But there was one notable casualty in the quest to make it thinner: S Pen support. Samsung claims that omitting the screen layer that makes stylus support possible helped slim the phone down to its current proportions. I’ll take a slimmer foldable over a stylus-compatible foldable, but let’s observe a moment of silence for the S Pen Fold Edition.\n\nThe Fold’s new, wider format is a welcome change. The cover panel now measures 6.5 inches with a 2520 x 1080p resolution compared to the Fold 6’s 6.3-inch, 968 x 2376p screen. It finally feels like a normal phone when it’s closed. The inner screen is now 8 inches, and Samsung finally gave up trying to hide the inner selfie camera under the display and just put a 10-megapixel sensor behind a little hole-punch cutout. Good riddance. The water and dust resistance remains the same, with an IP48 rating like the last two models.\n\nNow, the bad news: **two thousand US dollars. Or $1,999**, to be precise — that’s what the Z Fold 7 costs. With the price of everything going up, the tariffs situation, and the R&D costs that went into this newer, thinner Fold, I guess I shouldn’t be surprised. At $1,899, the Fold 6 wasn’t exactly cheap. But something about the words two thousand dollar smartphone just feels wrong, you know?\n\nBut back to the good news: the Flip is getting a proper edge-to-edge cover screen for the first time. It’s the direction Motorola went when it relaunched the Razr a few years ago, and I think it’s the right one. Samsung uses the extra screen real estate next to the camera cutouts for the time and date as you swipe through widget panels, or for navigation buttons in apps, which is cute. Sure, it’s a little awkward working around them, but I’d rather deal with this and reap the benefits of a bigger screen than be hemmed in by the file folder shape.",
      "score": 38,
      "created_utc": 1752070481.0,
      "replies": [
        {
          "id": "n26sjh6",
          "author": "thisischemistry",
          "body": "> Now, the bad news: two thousand US dollars.\n\nNo thanks.",
          "score": 47,
          "created_utc": 1752073822.0,
          "replies": [
            {
              "id": "n28q5q1",
              "author": "fauxmonkey",
              "body": "Even with discounts and max trade in it's like $800 before taxes. Not going to work out that kind of money for basically a thinner Fold.",
              "score": 7,
              "created_utc": 1752092890.0,
              "replies": []
            },
            {
              "id": "n28utsb",
              "author": "Alpha-Leader",
              "body": "I play this game, how many X is my house worth? Overpriced things stick out like a sore thumb.",
              "score": 2,
              "created_utc": 1752094165.0,
              "replies": []
            },
            {
              "id": "n2b1vhm",
              "author": "iceman012",
              "body": "I can get this folding phone, or I could buy a regular phone, tablet, and build a decent gaming PC.\n\nChoices, choices.",
              "score": 2,
              "created_utc": 1752120998.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n29clk2",
          "author": "Ilikejoints",
          "body": "Can't wait to buy it in 2 years through Amazon renewed for 650.",
          "score": 5,
          "created_utc": 1752099329.0,
          "replies": []
        },
        {
          "id": "n2bznvj",
          "author": "Mmm_bloodfarts",
          "body": "So 2k for a phone with the same battery, no s-pen, easier to break but a bit slimmer? When can i get one? /s",
          "score": 2,
          "created_utc": 1752138758.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n28kckk",
      "author": "WordNERD37",
      "body": "This was a let down and no innovation in the sector as there have been a number of other companies that have already blazed past what the fold 7 just showed off, and are still better. The only advantage Samsung has, is a near universal monopoly in the US market. Oppo, isn't sold here, Honor, isn't sold here. OnePlus is and already there's rumors to axe even them from being sold here.\n\nIt's BS, and this is coming from a near quarter century Samsung user and owner of multiple fold phones including the fold 6 I'm typing from. The form factor they just announced should have been the standard two generations ago. What the 7 should have introduced was a camera array that isnt a massive tumor on the back it makes it impossible to lay it flat.\n\nAdd in the same li-ion battery in a sector moving towards Carbon-Silicon and no spen support AND $100 more, look, you only do this when you know you have no real competition anymore.\n\nIf OnePlus puts put their next foldable out next year as they said; I'll be moving to that. I'm consistently impressed with their devices and now's the time to make the switch. Samsung is now in their lazy couple of years of pointless features.",
      "score": 12,
      "created_utc": 1752091289.0,
      "replies": [
        {
          "id": "n2e7utj",
          "author": "ROBOSEXUAL2020",
          "body": "The battery was the main reason why I said no thanks my fold 6 dies  fast as hell even on power saving 5000 battery in the ultra 25 is perfect can use all day",
          "score": 1,
          "created_utc": 1752166870.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n26ls31",
      "author": "Next-Acanthaceae-681",
      "body": "I’m not sure if I’ll ever opt for a folding device",
      "score": 32,
      "created_utc": 1752071931.0,
      "replies": [
        {
          "id": "n26o4m9",
          "author": "crappy80srobot",
          "body": "Price and durability always get me. I get it won't be average smartphone price but a full 1K more, I just can't agree with. Maybe $1400-$1500. Durability may never come. We are seven generations in and still have a screen with a visible crease and using it still feels fragile. I think durability loss is just the devil you get with something like this. With my high workload this thing probably would not last a year.",
          "score": 26,
          "created_utc": 1752072593.0,
          "replies": [
            {
              "id": "n26ozso",
              "author": "webbedgiant",
              "body": "It's 100% durability for me, it's in the back of my mind every time I see one of these. I'd save up money for a \"two-in-one\" device if there wasn't the looming possibility of it breaking through no fault of my own.",
              "score": 14,
              "created_utc": 1752072835.0,
              "replies": [
                {
                  "id": "n26v2o3",
                  "author": "Novel_Fix1859",
                  "body": "I've had the Fold 4 for a couple years now with zero issues",
                  "score": 8,
                  "created_utc": 1752074520.0,
                  "replies": [
                    {
                      "id": "n26vbk9",
                      "author": "webbedgiant",
                      "body": "Right but you're one person, I've heard enough reports to stay away for a long time until I've heard from the majority that the issues have been snuffed out.",
                      "score": 0,
                      "created_utc": 1752074588.0,
                      "replies": [
                        {
                          "id": "n26yf8o",
                          "author": "Anon28301",
                          "body": "I literally watched as my boss’s Samsung flip phone broke on her. It snapped in half after two years of use.",
                          "score": 6,
                          "created_utc": 1752075440.0,
                          "replies": [
                            {
                              "id": "n28o3qc",
                              "author": "HighlyOffensive10",
                              "body": "Did she take decent care of it though? I a coworker and his wife bought a fold 4. She still has hers, his broke in less than a year.",
                              "score": 1,
                              "created_utc": 1752092329.0,
                              "replies": [
                                {
                                  "id": "n28z85o",
                                  "author": "Anon28301",
                                  "body": "From what I saw she did, although I only see her at work so I can’t really say. Although I’ve heard from many people online that took care of theirs and still had it break within a few years.",
                                  "score": 1,
                                  "created_utc": 1752095368.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n28tz9o",
                          "author": "TheBeardedDen",
                          "body": "The fact you think there are problems, and that the majority doesn't find them just fine is a you being misinformed problem. If there were actual issues there would be lawsuits and daily articles by people trying for rage bait.",
                          "score": -1,
                          "created_utc": 1752093934.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n27dqkt",
                  "author": "Ipaidformyaccount",
                  "body": "idk why people so worried about the durability. Have had my z fold 2 since launch and over the years I've dropped it on wet dirt, on sand (took a few days opening and closing to grind out all the tiny sand bits in there), on the floor few times. Have survived extreme heat, cold and rain. All that without any case or cover. Only reason I'm thinking of updating is because of the android updates.",
                  "score": 5,
                  "created_utc": 1752079637.0,
                  "replies": [
                    {
                      "id": "n28fdg4",
                      "author": "anyavailablebane",
                      "body": "Probably because you are one data point and people see/hear more stories of them breaking than they do of them working flawlessly. I have no idea of the actually statistics and I highly doubt Samsung would release them. That leaves people to believe what they hear the most. And especially if they are going to be $2k, a lot of people would be hesitant to try until people they knew personally had good experiences.",
                      "score": 1,
                      "created_utc": 1752089910.0,
                      "replies": [
                        {
                          "id": "n28g4p0",
                          "author": "Ipaidformyaccount",
                          "body": "because people dont come online to talk about how their things are working well only when something breaks down",
                          "score": 5,
                          "created_utc": 1752090121.0,
                          "replies": [
                            {
                              "id": "n28i5f5",
                              "author": "anyavailablebane",
                              "body": "I understand mate. I’m just telling you the perception it gives people and will cause some people to hold off till they know someone personally and then probably go by whatever their experience is. Especially at $2k.",
                              "score": -2,
                              "created_utc": 1752090680.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n28udr9",
                          "author": "TheBeardedDen",
                          "body": ">  people see/hear more stories of them breaking \n\nNo. They don't. Stop repeating misinformation. If it was a problem they wouldn't keep making them. Youtube/influencers/no-lifers would make video after video of them failing for clicks and clout.",
                          "score": -2,
                          "created_utc": 1752094044.0,
                          "replies": [
                            {
                              "id": "n2d3s0a",
                              "author": "NotJohnDarnielle",
                              "body": "Every single person I know IRL who has a folding phone, except for the one who kept a Z Flip in a purse and not a pocket, has had an issue with durability",
                              "score": 1,
                              "created_utc": 1752155479.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n29qw5c",
                      "author": "ReachMaterial3794",
                      "body": "fold 6 here caseless, dropped on dirt, sand, cement, no issues. fold 5 same but with a case.  I was one of the ones who was also worried about durability, until i had one. The only thing I hate is the cover screen seems to scratch very easy",
                      "score": 0,
                      "created_utc": 1752103945.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n2a4dpu",
                  "author": "2K_Crypto",
                  "body": "Its honestly pretty durable (own a fold 6, caseless), have dropped a few times, and still works great. The crease is another argument but honestly the only ones who notice are other people looking at my screen from an angle. When im looking at it directly watching a movie, i don't even see it.",
                  "score": 1,
                  "created_utc": 1752108538.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n2g423r",
              "author": "kenda1l",
              "body": "The visible crease is an immediate deal breaker for me, much as I would love such a big screen. I wouldn't be able to pay attention to anything else.",
              "score": 1,
              "created_utc": 1752186495.0,
              "replies": []
            },
            {
              "id": "n2a10u5",
              "author": "Possible_Check_2812",
              "body": "It's pretty durable tho. I have had my fold 5 survive longer than regular phones ant it dropped on the concrete several times.",
              "score": -1,
              "created_utc": 1752107369.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n27o72m",
          "author": "KEVLAR60442",
          "body": "I was planning on getting a Z-Fold, but I was waiting on IMPROVED S-pen support, not removed S-pen support.",
          "score": 5,
          "created_utc": 1752082434.0,
          "replies": []
        },
        {
          "id": "n27sj2a",
          "author": "unepmloyed_boi",
          "body": "These things are risky to own outside of warranty. Was speaking to repair shop owner who said they're seeing a lot of these phones have fault issues within 1-2 years and they usually have to damage the inner display and frame to get to the internals, something that is very expensive outside warranty. I've owned every generation(because of work) and every generation has had to go in for repairs. This is coming from someone who coddles their phones and never drops them. There will always be some schmuck that says \"I've owned my fold 1 for 5 years\" but the reality is there are a lot of complaints regarding folds online.",
          "score": 5,
          "created_utc": 1752083586.0,
          "replies": []
        },
        {
          "id": "n28293o",
          "author": "dhardison",
          "body": "I could never get used to that crease in the screen.",
          "score": 2,
          "created_utc": 1752086279.0,
          "replies": []
        },
        {
          "id": "n28zfi1",
          "author": "jbaber",
          "body": "Only way mainstream companies will allow me a small phone.",
          "score": 1,
          "created_utc": 1752095425.0,
          "replies": []
        },
        {
          "id": "n2aixp4",
          "author": "TheBlackArrows",
          "body": "I just don’t care at all about a folding phone. Honestly it’s just not for me especially with the dip in the screen.",
          "score": 1,
          "created_utc": 1752113608.0,
          "replies": []
        },
        {
          "id": "n270nes",
          "author": "ConsistentAsparagus",
          "body": "You know what? I was on your boat, having an iPhone 12 Pro Max (not a small phone).\n\nBut then I thought: what if I could have a phone this big AND a small tablet? I’d need it, as for some uses the 12PM is still too small (but a tablet is too big to bring with me ALL the time…).\n\n\n\nOf course, I’m returning to your boat when we talk about implementations…",
          "score": -1,
          "created_utc": 1752076045.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n26m2i4",
      "author": "starfishy",
      "body": "I'd much rather have had a thicker foldable with more battery life, the internal camera in a corner, and S-Pen support ( we don't know for sure yet, but there are a lot of reports the S-Pen has been scrapped) for a more agreeable price point.",
      "score": 30,
      "created_utc": 1752072014.0,
      "replies": [
        {
          "id": "n28h09u",
          "author": "external72",
          "body": "Tbh hopefully we get to that point where all you said would be true but right now your expectations just sounds like “I want a Ferrari amalfi for the price of Toyota Corolla” to me lol\n\nPlus you have that option right now too ig like you can get fold 6 which is thicker, has “more” battery and S pen support too? Just not the camera you want. All for $1500ish since fold 7 is out and price on previous generation would drop",
          "score": 10,
          "created_utc": 1752090365.0,
          "replies": [
            {
              "id": "n28u011",
              "author": "starfishy",
              "body": "I would be willing to pay the price if at least the other points were addressed. The Z Fold 6 512GB is $1999 at Samsung right now, so no deal.",
              "score": 3,
              "created_utc": 1752093940.0,
              "replies": [
                {
                  "id": "n292csv",
                  "author": "external72",
                  "body": "That’s fair. I think we’re still a few years away from any viable price drop in Samsung fold. I’ve seen a few deals tho and I got my dad a fold 6 for $1350 or so (256gb I think) back in January",
                  "score": 3,
                  "created_utc": 1752096259.0,
                  "replies": [
                    {
                      "id": "n29810e",
                      "author": "starfishy",
                      "body": "There are sales once in a while, but not the expected considerable drop. While I would really miss the S-Pen, between the Fold 6 and 7 for the same price I would buy the 7 for a simple reason. It will bring more at trade and thus TCO is actually lower for the newer phone",
                      "score": 2,
                      "created_utc": 1752097929.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n2bzwyp",
              "author": "Mmm_bloodfarts",
              "body": "Sure, older hardware, older tech don't mean anything, i'll just pass on having a foldable, thank you",
              "score": 1,
              "created_utc": 1752138904.0,
              "replies": []
            },
            {
              "id": "n2ift3h",
              "author": "4r4r4real",
              "body": "I'm sorry, a front engined V8 Ferrari? When did we fall into poverty?",
              "score": 1,
              "created_utc": 1752220131.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n27hucu",
          "author": "CharacterWish3708",
          "body": "You can have better and bigger batteries the tech exists.",
          "score": 1,
          "created_utc": 1752080734.0,
          "replies": []
        },
        {
          "id": "n2ala4k",
          "author": "djdante",
          "body": "Yeah, everyone is so obsessed with the phone being thinner… the legacy fold thickness wasn’t bugging me at all… if they had kept that thickness with a big battery, and the full camera array from ultra series and the fold 7 screen dimensions they would have knocked it out of the park.",
          "score": 0,
          "created_utc": 1752114445.0,
          "replies": [
            {
              "id": "n2c05xa",
              "author": "Mmm_bloodfarts",
              "body": "People don't give a rat's ass about thickness (to a degree of course, no one would want a 2inch brick), mostly it's just a manufacturer dick measurement contest",
              "score": 1,
              "created_utc": 1752139047.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n2705qg",
      "author": "angsteroflove",
      "body": "What is with this thinness obsession? All the verge has been asking for is a thinner phone?",
      "score": 26,
      "created_utc": 1752075911.0,
      "replies": [
        {
          "id": "n27a018",
          "author": "Sivalon",
          "body": "Mostly so when it’s folded up it feels as thick as a regular smartphone that can’t fold. I’ve handled the Fold 7, when it’s unfolded you feel like you could slice lunchmeat with it.",
          "score": 20,
          "created_utc": 1752078611.0,
          "replies": []
        },
        {
          "id": "n27nr6f",
          "author": "LordMoos3",
          "body": "Foldables are generally kinda thicc. \n\nThe samsung folds were extra thicc. \n\nThis is a much better design.",
          "score": 5,
          "created_utc": 1752082318.0,
          "replies": []
        },
        {
          "id": "n2c68bh",
          "author": "signspace13",
          "body": "I had the fold 3, and now have the fold 6. \n\nFoldable a are chonky phones, heavy and thick. The thinner they are unfolded, the thinner they are folded.\n\nI don't disagree that for regular candy bar phones, the pursuit of thinness is taken a little far, as the extra thickness could allow for better batteries and camera's with just a bit more thickness.",
          "score": 1,
          "created_utc": 1752142403.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n27lyhj",
      "author": "metarinka",
      "body": "I have the one plus open which was miles ahead of the flip 6.  I don't think I would have any reason for changing.",
      "score": 3,
      "created_utc": 1752081835.0,
      "replies": [
        {
          "id": "n28l1w3",
          "author": "WordNERD37",
          "body": "When they drop the Open 2 next year, I'm swapping over to it. I'm done with Samsung's fold phones.",
          "score": 4,
          "created_utc": 1752091486.0,
          "replies": [
            {
              "id": "n2a15vs",
              "author": "metarinka",
              "body": "yeah bummed it hasn't come to the US, not limited by my phone at the moment so I'll wait for this to get old and die.",
              "score": 3,
              "created_utc": 1752107417.0,
              "replies": [
                {
                  "id": "n2a2rcd",
                  "author": "WordNERD37",
                  "body": "I'm sitting on a Fold 6. I love the fold format. I can never go back. For work and pleasure, it's really a lifesaver, but I am exhausted with the sideways innovation and lackluster delivery from Samsung and for a long time now. This model just missed the mark in nearly everyway for me.",
                  "score": 1,
                  "created_utc": 1752107976.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n26j2dp",
      "author": "None",
      "body": "[deleted]",
      "score": 9,
      "created_utc": 1752071151.0,
      "replies": [
        {
          "id": "n26sjdv",
          "author": "green_link",
          "body": "Mortgage payment? more like a months rent now",
          "score": 6,
          "created_utc": 1752073821.0,
          "replies": [
            {
              "id": "n26zfvr",
              "author": "TwelveGaugeSage",
              "body": "Renting, at least in my area, is far more expensive than buying.",
              "score": 7,
              "created_utc": 1752075717.0,
              "replies": [
                {
                  "id": "n2d48wj",
                  "author": "NotJohnDarnielle",
                  "body": "It usually is cheaper in terms of monthly payment, that’s how landlords make profit. The barrier to owning a home is the down payment and savings (or, in a real pinch, credit) to fix things when they break.",
                  "score": 1,
                  "created_utc": 1752155618.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n27nemb",
          "author": "Spirited-Pause",
          "body": "where do you live, the year 1995?",
          "score": 5,
          "created_utc": 1752082225.0,
          "replies": [
            {
              "id": "n2dgmu9",
              "author": "K__Geedorah",
              "body": "Mortgage payments in 95 were like $800. $2-3k is pretty achievable and standard today.\n\nEven in Denver where I have been looking it's between that range. Look at cheaper places in the Midwest and you can still get mortgages for like $1.5k. Hell, I know people in Indiana paying $950 for their mortgage.",
              "score": 1,
              "created_utc": 1752159231.0,
              "replies": [
                {
                  "id": "n2dmfen",
                  "author": "Spirited-Pause",
                  "body": "actually, now that I do the math, if we’re talking a 20% down payment over a 30 year mortgage and best case when the interest rates were like 3%, then a $2000 mortgage payment would correlate to our house that cost from 580 to 600.\n\nThat’s not as low as I was expecting! I must be desensitized by New York area home price prices. ",
                  "score": 1,
                  "created_utc": 1752160845.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n2bjelf",
          "author": "MarinoTheGOAT",
          "body": "Is it a mortgage for a cardboard box?",
          "score": 0,
          "created_utc": 1752129536.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n27613w",
      "author": "Kevadu",
      "body": "But lower price is literally all I have been asking for...",
      "score": 3,
      "created_utc": 1752077521.0,
      "replies": []
    },
    {
      "id": "n280tvv",
      "author": "markarth69",
      "body": "All I've been asking for is a Fold with decent battery life. I'm not seeing that. Seems this Fold 5 will be my last from Samsung",
      "score": 3,
      "created_utc": 1752085883.0,
      "replies": []
    },
    {
      "id": "n28cdts",
      "author": "kevin7254",
      "body": "2600 bucks in Sweden wtfff",
      "score": 3,
      "created_utc": 1752089087.0,
      "replies": []
    },
    {
      "id": "n2cs9mq",
      "author": "Mr_Lumbergh",
      "body": "I'll never understand the concept of \"let me double the thickness of my phone before putting it back in my pocket.\" I don't get the foldable hype.",
      "score": 3,
      "created_utc": 1752151743.0,
      "replies": []
    },
    {
      "id": "n2ghxcj",
      "author": "rearisen",
      "body": "Can't wait for the screen cracks along the spine again. Im sure they are still putting the wifi and Bluetooth over the spine, too. Anti consumer products with planned obsolescence.",
      "score": 3,
      "created_utc": 1752191019.0,
      "replies": []
    },
    {
      "id": "n26o6d5",
      "author": "Azsde",
      "body": "Yikes, no UDC, no S-Pen support AND a price increase?!",
      "score": 10,
      "created_utc": 1752072607.0,
      "replies": []
    },
    {
      "id": "n26nhf2",
      "author": "Nobanob",
      "body": "Cell phones are like TVs these days. Sure you can shell out $2,000 for the strongest but you can get something almost as nice for a 5th of the price. I'll just wait a couple years and get one of those",
      "score": 11,
      "created_utc": 1752072413.0,
      "replies": [
        {
          "id": "n28cu8t",
          "author": "circuitocorto",
          "body": "Can you get a foldable for a 5th of the price?",
          "score": 6,
          "created_utc": 1752089213.0,
          "replies": [
            {
              "id": "n28sy04",
              "author": "Nobanob",
              "body": "A 1/4th of the price is the best I could find at the moment. Give it 6 months",
              "score": 1,
              "created_utc": 1752093653.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n26tmpo",
          "author": "dat_oracle",
          "body": "I paid 250 for a barely used S22 Ultra. it's awesome in many ways. even in 2025, also next year. \n\nS25 is the current one, but I don't see a single reason to pay 1000 bucks more for laughable differences.",
          "score": 5,
          "created_utc": 1752074122.0,
          "replies": [
            {
              "id": "n272pz3",
              "author": "Nobanob",
              "body": "It's so stupid. I always upgraded to the best phone Samsung had to offer* that was 2+ years old by the time I was getting it. \n\nI got my S9 free on a promo because they were trying to get rid of old stock. Super cheap (for Canada) plan and the best phone 2 years ago (at the time) had to offer. For free!",
              "score": 1,
              "created_utc": 1752076607.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n273aj2",
          "author": "Dt2_0",
          "body": "Ehh with TVs, its hit or miss for sure. There are some great grabs in the $600 price range from TCL or Hisense (I would not go major brands in that range, they often charge a premium for the same specs) if you are looking at a 55 inch, but you need to be okay with a backlit tv.\n\nBut once you get up to the LG B series OLEDs, it's very much diminishing returns when it comes to TVs. Heck if Sansui OLEDs keep showing up in the $700 price range, and if they upgrade their HDMI board to even the boards Hisense and TCL use on the LED TVs, then it will be a monster at that price range. Their picture quality was already great, but you were stuck with HDMI 2.0, so gaming wasn't great on them, and they only had ARC, not eARC, so 5.1 audio is compressed.",
          "score": 1,
          "created_utc": 1752076763.0,
          "replies": [
            {
              "id": "n274i2j",
              "author": "zefiax",
              "body": "I agree that there are diminishing returns as you move up market on TV's but the difference is still noticeable, even to the untrained eye. I have LG G series and everyone who comes over is blown away the first time they see the picture and colour quality on it.\n\nBut of course, would not recommend if it means stretching your budget.",
              "score": 3,
              "created_utc": 1752077096.0,
              "replies": [
                {
                  "id": "n28fwby",
                  "author": "Dt2_0",
                  "body": "Oh I agree, I just think 90% of people who are using TVs in their living rooms where (due to lighting, placement, etc) they won't get a huge benefit from going for a flagship TV over your standard OLED Heck in a bright room with lots of glare, a cheaper MiniLED with good local dimming is often better than a cheaper OLED just because they can get brighter.",
                  "score": 2,
                  "created_utc": 1752090057.0,
                  "replies": [
                    {
                      "id": "n28gd7f",
                      "author": "zefiax",
                      "body": "Fully agree, it's not for most people.",
                      "score": 1,
                      "created_utc": 1752090187.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n26lmat",
      "author": "ExplosiveDisassembly",
      "body": "As long as Motorola can give me a solid mid-ranger with a stylus, SD card, and IP68 rating for under 150, there is little reason to get a flagship for just about any reason.",
      "score": 9,
      "created_utc": 1752071885.0,
      "replies": [
        {
          "id": "n26n9eq",
          "author": "criticalt3",
          "body": "Can you tell me which model this is? I'm interested",
          "score": 6,
          "created_utc": 1752072351.0,
          "replies": [
            {
              "id": "n26pokh",
              "author": "xrailgun",
              "body": "Edge 60 stylus probably. Even has 3.5mm jack. But afaik you have to import it from India. There's a global version at double the price *and* a worse SoC.",
              "score": 8,
              "created_utc": 1752073025.0,
              "replies": [
                {
                  "id": "n26ridx",
                  "author": "polopolo05",
                  "body": "whats that called so I can avoid it.... but damn its got all the stuff i want... headphone jack, sd card.... get me a removable battery then we have a winner. and an ir port it would be my phone from 2018",
                  "score": 6,
                  "created_utc": 1752073534.0,
                  "replies": [
                    {
                      "id": "n2av5c8",
                      "author": "xrailgun",
                      "body": "I think the global one is Motorola Moto G Stylus (2025)",
                      "score": 1,
                      "created_utc": 1752118221.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n26ptce",
                  "author": "criticalt3",
                  "body": "Damn.",
                  "score": 2,
                  "created_utc": 1752073061.0,
                  "replies": []
                },
                {
                  "id": "n28emci",
                  "author": "polopolo05",
                  "body": "BTW whats SOC stand for?",
                  "score": 1,
                  "created_utc": 1752089708.0,
                  "replies": [
                    {
                      "id": "n2av8d1",
                      "author": "xrailgun",
                      "body": "System on Chip, aka the processor (snapdragon something something).",
                      "score": 1,
                      "created_utc": 1752118256.0,
                      "replies": [
                        {
                          "id": "n2azkoo",
                          "author": "polopolo05",
                          "body": " SM6475-AB  on the moto G stylus, which is snapdrgn 6 gen 3 vers the SM7435-AB  on the edge 60, which is a spandragon 7 gen 2... they are super close in performance like 1% difference.",
                          "score": 1,
                          "created_utc": 1752120019.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n26uwr9",
              "author": "ExplosiveDisassembly",
              "body": "Moto stylus 2025. They go on sale several times a year, and carriers have deals on them constantly. I have Google FI and just got one for 100 bucks.\n\nThe IP68 is the only reason I upgraded from the 2023 model. They're solid enough for 90% of what you need a phone for, and have pretty decent cameras.",
              "score": 3,
              "created_utc": 1752074474.0,
              "replies": [
                {
                  "id": "n26v8kv",
                  "author": "criticalt3",
                  "body": "Thanks!",
                  "score": 1,
                  "created_utc": 1752074565.0,
                  "replies": [
                    {
                      "id": "n26vyb2",
                      "author": "ExplosiveDisassembly",
                      "body": "They retail for 300, but I promise I have never paid more than 150 for one. They have gone on sale between black Friday and new Year's every year since 2022 at least.",
                      "score": 1,
                      "created_utc": 1752074762.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n27moux",
                  "author": "10000Didgeridoos",
                  "body": "Is Motorola still terrible with OS updates? I had a phone or two of their's back in the 2010s and they were always the dead last android phone manufacturer to get around to pushing out new android versions. Like a year or more after pixels got it.",
                  "score": 1,
                  "created_utc": 1752082033.0,
                  "replies": [
                    {
                      "id": "n27oikl",
                      "author": "ExplosiveDisassembly",
                      "body": "I really don't notice the major android stuff. I want to say it's within a couple months of me seeing that the new versions are released? The security updates are always pretty good though.",
                      "score": 1,
                      "created_utc": 1752082520.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n276d6b",
          "author": "Sick_Wave_",
          "body": "My reason is entirely pocket fitability. My fold sits in the bottom of my pocket, whereas a current full-size normal phone stabs me in the stomach when I try to bend over, and threatens to fall out when riding UTVs. Last thing I want is to lose my phone in the middle of a pasture. \n\n\nThese samsung phones are crazy expensive though. Next time I'm just getting a Caterpillar feature flip phone or similar. All I need smartwise is maps and audiobooks. ",
          "score": 1,
          "created_utc": 1752077613.0,
          "replies": [
            {
              "id": "n277rwc",
              "author": "ExplosiveDisassembly",
              "body": "The SD card is the kicker for me. I'd have one of the folding flagships if they had an SD card. I don't think I've ever had a phone (flagship or not) that connected to a computer with the full speed of the USB. It has always been spotty and slow. I transfer lots of photos back and forth so it saves me endless amounts of time to pop an SD out, put in my computer, and bam - entire data transfer is done in a couple minutes.\n\nAnd Motorola has an amazing new phone feature. You just plug them together with USB C and everything copies 1 to 1. I transferred my 2 year old phone to my new phone and I didn't have to change a single setting, it just worked.",
              "score": 3,
              "created_utc": 1752077998.0,
              "replies": [
                {
                  "id": "n27fruz",
                  "author": "OutlyingPlasma",
                  "body": "SD card story time: My partner left her phone on top of the car once. By the time we figured out what happened and drove back the phone was totally smashed. Likely it had been driven over multiple times on a gravel road. If it had not had and SD card, all the photos would have been lost. Instead she just dug the card out of the debris and just transferred the files to a PC because the card was just fine. This is why I want a card. That and modern phones are just pathetic with the amount of storage they give you. My podcasts alone would fill a mid ranged apple phone.",
                  "score": 2,
                  "created_utc": 1752080177.0,
                  "replies": [
                    {
                      "id": "n27h4nf",
                      "author": "ExplosiveDisassembly",
                      "body": "Definitely, damage is what I'm worried about. \n\nChances are, I'm going to find a lost phone with all the apps and websites that Google/apple have now. I have lost and found it multiple times with no problems. My concern is a phone breaking and locking up all the data. An SD card prevents that, and retains full sized originals, not the compressed garbage Google drive saves.",
                      "score": 2,
                      "created_utc": 1752080538.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n2b3tw4",
      "author": "Latenighredditor",
      "body": "I have the ZFold4. While I love the interior display the durability of this phone is awful. I had a small pinch on the inside screen. Sometime later both wifi and data plan stopped working. I got a new refurbished replacement but a few weeks after it just had a line in thr middle that wouldn't go away and eventually I got the black line of death. Then I replaced all the parts and even know the inside hinge quickly forms bubbles and im starting to the wifi data plan issue again. I'm contemplating getting a new phone entirely.",
      "score": 2,
      "created_utc": 1752121856.0,
      "replies": []
    },
    {
      "id": "n2c5fml",
      "author": "Euphorix126",
      "body": "Nobody asked for folding screens",
      "score": 2,
      "created_utc": 1752141981.0,
      "replies": []
    },
    {
      "id": "n2clz0i",
      "author": "Buglardons",
      "body": "\"Galaxy Z Fold 7 hands-on: Samsung finally made the foldables we’ve been asking for | Except for the price. We didn’t ask for that.\" Who asked for no spen support ???? that was litteraly the only thing making me buy a samsung fold and for the first time since years i will not update my fold because i use the spen everyday. I remember people asking for spen on cover and inner display, so no they didn't listen + the under screen camera is gone and tradein makes it  2.5x more expensive than last year in my country, battery is still the same and everyone asked for better battery,  they compromised everything and everything that made them stand out/unique in the goal of thickness to compete agains chinese in the eye of their investor, that's stupid. Now if i want a fold with a pen i need to go to a chinese competitor. + Chinese competitor have still better hardware than samsung fold. 200Mpx camera but very mid in zoom. No stop praising this \"update\". I'm quoting this word since there is really few new things since the already bad samsung folde se from 2024. I hate them such a deception each year is worth and worth",
      "score": 2,
      "created_utc": 1752149439.0,
      "replies": []
    },
    {
      "id": "n2crw1x",
      "author": "Sufficient_Object_64",
      "body": "Except for the price, except for the larger battery, except for faster charging speed, except for SPEN functionality on the outer screen (now we get ZERO SPEN...). Camera still behind competition. Sure, they are really making the foldables we've been asking for. What a bitter LMAO...",
      "score": 2,
      "created_utc": 1752151609.0,
      "replies": []
    },
    {
      "id": "n2ekf0t",
      "author": "DiamondCutter_DDP",
      "body": "Im interested in the fold when Samsung comes out with a 13\" version. 8\" just doesnt cut it.",
      "score": 2,
      "created_utc": 1752170241.0,
      "replies": []
    },
    {
      "id": "n2gck8d",
      "author": "bws7037",
      "body": "2K for a phone? They need to lay off the crack.",
      "score": 2,
      "created_utc": 1752189237.0,
      "replies": []
    },
    {
      "id": "n26o7ny",
      "author": "mcasao",
      "body": "after my Fold 4 fiasco of breaking at the crease every year I will pass on any more..",
      "score": 3,
      "created_utc": 1752072617.0,
      "replies": []
    },
    {
      "id": "n27wx68",
      "author": "kingsappho",
      "body": "does it come with all the Samsung bloatware?",
      "score": 2,
      "created_utc": 1752084793.0,
      "replies": []
    },
    {
      "id": "n26v1q5",
      "author": "Dorraemon",
      "body": "$2k and I can't trade in my pixel 9 pro",
      "score": 1,
      "created_utc": 1752074513.0,
      "replies": []
    },
    {
      "id": "n27eq8z",
      "author": "shifty_coder",
      "body": "‘Folds flat’ was the innovation I was waiting for. Now to wait a couple more generations for the price to come down.",
      "score": 1,
      "created_utc": 1752079901.0,
      "replies": []
    },
    {
      "id": "n27sf00",
      "author": "dream__weaver",
      "body": "I haven't had a Z Fold since the 2. I loved it but never bought another because of the micro cracks along the inner screen hinge. Is that still an issue with the newer models? If so, I'd have to imagine the thinner, more compressed inner screen may suffer worse from this, unless of course the tech has already been enhanced",
      "score": 1,
      "created_utc": 1752083556.0,
      "replies": [
        {
          "id": "n28kw06",
          "author": "WordNERD37",
          "body": "I've moved through now 3 gens of folds (3-6). Never had the issue crop up for me. The factory installed screen protector on the fold screen is still a piece of crap and bubbles away after about 8 months of usage still though.",
          "score": 3,
          "created_utc": 1752091440.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n27u0x3",
      "author": "unepmloyed_boi",
      "body": "Samsung's prices are marketing bs and just exist to give people FOMO. And it works. I've seen hundreds of people desperately chasing for their phones on bargain forums when it goes to half or even 1/3 the price at launch or multiple times later during the year and samsung throwing multiple stackable coupons at people. There is a reason samsung phones never hold their value. Only someone living under a rock buys these things at full price.",
      "score": 1,
      "created_utc": 1752083988.0,
      "replies": []
    },
    {
      "id": "n28bk55",
      "author": "PresStart2BegN",
      "body": "Only complain I have is that cutout on the internal screen looks abysmal…… 2025 and that’s the best they could do with that …. ",
      "score": 1,
      "created_utc": 1752088859.0,
      "replies": []
    },
    {
      "id": "n28i4ab",
      "author": "byzvntine",
      "body": "After using Chinese foldables, I realize that the US market is starving for good options",
      "score": 1,
      "created_utc": 1752090671.0,
      "replies": []
    },
    {
      "id": "n28k9zb",
      "author": "willhub1",
      "body": "How would this be in my sweaty back pocket of my cycling top? My S25 Ultra regularly is covered in my sweat, will the Z Fold be ok with this?",
      "score": 1,
      "created_utc": 1752091269.0,
      "replies": []
    },
    {
      "id": "n28sc68",
      "author": "architect___",
      "body": "Mention of the battery is conspicuously absent... When you hear a phone is getting much thinner, the immediate question should be how that impacts the battery.\n\nIs it smaller?\n\nDid they finally decide to use the \"new\" tech they've been scared to use for the past three years?",
      "score": 1,
      "created_utc": 1752093486.0,
      "replies": [
        {
          "id": "n2a3ouo",
          "author": "_RADIANTSUN_",
          "body": "All the big tech companies already have developed the shit they will release 10 years from now and dole out the advancements at a 1/year rate now while trying to keep up with the advancements behind the scenes.",
          "score": 0,
          "created_utc": 1752108301.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n28sllu",
      "author": "itsthreeamyo",
      "body": "My Z Fold 4 lasted two years and 2 two weeks from purchase date.  It started with the sim card not being detected when it was opened up.  Either a reboot of the phone or removing and re-seating the sim card after it was shut were the only two fixes I could find.  After two weeks of that the inside screen stopped turning on when opened up, but hey at least the sim card issue went away.  I sure loved the real estate and stylus usage but I won't be buying another anytime soon.",
      "score": 1,
      "created_utc": 1752093558.0,
      "replies": []
    },
    {
      "id": "n28v5sy",
      "author": "MyNameIsLucid",
      "body": "Samsung does not listen. Look at what Google did. They made a great outer screen that's the size of a regular smartphone. Samsung still isn't able to do this or refuses to make that change. Sure they made it a little bigger but not enough to really make a difference. I loved my Fold3 when I had it but damn Samsung do better",
      "score": 1,
      "created_utc": 1752094258.0,
      "replies": []
    },
    {
      "id": "n29btw7",
      "author": "Outrageous_Pin1638",
      "body": "It's a real shame about the under-display-camera being removed. I don't care about improved selfie quality, an uninterrupted screen makes much more of a positive impact for me. \n\n\nI was hoping they'd continue to improve under-display-camera tech and bring it to other phones eventually. ",
      "score": 1,
      "created_utc": 1752099089.0,
      "replies": []
    },
    {
      "id": "n2a3pkp",
      "author": "ilovepizza855",
      "body": "That’s expensive. Only idiotic samsung fanboys will buy it.",
      "score": 1,
      "created_utc": 1752108308.0,
      "replies": []
    },
    {
      "id": "n2ahalp",
      "author": "ant1992",
      "body": "I checked Best Buy out of curiosity for Z fold 7 and they’re giving 650 trade in for 14 pro max. With tax it’s 1482.49. It’s Honestly tempting. So if anyone is looking for a better trade in Best Buy might be the way to go",
      "score": 1,
      "created_utc": 1752113031.0,
      "replies": []
    },
    {
      "id": "n2alotz",
      "author": "djdante",
      "body": "Can I ask everyone - would you rather the phone be thin?  Or bigger battery, full ultra series camera array?\n\nI’m trying to work out why thinness had to be prioritised along with all the engineering hassle involved…",
      "score": 1,
      "created_utc": 1752114591.0,
      "replies": []
    },
    {
      "id": "n2anixi",
      "author": "mr_gooses_uncle",
      "body": "I'm definitely sticking with my 6. This seems super iterative.",
      "score": 1,
      "created_utc": 1752115254.0,
      "replies": []
    },
    {
      "id": "n2apxdg",
      "author": "Paul873873",
      "body": "And it still only has a 4400 mah battery. Its like they want their high end phone but don't want to back it up with anything more than \"oh look it folds!!!\" Yeah, we know. \n\nLike my biggest complaint about the fold 3 is the shitty battery life due to a processor that is powerhungry and heat inefficient. How will the snapdragon 8 elite hold up?",
      "score": 1,
      "created_utc": 1752116149.0,
      "replies": [
        {
          "id": "n2elgny",
          "author": "RandomSOA",
          "body": "This. How are more people not asking about heat management? My Fold 6 overheats really FAST outdoors. It's so bad. Love the phone, and I have already preordered the seven, but the overheating is almost a deal breaker for me.",
          "score": 1,
          "created_utc": 1752170524.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2bahnf",
      "author": "Technicated",
      "body": "This is really cool in concept, but in reality, I’d feel way more anxious that it’ll break and I’ll have to baby it way more than a normal phone. Add on the fact it costs £2000 and it’s a non-starter for me personally.",
      "score": 1,
      "created_utc": 1752124930.0,
      "replies": []
    },
    {
      "id": "n2c8h8c",
      "author": "therealsoggi",
      "body": "And the battery…",
      "score": 1,
      "created_utc": 1752143564.0,
      "replies": []
    },
    {
      "id": "n2eyipj",
      "author": "Rompe101",
      "body": "Max 16GB RAM for 2100 Euros?\nThats not enough for qwen3 30B A3B...",
      "score": 1,
      "created_utc": 1752174223.0,
      "replies": []
    },
    {
      "id": "n2idciy",
      "author": "___Snoobler___",
      "body": "Fold power user here. I did not ask for this nor do I want it. They massacred my boy. First they took my Note now they take the Fold. The pain. The emotional trauma. The horror.",
      "score": 1,
      "created_utc": 1752218733.0,
      "replies": []
    },
    {
      "id": "n2iv7x7",
      "author": "Oneditor",
      "body": "Um... we didn't ask for Samsung to rid the spen, udc, same old 4400 battery while rising the price for thinner, SLIGHTLY bigger screen than fold6",
      "score": 1,
      "created_utc": 1752228856.0,
      "replies": []
    },
    {
      "id": "n2nngio",
      "author": "doordingboner",
      "body": "This is the closes it's been to making me want one. But the outside screen is essentially an 1080p ultrawide, it's a no for me. I know the outside will get the most use day to day, unless I'm at home. I know I'll get down voted since everyone doesn't like to run the max resolutions on their phones, but I do.",
      "score": 1,
      "created_utc": 1752284432.0,
      "replies": []
    },
    {
      "id": "n2rn7mh",
      "author": "thodgson",
      "body": "Tariffs in the US don't help",
      "score": 1,
      "created_utc": 1752344498.0,
      "replies": []
    },
    {
      "id": "n2x4vop",
      "author": "i__hate__stairs",
      "body": "I wish the Surface Duo had caught on.",
      "score": 1,
      "created_utc": 1752423646.0,
      "replies": []
    },
    {
      "id": "n4c1n4m",
      "author": "hit_ahir_1317",
      "body": "Flip 7’s cover screen is the real star this year. It’s finally big enough and smart enough to handle daily tasks.",
      "score": 1,
      "created_utc": 1753102979.0,
      "replies": []
    },
    {
      "id": "n4xsawh",
      "author": "hit_ahir_1317",
      "body": "Samsung managed to make it thinner and more durable without holding back on specs. That’s impressive.",
      "score": 1,
      "created_utc": 1753378717.0,
      "replies": []
    },
    {
      "id": "n50e0h2",
      "author": "hit_ahir_1317",
      "body": "Samsung managed to make it thinner and more durable without holding back on specs. That’s impressive.",
      "score": 1,
      "created_utc": 1753407467.0,
      "replies": []
    },
    {
      "id": "n26klgm",
      "author": "Tribolonutus",
      "body": "You want cool tech, don’t cry it’s expensive…",
      "score": -3,
      "created_utc": 1752071591.0,
      "replies": [
        {
          "id": "n2gjtb2",
          "author": "corecenite",
          "body": "there's plenty of cool tech out there that isn't expensive, like the flipper zero",
          "score": 1,
          "created_utc": 1752191656.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n28pwuk",
      "author": "Enderkr",
      "body": "\"..and I love that, for the 20 people who use Dex.\"\n\nGoddamn girl lmao.\n\nOn a serious note, I may or may not be alone here but I just do not see the need or desire for a folding phone. What are you guys DOING on your phones that requires that much screen space and you don't get by turning a regular phone landscape? I just don't understand, and I'm certainly not paying two thousand dollars for the feature. The Z Flip 7 is only moderately better, and I've never held one of these but they just don't seem convenient to flip open and the phone itself isn't cool enough to justify the fold line IMO. I do like the idea of a smaller device that fits better in my pocket and lets me do quick actions without having to unfold the whole thing, but....eh. Modern day flip phones just make me miss actual oldschool flips.",
      "score": 1,
      "created_utc": 1752092823.0,
      "replies": [
        {
          "id": "n2arotn",
          "author": "Paul873873",
          "body": "Eyesight. That simple, eyesight. Some of us cant see things as good as you can. Having a phone that can be opened up into a tabled, or a tablet that can be folded and put in your pocket is pretty nice. Just the other day I had a youtube video on the top half amd a discord stream on the bottom half, and both were still bigger than my old phone landscape",
          "score": 3,
          "created_utc": 1752116834.0,
          "replies": [
            {
              "id": "n2as0t8",
              "author": "Enderkr",
              "body": "I guess I hadn't thought about that. Though I'm 43, my vision ain't that good anymore either lmao. But I guess I haven't hit the point where I need the bigger text and/or screen yet, so maybe when I do I'll understand more.",
              "score": 1,
              "created_utc": 1752116966.0,
              "replies": [
                {
                  "id": "n2dvgqo",
                  "author": "Paul873873",
                  "body": "I feel like there's a convergence point between the ideal screen distance, tolerance for head movement, screen size, and item size. Like I find that my desktop monitor (either 23 inch or 27 inch, cant remember) is the perfect size. I can lean in to get a closer view, and the object i am looking at will still have a decent size to it, but leaning back just a little fits most of the monitor in my limited (~45⁰) peripheral vision, with minimal detail but I can see the whole picture. \n\nThe folds fit a similar point for a phone, I just wish they would make them worth their price tag",
                  "score": 2,
                  "created_utc": 1752163380.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n2avz8k",
          "author": "Alternative_Party277",
          "body": "Detailed medicine flashcards. Any kind of science, really, especially things that contain math-y stuff or biochemical pathways or even simple organic chemistry. I've also done quick maintenance coding on mine. I've graded papers. Watched science lectures. That type of stuff. Also, driving and using maps is really nice and comfy.",
          "score": 1,
          "created_utc": 1752118559.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n291blp",
      "author": "Thelibra86",
      "body": "Correction ** Samsung keeps making the foldables we haven't been asking for.\n\nWe keep ASKING for the S-Pen integration, aka the built-in pen slot like the Galaxy Note/S Ultra has. We are tired of buying cases for an external slot to hold the pen separately. Then, the \"sold separately\" pens are too large for writing, anyways...",
      "score": 1,
      "created_utc": 1752095963.0,
      "replies": [
        {
          "id": "n2c2shm",
          "author": "Mmm_bloodfarts",
          "body": "Exactly, we've been asking for intergration and at least for the s-pen to work on both screens, now we have neither",
          "score": 1,
          "created_utc": 1752140549.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n26mza4",
      "author": "bottomofleith",
      "body": "Glad I didn't bother waiting for the Flip 7 if I'm honest.",
      "score": 1,
      "created_utc": 1752072272.0,
      "replies": []
    },
    {
      "id": "n26yes1",
      "author": "Solaranvr",
      "body": "I hate that I was [right about the price](https://www.reddit.com/r/Android/s/UB3SrLtoal)",
      "score": 1,
      "created_utc": 1752075436.0,
      "replies": [
        {
          "id": "n26zvpl",
          "author": "jerryeight",
          "body": "Just had to give the jezebels ideas. /jk",
          "score": 0,
          "created_utc": 1752075837.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n27zyzk",
      "author": "MVPizzle_Redux",
      "body": "2,000 lmfao what the fuck",
      "score": 1,
      "created_utc": 1752085644.0,
      "replies": [
        {
          "id": "n28c8wt",
          "author": "kevin7254",
          "body": "2600 USD in Sweden lol. Not joking.",
          "score": 1,
          "created_utc": 1752089049.0,
          "replies": [
            {
              "id": "n2ak3gm",
              "author": "MVPizzle_Redux",
              "body": "Lmao I’m tapped out on this shit dude , something’s got to give soon",
              "score": 1,
              "created_utc": 1752114020.0,
              "replies": [
                {
                  "id": "n2antvn",
                  "author": "mr_gooses_uncle",
                  "body": "I'm hoping to keep my 6 in good shape by the time the 9 comes out to trade in.",
                  "score": 1,
                  "created_utc": 1752115365.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n292bmy",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1752096250.0,
      "replies": [
        {
          "id": "n2b15ke",
          "author": "Justin__D",
          "body": "I got a Pixel 9 Pro Fold about a month ago after listening to my brother hype up his Honor foldable, with both of us also having had experience with the Razr.\n\nFlip phones like the Razr are nice for the nostalgia value, but aside from that, don't offer anything uniquely useful. A full-sized foldable? It basically addresses my main complaint about tablets - they can't fit in your pocket, so they're no more portable than a laptop and therefore are inferior to laptops in every way.",
          "score": 2,
          "created_utc": 1752120689.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2gtvo1",
      "author": "Moses015",
      "body": "Jesus. $2000 USD for a frickin phone. Noooooope",
      "score": 1,
      "created_utc": 1752195186.0,
      "replies": []
    },
    {
      "id": "n27engq",
      "author": "AvoidingIowa",
      "body": "I had a foldable for 3 days before I returned it. They’re just too fragile for me to carry around every single day with confidence. No way I’m going to pay $2000 to be afraid to use a device.",
      "score": 0,
      "created_utc": 1752079880.0,
      "replies": []
    },
    {
      "id": "n26uik6",
      "author": "Nail_Biterr",
      "body": "wait 3 months, and the phone companies will be giving 'a fold 7 on us' deal",
      "score": 0,
      "created_utc": 1752074364.0,
      "replies": []
    },
    {
      "id": "n26y2uf",
      "author": "Burnout4mergiftedkid",
      "body": "As my dad used to say, “It takes money to drink liquor and ride the train.”",
      "score": 0,
      "created_utc": 1752075344.0,
      "replies": []
    },
    {
      "id": "n279tyq",
      "author": "user_279-2",
      "body": "To bad samsung is trash. Maybe they should fix the fucked up update that ruined the functionality of all their phones.",
      "score": -3,
      "created_utc": 1752078566.0,
      "replies": []
    },
    {
      "id": "n28q8rw",
      "author": "toshgiles",
      "body": "Who is asking for foldable phones?",
      "score": 0,
      "created_utc": 1752092913.0,
      "replies": [
        {
          "id": "n2aryci",
          "author": "Paul873873",
          "body": "Oh how lucky you can see on those tiny ass phone screens of yours. Must be nice",
          "score": 0,
          "created_utc": 1752116939.0,
          "replies": [
            {
              "id": "n2tm06q",
              "author": "corecenite",
              "body": "at least the screen isn't vulnerable to creases with over time usage.",
              "score": 1,
              "created_utc": 1752368484.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n281k2a",
      "author": "garry4321",
      "body": "Sorry, but I don’t remember anyone asking for a foldable.",
      "score": -3,
      "created_utc": 1752086086.0,
      "replies": []
    },
    {
      "id": "n2739ql",
      "author": "fohdoubleg",
      "body": "Gonna say I am so excited for this",
      "score": -1,
      "created_utc": 1752076757.0,
      "replies": [
        {
          "id": "n2gjw0g",
          "author": "corecenite",
          "body": "i hope you realize that it's all just a gimmick, right?",
          "score": 1,
          "created_utc": 1752191682.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2844j7",
      "author": "Kurigohan-Kamehameha",
      "body": "I’ll never understand why they bother putting pixels around the cameras",
      "score": 0,
      "created_utc": 1752086798.0,
      "replies": []
    },
    {
      "id": "n2fiaaf",
      "author": "powerofviva",
      "body": "No spen, no Z fold anymore!!!!\nYou stupid SAMSUNG!!!!",
      "score": 0,
      "created_utc": 1752179924.0,
      "replies": []
    },
    {
      "id": "n2fib38",
      "author": "powerofviva",
      "body": "No spen, no Z fold anymore!!!!\nYou stupid SAMSUNG!!!!",
      "score": 0,
      "created_utc": 1752179929.0,
      "replies": []
    },
    {
      "id": "n275mcl",
      "author": "scotishstriker",
      "body": "They have released that many foldable phones!\nThat's alot of E-waste.",
      "score": -5,
      "created_utc": 1752077406.0,
      "replies": []
    }
  ]
}