{
  "post": {
    "title": "Nothing’s ‘first true flagship’ phone plays it a little safe | ﻿The Phone 3 is coming to the US this month without the company’s trademark light show.",
    "author": "chrisdh79",
    "id": "1lpu4e0",
    "score": 1392,
    "created_utc": 1751458015.0,
    "selftext": "",
    "num_comments": 159,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lpu4e0/nothings_first_true_flagship_phone_plays_it_a/"
  },
  "comments": [
    {
      "id": "n0xizl0",
      "author": "itastesok",
      "body": "The lightshow is the only thing that made this interesting for me.\n\nThe headphones look pretty cool though.",
      "score": 477,
      "created_utc": 1751459060.0,
      "replies": [
        {
          "id": "n0xogqa",
          "author": "cyclinator",
          "body": "Nothing OS is pretty good looking piece of software. But I don´t think I´ll ever buy it. \n\nLet´s see how they mess up it in Nothing OS 4.0",
          "score": 141,
          "created_utc": 1751461038.0,
          "replies": [
            {
              "id": "n0yfz4d",
              "author": "Trisa133",
              "body": "Their OS is just vanilla Android with a simpler aesthetic and no bloatware. Other brands like Samsung makes it bloated just to add features that are mostly useless and significantly slow down the OS. Oh yeah, and they add apps and bloatware from third parties to make extra money.",
              "score": 169,
              "created_utc": 1751469439.0,
              "replies": [
                {
                  "id": "n0yiajf",
                  "author": "MetriccStarDestroyer",
                  "body": "Not to mention the battery drain.\n\nI love when my App Activity is needlessly logged",
                  "score": 67,
                  "created_utc": 1751470089.0,
                  "replies": []
                },
                {
                  "id": "n105mz4",
                  "author": "technobrendo",
                  "body": "Samsung is much better than they used to be and OneUI is considered one of the better \"non-stock\" android releases.\n\nI do wish you could easily remove more components but compared to touchwiz I'll take what I can get",
                  "score": 40,
                  "created_utc": 1751487228.0,
                  "replies": [
                    {
                      "id": "n10h0um",
                      "author": "ctzu",
                      "body": "Remember the time when Samsung users always boasted how much customization options they had compared to \"those stupid apple nerds\"?",
                      "score": 11,
                      "created_utc": 1751490508.0,
                      "replies": [
                        {
                          "id": "n10qhu2",
                          "author": "meatly",
                          "body": "You still have them, but it's modular now with goodlock. I personally don't like Samsung's software but they do give lots of features",
                          "score": 18,
                          "created_utc": 1751493379.0,
                          "replies": []
                        },
                        {
                          "id": "n113e94",
                          "author": "wazzuper1",
                          "body": "Remember when Android users boasted how much you could customize your phone and mocked Apple users, only to in the end, parrot how great vanilla Google is with less customization?",
                          "score": 1,
                          "created_utc": 1751497597.0,
                          "replies": [
                            {
                              "id": "n11thrl",
                              "author": "i_lack_imagination",
                              "body": "You realize the point of being able to customize is to make it fit what you want. Valuing stock features with less bloat makes sense because you only add the customizations you want, not the ones someone else decided you have to have.\n\nThese few comments that take swipes at people using Android while comparing it to iPhones are just weird. Maybe I should throw in a random insult just to balance it out. Guess that is what happens to ad infested brains using iPhones since they can't install anything on their phones to block ads.",
                              "score": 24,
                              "created_utc": 1751506105.0,
                              "replies": [
                                {
                                  "id": "n14j7jw",
                                  "author": "wazzuper1",
                                  "body": "The thing about Samsung (which was mocked), is that at \"stock\", it can be modified. Much *more* so than Google. Guess what, you can still have the stock look of pure Google. Just throw on another launcher like Nova as I do. And for everything else, like the themes, the keyboard, AOD, the clock/time, the gestures, etc. Goodlock is there for you. You can design it exactly like you want to.\n\nIt's always funny to see the improvements that other OEMs have made are always introduced to Google much, *much* later and sometimes in a worse implementation or with more limitations. One UI has come a long way since TouchWiz. People need to give these phones a try for at least one week before talking dirt.",
                                  "score": 2,
                                  "created_utc": 1751550193.0,
                                  "replies": []
                                },
                                {
                                  "id": "n12mrvo",
                                  "author": "Big-Rough-3636",
                                  "body": "… huh? \n\nAt least be accurate in your incendiary comments, iPhones have had ad blockers for at least the last 4-5 years I’ve been on them.",
                                  "score": -5,
                                  "created_utc": 1751517321.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "n181aoi",
                              "author": "zzazzzz",
                              "body": "what? stock android is the version that allows for the most costumisation and on top of that the pixels are completely open and you can straight up install a different android rom if you want to.",
                              "score": 2,
                              "created_utc": 1751588282.0,
                              "replies": [
                                {
                                  "id": "n1jfolh",
                                  "author": "wazzuper1",
                                  "body": "It's been less and less, burying settings further and further away until you have no choice to change things at all. If you were around for the days of Kitkat, which was IMO the best, you had a *ton* of customization available. Pixels allow you to unlock your bootloader sure, but besides that and the camera (all in the software processing), it doesn't offer more built-in than others. It's less. I used to unlock the bootloader and root and switch up roms all the time. Now I don't need to flash roms anymore since the phone already has the capabilities and customization that I want it to have.",
                                  "score": 0,
                                  "created_utc": 1751752929.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "n11u76h",
                              "author": "Deftlet",
                              "body": "You're confusing the user's customization with the manufacturer's customization. I don't always care for the tweaks the manufacturer makes to the phone, but I certainly do care for the ones I make myself. The possibilities are endless.\n\n/r/androidthemes  \n(Disclaimer: lots of the submissions have poor taste, but they show the kind of things you can do)",
                              "score": 2,
                              "created_utc": 1751506337.0,
                              "replies": [
                                {
                                  "id": "n14k1k8",
                                  "author": "wazzuper1",
                                  "body": "I wholeheartedly agree. Goodlock takes customization to as far as you can dream.\n\nThe other person made an assumption that I was an iPhone user. While I do have a business phone, that is not my primary driver. I also have phones from Samsung (primary), OnePlus, and still miss my Moto X being the best phone.\n\nThanks for the subreddit for inspiration!",
                                  "score": 1,
                                  "created_utc": 1751550460.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0yr40p",
          "author": "Resoca",
          "body": "The poor microphone quality and non-removal ear pads kill it for me tbh.",
          "score": 14,
          "created_utc": 1751472536.0,
          "replies": []
        },
        {
          "id": "n0ze0id",
          "author": "auroriasolaris",
          "body": "So they removed only thing that made those phones unique and now they will just blend into endless boring android environment and be forgotten or super obscure... What a shame.",
          "score": 0,
          "created_utc": 1751478993.0,
          "replies": [
            {
              "id": "n1pambg",
              "author": "joe_bibidi",
              "body": "I mean... They didn't completely remove lights on the back of the phone, click the damn link and look at the phone. The thing that they did was that the replaced the \"glyph\" lights with a tiny pixelated screen that's capable of having much more specific and legible information. [See the top right of this image](https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/nothing-phone-3-12.jpg?quality=90&strip=all&crop=0,0,100,100).",
              "score": 1,
              "created_utc": 1751837090.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0xupg3",
      "author": "LetsTwistAga1n",
      "body": "I was about to post a comment about this looking like a Teenage Engineering phone and decided to check when the OP-1 was released (2011), but here's what I found:\n\n>On 25 February 2021, Teenage Engineering announced that it will partner with the British electronics company, Nothing, to produce the design aesthetic of the brand and their products.\n\nLol, it shows. TIL.",
      "score": 332,
      "created_utc": 1751463132.0,
      "replies": [
        {
          "id": "n0yjojg",
          "author": "CRASHING_DRIFTS",
          "body": "Teenage Engineering makes really really cool looking stuff.",
          "score": 96,
          "created_utc": 1751470475.0,
          "replies": [
            {
              "id": "n0ylvx7",
              "author": "MonkeySafari79",
              "body": "really really overpriced stuff.",
              "score": 95,
              "created_utc": 1751471080.0,
              "replies": [
                {
                  "id": "n0yp88k",
                  "author": "NoSignalOff",
                  "body": "I don't think they have production numbers to make it cheaper, but they're \"boutique\" so aren't really about numbers. It feels like some of their stuff is just a lark.",
                  "score": 60,
                  "created_utc": 1751471999.0,
                  "replies": [
                    {
                      "id": "n0z26z2",
                      "author": "Bob_The_Bandit",
                      "body": "Artificially keeping production low and retraining that boutique label is an excuse to keep prices high. If they produced 10 times and sold at half the price they’d sell all of them and still make money. Stuff like the OP-1 being 2000€ is part of their marketing too, since every reviewer will put some clickbait title and thumbnail about the price. “YOU WONT BELIEVE HOW MUCH THIS COST” type shit.",
                      "score": 1,
                      "created_utc": 1751475692.0,
                      "replies": [
                        {
                          "id": "n0zmapp",
                          "author": "parisidiot",
                          "body": "> Artificially keeping production low and retraining that boutique label is an excuse to keep prices high.\n\nthere isn't a market large enough for what they make for this to make sense, sorry. it's not keeping production artificially low. it is keeping production in pace with demand for their sort of thing, which is low.\n\nlike, it is very common for businesses to make high margin, low volume products? like, what?",
                          "score": 37,
                          "created_utc": 1751481436.0,
                          "replies": [
                            {
                              "id": "n0zyljo",
                              "author": "nquesada92",
                              "body": "There’s plenty of broke musicians that would buy it at lower price point",
                              "score": -8,
                              "created_utc": 1751485136.0,
                              "replies": [
                                {
                                  "id": "n10zh1t",
                                  "author": "rudimentary-north",
                                  "body": "They’re a design firm, not a gear company. They don’t seem to have much interest in working at the manufacturing scale that their competitors do.",
                                  "score": 12,
                                  "created_utc": 1751496308.0,
                                  "replies": []
                                },
                                {
                                  "id": "n12b9cd",
                                  "author": "alidan",
                                  "body": "I would buy an op-1 at 200-300$ just to dick around with.",
                                  "score": 2,
                                  "created_utc": 1751512480.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n0z426q",
                          "author": "theWyzzerd",
                          "body": "While I agree, good luck convincing the TE cult.  \"Don't you think if they could sell more, they would?\" and \"Then why is there no shortage of their products?\" are common rebuttals. \n\nFWIW I do appreciate TE products but the KO II is about my price limit for their gear. And man is it flimsy for a $300 sampler.",
                          "score": -3,
                          "created_utc": 1751476211.0,
                          "replies": [
                            {
                              "id": "n0z84m0",
                              "author": "FormalOperational",
                              "body": "They are currently running \"a delicate experiment \\[...\\] to understand the market\" through the end of the month, where you can pick the price you pay for the OP-1 Field: $1399 to $9999.",
                              "score": 11,
                              "created_utc": 1751477340.0,
                              "replies": [
                                {
                                  "id": "n0zovym",
                                  "author": "Bob_The_Bandit",
                                  "body": "What idiot would pay a cent over $1399 if given this option?",
                                  "score": 3,
                                  "created_utc": 1751482205.0,
                                  "replies": [
                                    {
                                      "id": "n0zuagq",
                                      "author": "JeffCache",
                                      "body": "Because it creates more engagement to offer the choice and create a headline and buzz. A “pick your price!” is sexier than a “Sale!”\n\nThey know people will choose the lowest price, that’s not the point or reason though.",
                                      "score": 4,
                                      "created_utc": 1751483823.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "n0z8i35",
                                  "author": "theWyzzerd",
                                  "body": "Oh, I'm well aware.  😂",
                                  "score": 2,
                                  "created_utc": 1751477447.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0yxja1",
                  "author": "Imaginary-Worker4407",
                  "body": "Is it really overpriced?\n\n\nYou are paying for the design",
                  "score": 8,
                  "created_utc": 1751474380.0,
                  "replies": [
                    {
                      "id": "n178ojc",
                      "author": "imaverysexybaby",
                      "body": "You’ve seen the desk right? Their stuff is overpriced.",
                      "score": 1,
                      "created_utc": 1751578560.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n0yncuc",
                  "author": "jondice",
                  "body": "That generally works great btw.",
                  "score": 5,
                  "created_utc": 1751471483.0,
                  "replies": []
                },
                {
                  "id": "n0z8m8c",
                  "author": "crasscrackbandit",
                  "body": "Really really really unnecessary stuff.",
                  "score": 1,
                  "created_utc": 1751477480.0,
                  "replies": []
                },
                {
                  "id": "n0z3c4d",
                  "author": "Awkward_Sorbet_2400",
                  "body": "Downvoting you. The ep-133 and their smaller gadgets are cheap and fun. They do have flagship items like the OP-1 but those are niche and boutique. Worth the price.",
                  "score": -9,
                  "created_utc": 1751476010.0,
                  "replies": [
                    {
                      "id": "n0zax8w",
                      "author": "MonkeySafari79",
                      "body": "Maybe fun to look at, but like the EP 133 unnecessarily complicated.",
                      "score": 2,
                      "created_utc": 1751478126.0,
                      "replies": []
                    },
                    {
                      "id": "n10v7nr",
                      "author": "024_naMsdrawkcaBehT",
                      "body": "The people downvoting you don’t know what they are talking about. The pocket operators and KOII are unbeatable for the price and while they have their limitations are powerful instruments and more importantly fun to play. If they weren’t they wouldn’t have sold so well.",
                      "score": 0,
                      "created_utc": 1751494907.0,
                      "replies": [
                        {
                          "id": "n1120mw",
                          "author": "Awkward_Sorbet_2400",
                          "body": "None of them make music lol",
                          "score": -2,
                          "created_utc": 1751497143.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0yy5f7",
              "author": "mrheosuper",
              "body": "If you like their design, check out Braun. I believe TE is inspired from them.",
              "score": 6,
              "created_utc": 1751474556.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0zktzp",
          "author": "nagi603",
          "body": "It looks like a panda.",
          "score": 2,
          "created_utc": 1751480998.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0xwtop",
      "author": "xanas263",
      "body": "The only flagship thing about this phone is its price point. If you want to call yourself a flagship you need the specs to back you up.",
      "score": 172,
      "created_utc": 1751463817.0,
      "replies": [
        {
          "id": "n0y3l90",
          "author": "gorcorps",
          "body": "The battery is pretty unique.  All the other typical flagship phones in the US are still using lithium batteries, so this is ahead of the game there at least",
          "score": 57,
          "created_utc": 1751465882.0,
          "replies": [
            {
              "id": "n0y5jdr",
              "author": "xanas263",
              "body": "Both the OnePlus 13 and 13R are using silicone carbon batteries as well and theirs are 6000mAh with 120 and 80 watt fast charging respectively. Nothing is only 5150mAh (5500 in India) with 65W charging. \n\nThe Nothing 3 is the same price as the Oneplus 13 with substantially worse specs all around and $200 more expensive than the 13R which it also can't match in every spec category.",
              "score": 79,
              "created_utc": 1751466453.0,
              "replies": [
                {
                  "id": "n0zuo83",
                  "author": "sabre4570",
                  "body": "Bruh. I owned a OnePlus 1 in college, how tf are they up to 13",
                  "score": 36,
                  "created_utc": 1751483939.0,
                  "replies": [
                    {
                      "id": "n0zz8jv",
                      "author": "Rabo_McDongleberry",
                      "body": "Losing track of time is a sign of getting old homie. Lol",
                      "score": 38,
                      "created_utc": 1751485330.0,
                      "replies": [
                        {
                          "id": "n1008yo",
                          "author": "Macho_Chad",
                          "body": "First, I got angry. Then, I remembered my Ovaltine is ready. 👴",
                          "score": 16,
                          "created_utc": 1751485637.0,
                          "replies": []
                        },
                        {
                          "id": "n12ch8x",
                          "author": "alidan",
                          "body": "one plus came out 11 years ago, did they skip numbers or just put out 2 phones a year twice.",
                          "score": 2,
                          "created_utc": 1751512964.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n10m2v4",
                      "author": "One_Doubt_75",
                      "body": "They skipped a couple here and there",
                      "score": 4,
                      "created_utc": 1751492034.0,
                      "replies": []
                    },
                    {
                      "id": "n1033ua",
                      "author": "xanas263",
                      "body": "I hate to break this to you, but its been 13 years since you were in college...",
                      "score": 2,
                      "created_utc": 1751486481.0,
                      "replies": [
                        {
                          "id": "n104sfi",
                          "author": "sabre4570",
                          "body": "I got the one after the two released and they skipped a number at one point so not quite, but we're getting dangerously close lmao",
                          "score": 3,
                          "created_utc": 1751486978.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n11gu6m",
                      "author": "Fedoraus",
                      "body": "it's been like 12 years, also they've released way more than 13 phones, that's just the flagship line",
                      "score": 1,
                      "created_utc": 1751501967.0,
                      "replies": []
                    },
                    {
                      "id": "n127gj9",
                      "author": "xXxXkamuiXxXx",
                      "body": "I got 9 pro and absolutely not a single regret.",
                      "score": 1,
                      "created_utc": 1751510987.0,
                      "replies": []
                    },
                    {
                      "id": "n1fntip",
                      "author": "Kenja_Time",
                      "body": "Same here. And it was ~$250 🥲",
                      "score": 1,
                      "created_utc": 1751699531.0,
                      "replies": []
                    },
                    {
                      "id": "n104z1c",
                      "author": "raydialseeker",
                      "body": "Samsungs at 25 and I had the s2",
                      "score": 0,
                      "created_utc": 1751487032.0,
                      "replies": [
                        {
                          "id": "n10a538",
                          "author": "gorcorps",
                          "body": "With them they jumped from s10 in 2019 to s20 in 2020 to start matching the year it was released.",
                          "score": 6,
                          "created_utc": 1751488528.0,
                          "replies": [
                            {
                              "id": "n10hf27",
                              "author": "raydialseeker",
                              "body": "Yes I know. Still feel old af tho",
                              "score": 0,
                              "created_utc": 1751490624.0,
                              "replies": [
                                {
                                  "id": "n10lbmy",
                                  "author": "gorcorps",
                                  "body": "Yeah... My first phone didn't even have a color screen so I feel that",
                                  "score": 1,
                                  "created_utc": 1751491801.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n10gbic",
                  "author": "technobrendo",
                  "body": "How does India have a larger capacity battery?",
                  "score": 1,
                  "created_utc": 1751490299.0,
                  "replies": [
                    {
                      "id": "n10hwmm",
                      "author": "xanas263",
                      "body": "Certain manufacturers make India specific editions of their phones due to the competition in the market there. Nothing tends to bump up battery life for example in their phones sold in India.",
                      "score": 3,
                      "created_utc": 1751490770.0,
                      "replies": [
                        {
                          "id": "n15lpu7",
                          "author": "ryzenguy111",
                          "body": "MrWhoseTheBoss explained its not a difference in the hardware, the Euro and US models are limited to 5150 due to shipping restrictions on batteries that India doesn’t have",
                          "score": 1,
                          "created_utc": 1751561327.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0zx4s1",
              "author": "cman674",
              "body": "Silicon-carbon batteries are still lithium batteries, they just swap out the anode for a silicon one. It allows for higher capacity but there's also a greater risk for degradation because the Si-C anode expands more during use. So maybe neat but I'd wait to see if they hold up as well as the current generation of batteries.",
              "score": 9,
              "created_utc": 1751484686.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0xgepi",
      "author": "chrisdh79",
      "body": "From the article: At $799, the Phone 3 is priced to match the iPhone 16, Galaxy S25, and Pixel 9, particularly as Nothing positions itself firmly outside its midrange origins. Pei says the company feels ready “to compete with products in that price level.” Preorders open on July 4th, with general sale starting on July 15th on Nothing’s online store and Amazon in the US. Nothing says the phone is fully compatible with T-Mobile and AT&T, with “more limited 5G support” on Verizon.\n\nThis is Nothing’s most expensive phone yet, but the specs should keep pace with the price on paper. The Snapdragon 8S Gen 4 chip isn’t the most powerful one out right now, but its performance should handle all but the most demanding mobile games, especially paired with up to 16GB of RAM. Storage starts at 256GB, and you can get 512GB for an additional $100.\n\nThe Phone 3 uses a silicon-carbon battery, which is a relatively new technology that makes it easier to fit big batteries into small phones. Here, that means a generous 5,150mAh capacity, combined with a 65W wired charging speed and 15W wireless charging speed. The 6.67-inch OLED screen is more than twice as bright as the Phone 2’s, and the IP68 water- and dust-resistance rating is a first for Nothing, too. All four of the cameras — three on the back, one on the front — are 50 megapixels, though it’s impossible to say whether they’re any good until The Verge gets to test the phone out properly. Nothing’s camera processing has previously lagged a little behind the competition, so this’ll be an area to watch.\n\nAll that is in line with other flagship phones, so what makes the Phone 3 feel like Nothing? That’s where that new, gimmick-free Glyph design comes in. While previous Nothing phones have featured an array of light strips that can glow and flash in custom patterns for notifications and ringtones, those have now been swapped out for a small dot-matrix LED display in one corner on the back of the phone.\n\nThe Glyph Matrix is immediately less striking than older phones’ designs and less unique, too — Asus has included dot-matrix displays on the back of its ROG gaming phones for years. Pei says that the advantage is that custom notifications can be “much more immediate,” with easily recognizable images or emoji tied to specific apps and contacts, rather than abstract animations that might be hard to grok at a glance.",
      "score": 41,
      "created_utc": 1751458070.0,
      "replies": [
        {
          "id": "n12p2i9",
          "author": "clintbartnn",
          "body": "so they basically made it look like every other phone for flagship money? the whole point was those crazy lights and now it's just a tiny dot display that asus already did years ago. feels like they're losing what made them different",
          "score": 7,
          "created_utc": 1751518370.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0yr94w",
      "author": "Spara-Extreme",
      "body": "Can someone explain to me why this is all over my feeds? Is it a good phone or w/e?",
      "score": 21,
      "created_utc": 1751472577.0,
      "replies": [
        {
          "id": "n10errh",
          "author": "Loeffellux",
          "body": "Nothing has made quite the impact due to the fact that they are a design-first tech company that usually still delivers a decent value at its price point.\n\nThey aren't the best in class in any given category except maybe design (which is subjective, of course) but I guess people are more used to brands like this being less than the sum of their parts so when their products deliver what they promise they end up \"surprisingly decent\".\n\nI say all that as someone who's never actually bought a nothing product so this is just my perception of how they are currently regarded by the tech community. Their CEO is also social media-savvy so you end up seeing their stuff a lot (I guess this could've answered your question lol)\n\nthe phone (3) might be the first time where their formula doesn't quite add up with an experience that is underwhelming for its price point.",
          "score": 16,
          "created_utc": 1751489853.0,
          "replies": [
            {
              "id": "n11szza",
              "author": "paaaaatrick",
              "body": "It's not really decent value at it's price point. It feels like they are trying to be like apple if apple made midrange stuff, where it's overpriced but you are buying for the design, aesthetic and brand",
              "score": 3,
              "created_utc": 1751505945.0,
              "replies": []
            },
            {
              "id": "n12e6fe",
              "author": "flufflebuffle",
              "body": "I have the nothing buds, and they are pretty fantastic all around for the price",
              "score": 2,
              "created_utc": 1751513652.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0zpwbe",
          "author": "ZDTreefur",
          "body": "Or w/e, yeah.",
          "score": 3,
          "created_utc": 1751482503.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0yk4fp",
      "author": "ShakyMango",
      "body": "Removes unique features, prices High , lower specs than comparable phones. Its not going to sell well",
      "score": 23,
      "created_utc": 1751470595.0,
      "replies": []
    },
    {
      "id": "n0zn6ct",
      "author": "dapperdanmen",
      "body": "Nothing 2 pricepoint was right. Miss the wireless charging and eSIM support though. Would have been all over this for $600 though.",
      "score": 6,
      "created_utc": 1751481696.0,
      "replies": [
        {
          "id": "n13iwy4",
          "author": "Mythun4523",
          "body": "This has wireless charging.",
          "score": 1,
          "created_utc": 1751534748.0,
          "replies": [
            {
              "id": "n13k260",
              "author": "dapperdanmen",
              "body": "I know, I was talking about the Nothing 2",
              "score": 1,
              "created_utc": 1751535418.0,
              "replies": [
                {
                  "id": "n13k76r",
                  "author": "Mythun4523",
                  "body": "That also has wireless charging. But no Esim",
                  "score": 2,
                  "created_utc": 1751535499.0,
                  "replies": [
                    {
                      "id": "n193cv7",
                      "author": "dapperdanmen",
                      "body": "Only the Pro version has wireless charging, not the Nothing 2. I know because I have the phone.",
                      "score": 1,
                      "created_utc": 1751603178.0,
                      "replies": [
                        {
                          "id": "n193i35",
                          "author": "Mythun4523",
                          "body": "I also have the phone. It has wireless charging.",
                          "score": 1,
                          "created_utc": 1751603244.0,
                          "replies": [
                            {
                              "id": "n1996jh",
                              "author": "dapperdanmen",
                              "body": "Oh my bad - I have the 3(a). Doesn't have wireless charging or eSIM support.",
                              "score": 1,
                              "created_utc": 1751605866.0,
                              "replies": [
                                {
                                  "id": "n19ogvl",
                                  "author": "Mythun4523",
                                  "body": "3A pro doesn't have wireless but does have Esim. I think 3a had esim for JP only.",
                                  "score": 1,
                                  "created_utc": 1751613755.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n0zxjb6",
      "author": "LeNoName87",
      "body": "Plays it a little safe is an understatement, they make the aesthetics look all insane but then you look at the finer details. They could've added a headphone jack and MicroSD Card slot to really make it stand out from the competition, if they really wanted to flex on most other brands, add a removable battery 2 years before the deadline to show how ahead of the curb they really are.",
      "score": 5,
      "created_utc": 1751484809.0,
      "replies": [
        {
          "id": "n2cc1n1",
          "author": "Lunrmoor",
          "body": "Would have been my dream phone",
          "score": 2,
          "created_utc": 1752145271.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n141hay",
      "author": "IT_techsupport",
      "body": "OnePLus part 2, they made their brand name known , its time to jack up the prices , lose vision , become corporate with minimal improvements and premium prices.",
      "score": 4,
      "created_utc": 1751543878.0,
      "replies": [
        {
          "id": "n1467ol",
          "author": "thewrulph",
          "body": "Exactly! And that's also why I never bought another OnePlus phone haha. Guess 1 is the max when it comes to Carl.",
          "score": 1,
          "created_utc": 1751545721.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0zpyu0",
      "author": "FlyingBishop",
      "body": "What is Nothing? I literally have never heard of this and I was reading the article expecting them to explain but they just kept talking as if I could reasonably have been expected to have any context to understand.",
      "score": 5,
      "created_utc": 1751482523.0,
      "replies": [
        {
          "id": "n12dbyq",
          "author": "justanotherkerbal",
          "body": "Nothing is a British consumer tech company founded by one of the co-founders of OnePlus (another phone company). Nothing makes phones, TWS earphones, and now headphones I guess. What sets Nothing apart from their competitors is their bold (read: devisive) aesthetic design choices, and their willingness to be different. \n\nBut honestly, even as a Nothing phone user, the line between innovation and gimmick is an extremely thin one, and it's a bit disappointing to see that they're backpedaling on cool features like the glyph interface (which uses flashing lights as a notification system).",
          "score": 3,
          "created_utc": 1751513304.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n12ieup",
      "author": "Giodude12",
      "body": "I want to root for nothing but genuinely what does that screen accomplish.",
      "score": 2,
      "created_utc": 1751515399.0,
      "replies": []
    },
    {
      "id": "n0z1iyb",
      "author": "PhaseExtra1132",
      "body": "Sadly they made the flagship the only ugly one in their category :/",
      "score": 5,
      "created_utc": 1751475507.0,
      "replies": []
    },
    {
      "id": "n0xy7pc",
      "author": "HRudy94",
      "body": "No jack no buy.\nHow can most phones claim to be flagships but still have poor audio overall",
      "score": 6,
      "created_utc": 1751464259.0,
      "replies": [
        {
          "id": "n0y1cez",
          "author": "NecroCannon",
          "body": "Apple’s USB C to 3.5mm adapter is great for all this kind of bs, but at the same time, the less I use Bluetooth headphones the more I end up needing to decide to charge or listen to music.",
          "score": 14,
          "created_utc": 1751465217.0,
          "replies": [
            {
              "id": "n0yavz2",
              "author": "manlybrian",
              "body": "Yep. I've got a 3.5mm jack in my truck, to play my phone's music through the stereo, but I can't conveniently charge my phone at the same time.",
              "score": 6,
              "created_utc": 1751467991.0,
              "replies": [
                {
                  "id": "n0yps5w",
                  "author": "NoSignalOff",
                  "body": "no cigarette lighter socket?",
                  "score": 1,
                  "created_utc": 1751472156.0,
                  "replies": []
                },
                {
                  "id": "n0z94s9",
                  "author": "crasscrackbandit",
                  "body": "How old is that truck? We’ve had BT car stereos for a while now.",
                  "score": -7,
                  "created_utc": 1751477626.0,
                  "replies": [
                    {
                      "id": "n0zb8qp",
                      "author": "manlybrian",
                      "body": "2018 but it's a pretty no frills truck",
                      "score": 5,
                      "created_utc": 1751478214.0,
                      "replies": [
                        {
                          "id": "n0zgrpb",
                          "author": "crasscrackbandit",
                          "body": "Wow. I thought handsfree is a pretty basic stereo feature. So that means you can’t also communicate while driving? Did it came without a stereo? Sorry, I thought Americans valued car stereos more than everybody else since they spend so much time in cars. No BT in a vehicle sold in 2018 is just weird. Weirder than a phone lacking an audio port, tbh.",
                          "score": 1,
                          "created_utc": 1751479790.0,
                          "replies": [
                            {
                              "id": "n0zxnk4",
                              "author": "manlybrian",
                              "body": "It doesn't even have automatic windows or automatic door locks, lol. But I like the old-school nature of it. It does have a reverse camera, so that's nice.",
                              "score": 2,
                              "created_utc": 1751484845.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n0zyxad",
                      "author": "nquesada92",
                      "body": "I had a Bluetooth tape receiver for my tape deck in my 2004, sienna",
                      "score": 1,
                      "created_utc": 1751485236.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n105qx1",
              "author": "IIALE34II",
              "body": "My SO's apple Usb C to 3.5mm has contant hiss on my phone 2, while it doesn't on so's, iPhone. But my phone 2, doesn't have it on my ifi go link. So my phones USB port doesn't have any issues. The issue also replicates with my brothers phone 2. Kind of weird that the usb-c to 3.5mm wouldn't work properly on Android, but on the other hand, that is so apple.",
              "score": 1,
              "created_utc": 1751487261.0,
              "replies": []
            },
            {
              "id": "n0ywwuf",
              "author": "420Adam",
              "body": "Here you go. \n\nhttps://www.amazon.com/dp/B09GYRH6YM?ref=cm_sw_r_cso_cp_apan_dp_FCAFA8GFF9Q4JHWXEDAM&ref_=cm_sw_r_cso_cp_apan_dp_FCAFA8GFF9Q4JHWXEDAM&social_share=cm_sw_r_cso_cp_apan_dp_FCAFA8GFF9Q4JHWXEDAM&previewDohEventScheduleTesting=C&csmig=1",
              "score": 0,
              "created_utc": 1751474199.0,
              "replies": [
                {
                  "id": "n0yy8n1",
                  "author": "NecroCannon",
                  "body": "The reason why Apple’s get recommended is because of the quality of the DaC for the price, something most of the people wanting a 3.5mm jack seeks, especially with open backs",
                  "score": 4,
                  "created_utc": 1751474581.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0yzg0z",
          "author": "nikhkin",
          "body": "Bluetooth and USB to jack adapters produce perfectly acceptable audio quality for 99% of users.",
          "score": 5,
          "created_utc": 1751474925.0,
          "replies": [
            {
              "id": "n0z1qnd",
              "author": "HRudy94",
              "body": "I've yet to see any bluetooth headphones that match or exceed the quality of my 70€ headphones. Even at 3 times the price. Bluetooth is always shit when it comes to audio, with noticeable compression and latency. It is also heavily prone to interferences. WiFi works a lot better for wireless audio, but it's fairly niche.\n\nAs for the USB-C DACs yes they exist but they're not nearly as convenient and it doesn't change anything about the built-in audio itself being bad, you're gonna rely on that USB soundcard's quality instead and that's an additional purchase that you shouldn't have to make on a device that claims itself to be a flagship.",
              "score": -12,
              "created_utc": 1751475566.0,
              "replies": [
                {
                  "id": "n18xu25",
                  "author": "elsjpq",
                  "body": "downvoted for spitting facts. dongles are all universally shit and Bluetooth is all universally shit",
                  "score": 2,
                  "created_utc": 1751600787.0,
                  "replies": []
                },
                {
                  "id": "n11tash",
                  "author": "paaaaatrick",
                  "body": "You gotta look in the mirror and understand that YOU might feel that way and your feelings are certainly valid, but companies aren't going to design something for the extremely niche people like you.",
                  "score": 2,
                  "created_utc": 1751506041.0,
                  "replies": [
                    {
                      "id": "n11wimt",
                      "author": "HRudy94",
                      "body": "Those aren't niche, far from it. A headphone jack is vastly more compatible than bluetooth. The bluetooth headphones are majoritarily able to also work wired.\n\nIn fact people that would prefer to not have a headphone jack anymore are in the very small minority.",
                      "score": 0,
                      "created_utc": 1751507106.0,
                      "replies": [
                        {
                          "id": "n12964u",
                          "author": "paaaaatrick",
                          "body": "Don’t change the argument. “Bluetooth is shit when it comes to audio” is the comment that puts you in the minority. Flagships have an option for wired headphones, and people speak with their wallets and the market moved to wireless",
                          "score": 1,
                          "created_utc": 1751511649.0,
                          "replies": [
                            {
                              "id": "n12cw3s",
                              "author": "HRudy94",
                              "body": "I mean people are still mostly using wired through dongles, so not using Bluetooth wouldn't put me in the minority. \n\nThe fact Bluetooth is shit for audio is a fact though, not an opinion. I mean it's so bad that you can't watch a livestream with it without a significant desync between sound and images. There's new codecs but they're still much worse than a proper wired connection. They all involve some heavy lossy compression to work at remotely decent level. \n\nWiFi has a much higher bandwidth and range compared to Bluetooth.",
                              "score": 1,
                              "created_utc": 1751513128.0,
                              "replies": [
                                {
                                  "id": "n12lwxq",
                                  "author": "Redeem123",
                                  "body": "> I mean people are still mostly using wired through dongles\n\n[False.](https://www.kantarmedia.com/news-and-resources/rise-of-bluetooth-headphones#)\n\n> The fact Bluetooth is shit for audio is a fact though, not an opinion\n\nAnd 1080p is objectively worse than 4k. Yet 1080 is just fine for most people.",
                                  "score": 2,
                                  "created_utc": 1751516935.0,
                                  "replies": [
                                    {
                                      "id": "n14hwje",
                                      "author": "HRudy94",
                                      "body": "Biased stats from a not so trustworthy source, we cannot just have the portion of Bluetooth vs wired users, perhaps the major streaming apps could gather such data and even that would likely result in a sample bias. I also don't trust a stat that tells us that Beats is still relevant compared to any other brand that is talked much more often, Beats by Dre was pretty much bought and put on life support by Apple.\n\n\nThat said image resolution is a good comparison. Flagship computers for instance rarely run 1080p, because as you're paying more, you expect a higher quality. This is the same thing here. I'd go as far as argue it doesn't make sense to remove headphone jacks from all phones since the lower-end are unlikely to be able to afford a new BT headset or a USB-C one either.",
                                      "score": 0,
                                      "created_utc": 1751549771.0,
                                      "replies": [
                                        {
                                          "id": "n155yrv",
                                          "author": "Redeem123",
                                          "body": "> biased stats from a not so trustworthy source\n\nThen post your own source for the claim you made. Surely you have one?\n\nWhether you like it or not, most people are perfectly fine with the sound quality of Bluetooth. Audiophiles who are caught up in getting perfect sound are the minority and always have been.",
                                          "score": 1,
                                          "created_utc": 1751556858.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "n16gx3s",
                                  "author": "paaaaatrick",
                                  "body": "I’m so confused as to why you aren’t living in reality about this. You are clearly an audiophile and that is a minority. Most people who have specific unique hobbies like that understand that they are in the minority. You can make statements like “it sucks flagship phones removed headphone jacks because for audiophiles like me our experience is worse with wireless headphones, but I understand for most people wireless headphones are more convenient and fine for the general population in 2025.”",
                                  "score": 1,
                                  "created_utc": 1751570221.0,
                                  "replies": [
                                    {
                                      "id": "n16qa20",
                                      "author": "HRudy94",
                                      "body": "Let me reiterate as the initial argument wasn't even about that.\n\n\nI started it by saying no jack no buy as it's ridiculous that an expensive phone is stuck to either low-quality sound through bluetooth or inconvenient dongles that aren't even taking profit of the on-board sound card.\n\n\nThen, people said that bringing back the headphone jack would only cater to niches. It wouldn't. First because it doesn't remove the option of Bluetooth, and also because there's a lot more people with wired headphones of some kind at their disposal than there is with Bluetooth headphones.\nAs a proof, most bluetooth headphones also include a headphone jack and oftentimes, even provide a better quality through it.\n\n\nNow, yes, many if not most mobile users are fine with watered-down, compressed sounds through Bluetooth. I mean otherwise people wouldn't use Spotify xD\n\n\nBut there was one time where 480p was fine for most, doesn't mean we stuck to this nor that it would be majoritarily accepted nowadays.\n\n\nMost likely if we asked people whether they'd want to bring back the headphone jack on their phone, the large majority would say yes. I mean you have nothing to lose and everything to win by having more options after all.",
                                      "score": 1,
                                      "created_utc": 1751573011.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n12ey9j",
                  "author": "flufflebuffle",
                  "body": "Unless you're an outlier with amazing hearing, the difference between wired and wireless headphones is basically imperceptible. LDAC combined with streaming with a sufficient bitrate is more than enough.",
                  "score": -1,
                  "created_utc": 1751513967.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0zaknn",
          "author": "MajorLeagueNoob",
          "body": "unfortunately it is not 2015 any more",
          "score": 2,
          "created_utc": 1751478028.0,
          "replies": [
            {
              "id": "n0zbzyo",
              "author": "HRudy94",
              "body": "Yet things haven't changed.\nI still refuse to buy a phone that's unable to provide a good audio experience. Why would i pay the flagship price to downgrade.",
              "score": -4,
              "created_utc": 1751478425.0,
              "replies": [
                {
                  "id": "n0zmor3",
                  "author": "parisidiot",
                  "body": "are there any flagship phones with a jack?",
                  "score": 4,
                  "created_utc": 1751481550.0,
                  "replies": [
                    {
                      "id": "n0zr63b",
                      "author": "WinglyBap",
                      "body": "Sony maybe? Lots of gaming phones have them too.",
                      "score": 4,
                      "created_utc": 1751482879.0,
                      "replies": []
                    },
                    {
                      "id": "n0zt0gs",
                      "author": "HRudy94",
                      "body": "Asus and Sony phones afaik",
                      "score": 2,
                      "created_utc": 1751483438.0,
                      "replies": []
                    },
                    {
                      "id": "n1fwnb1",
                      "author": "TotalAggravating7706",
                      "body": "Sony , Asus & Redmagic. ",
                      "score": 1,
                      "created_utc": 1751704877.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n0zq4o2",
                  "author": "ZDTreefur",
                  "body": "I like jacks too, but you don't need one to get a good audio experience anymore.",
                  "score": 3,
                  "created_utc": 1751482571.0,
                  "replies": [
                    {
                      "id": "n0ztm99",
                      "author": "HRudy94",
                      "body": "You do, yeah there are adapters sure but they're still pretty inconvenient, and Bluetooth leaves a lot to be desired.\nUSB-C headphones are good too but a very rare breed.",
                      "score": 1,
                      "created_utc": 1751483621.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n10dkjq",
          "author": "mangelito",
          "body": "And it doesn't even accept mini discs!",
          "score": -1,
          "created_utc": 1751489511.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0xowjt",
      "author": "-dirtye30-",
      "body": "The lightshow is why I didn't buy it. It would get old fast.",
      "score": 1,
      "created_utc": 1751461188.0,
      "replies": []
    },
    {
      "id": "n11fqp7",
      "author": "cm757200",
      "body": "Priced on par with the OnePlus 13, which has a bigger battery and the snapdragon elite. Dead in the water unfortunately.",
      "score": 1,
      "created_utc": 1751501615.0,
      "replies": []
    },
    {
      "id": "n120cmu",
      "author": "RAF2018336",
      "body": "Limited 5G capability with Verizon makes it a no go for me unfortunately",
      "score": 1,
      "created_utc": 1751508357.0,
      "replies": []
    },
    {
      "id": "n127nii",
      "author": "volecowboy",
      "body": "Seems like a waste of money",
      "score": 1,
      "created_utc": 1751511060.0,
      "replies": []
    },
    {
      "id": "n12un8f",
      "author": "Sa404",
      "body": "That price is a joke for a brand with no perceived value trying to market itself as a luxury brand\n\nSpecs don’t help it either",
      "score": 1,
      "created_utc": 1751521080.0,
      "replies": []
    },
    {
      "id": "n13j53c",
      "author": "banZiii",
      "body": "My OCD couldnt live with those camera placements",
      "score": 1,
      "created_utc": 1751534880.0,
      "replies": []
    },
    {
      "id": "n145uwl",
      "author": "thewrulph",
      "body": "Ugly assymetrical design compared to 1 and 2. No glyphs?!? Premium price but non premium specs... This is not going to sell to their existing userbase...",
      "score": 1,
      "created_utc": 1751545587.0,
      "replies": []
    },
    {
      "id": "n148bmu",
      "author": "BiggiePac",
      "body": "Explain it like I’m 5?",
      "score": 1,
      "created_utc": 1751546500.0,
      "replies": []
    },
    {
      "id": "n18cs7z",
      "author": "linux_n00by",
      "body": "already disappointed with 3a pro with their tiny glyph compared to the first one",
      "score": 1,
      "created_utc": 1751592594.0,
      "replies": []
    },
    {
      "id": "n1cbmyi",
      "author": "TippsAttack",
      "body": "I have never heard of this. What is a Nothing phone?",
      "score": 1,
      "created_utc": 1751651084.0,
      "replies": []
    },
    {
      "id": "n0y0n0b",
      "author": "snowplow9",
      "body": "Ugly phone with mediocre/poor specs and no selling point.",
      "score": 1,
      "created_utc": 1751465004.0,
      "replies": []
    },
    {
      "id": "n0zepqj",
      "author": "Buzzd-Lightyear",
      "body": "Wow, that looks stupid. I didn’t really expect much from a company that relies on marketing so heavily though.",
      "score": 1,
      "created_utc": 1751479193.0,
      "replies": [
        {
          "id": "n136p2z",
          "author": "HarshTheDev",
          "body": ">a company that relies on marketing so heavily though.\n\nThat's every company though? A company that doesn't try to market it's product at every chance they get is just a stupid one.",
          "score": 4,
          "created_utc": 1751527601.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0ylma0",
      "author": "KaiserNazrin",
      "body": "It's nothing without the light show.",
      "score": 1,
      "created_utc": 1751471008.0,
      "replies": []
    },
    {
      "id": "n0zgjl4",
      "author": "ninjasandunicorns",
      "body": "This is not a \"Flagship Phone\" this is \"Nothing's Flagship Phone\"...BIG difference and it shows. I was really contemplating on trying something new and going to Nothing because of the OS but man did they screw this up.",
      "score": 1,
      "created_utc": 1751479724.0,
      "replies": []
    },
    {
      "id": "n0zscgm",
      "author": "cowdoyspitoon",
      "body": "Nothing makes garbage products folks. Don’t be like me",
      "score": 1,
      "created_utc": 1751483237.0,
      "replies": []
    },
    {
      "id": "n0zi1ah",
      "author": "x42f2039",
      "body": "Yet they still haven’t delivered on what they scammed me for with phone 1",
      "score": 0,
      "created_utc": 1751480166.0,
      "replies": [
        {
          "id": "n0zirw7",
          "author": "itastesok",
          "body": "Which was?",
          "score": 1,
          "created_utc": 1751480385.0,
          "replies": [
            {
              "id": "n0zjv6g",
              "author": "x42f2039",
              "body": "Beta software and an NFT, the phone itself was free.",
              "score": -5,
              "created_utc": 1751480708.0,
              "replies": [
                {
                  "id": "n10zoy2",
                  "author": "itastesok",
                  "body": "I'm sure that was very difficult for you. Hope everything is okay now.",
                  "score": 1,
                  "created_utc": 1751496380.0,
                  "replies": [
                    {
                      "id": "n110xl2",
                      "author": "x42f2039",
                      "body": "I’m just pissed that they scammed me for around $400USD",
                      "score": 0,
                      "created_utc": 1751496788.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n0xu6u7",
      "author": "Soft_Bumblebee7667",
      "body": "F.L.O.P",
      "score": 0,
      "created_utc": 1751462961.0,
      "replies": []
    },
    {
      "id": "n0yka2i",
      "author": "TSwizzlesNipples",
      "body": "I'm thinking my next phone is going to be a [Blu phone.](https://www.bluproducts.com/android-phones/)",
      "score": 2,
      "created_utc": 1751470638.0,
      "replies": [
        {
          "id": "n0yy4nc",
          "author": "kligoretr88",
          "body": "Anyone have one of these Blu phones? Thinking of getting a dedicated “house phone” that’s just another mobile that stays in place for reaching my aging parents more easily.",
          "score": 1,
          "created_utc": 1751474549.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0zdgn2",
      "author": "Akrevics",
      "body": "So just another third party phone that will sit on shelves without the one thing distinguishing it from the rest. No glyphs, bit greater than mediocre specs, etc.",
      "score": 0,
      "created_utc": 1751478837.0,
      "replies": []
    },
    {
      "id": "n0zw10l",
      "author": "MisterDonutTW",
      "body": "Don't understand why this is popular.\n\nIt's a mediocre Chinese brand that's only claim to fame is that it's easier to buy in the west than the superior flagship brand Chinese phones.  It's also ugly.",
      "score": -7,
      "created_utc": 1751484349.0,
      "replies": [
        {
          "id": "n0zwjt7",
          "author": "Shiningc00",
          "body": "It’s a British brand.",
          "score": 5,
          "created_utc": 1751484507.0,
          "replies": []
        },
        {
          "id": "n12dlmo",
          "author": "alidan",
          "body": "the first I want to say 5 one plus phones were flagship killers, flagship specs at barely profiting prices, I phones cost 250$ in parts, and cost 1000$, imagine if you for that but for 300$, thats what one plus use to be. \n\nproblem is once you get close to big boy costs, I no longer am willing to put up with jankeyness that comes with a lesser brand.",
          "score": 1,
          "created_utc": 1751513415.0,
          "replies": []
        }
      ]
    }
  ]
}